{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "CAB and SCSF are recommended for WinForms development.  ",
    "ClosedDate": "2010-08-02T10:28:18.763-07:00",
    "CommentCount": 4,
    "Custom": "",
    "Description": "I would like to suggest that a WinForm version of this code be developed. We have a huge amount of existing WinForm controls and at this time it is simply to much work converting all of this into WPS. I would think that this is case for many other developers. I do believe that WinForm development would benefit just as much from this application block.",
    "LastUpdatedDate": "2013-05-16T05:29:02.87-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2008-09-15T06:08:22.467-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "WinForm version",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 11,
    "Id": 2989
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I agree... Composite WPF is so much easier to understand, extend and use than CAB that it might be come a popular choice for many.\r\nAlso just being able to use the event aggregator, command pattern etc. from Composite WPF out of the box with WinForms would be very helpful.\r\n\r\nThanks,\r\nPatrick",
      "PostedDate": "2008-09-27T13:43:51.303-07:00",
      "Id": 156029
    },
    {
      "Message": "Hi\r\n\r\nYou may find interesting Brian Noyes’ blog post Composite Extensions for Windows Forms (http://www.softinsight.com/bnoyes/2008/10/13/CompositeExtensionsForWindowsForms.aspx). It provides a set of libraries to use the Composite Application Library in Windows Forms.\r\n\r\nHope it helps.\r\n\r\nIgnacio Baumann Fonay\r\nhttp://blogs.southworks.net/ibaumann/",
      "PostedDate": "2008-10-24T09:28:28.683-07:00",
      "Id": 156030
    },
    {
      "Message": "I second patwolf's comment on Prism being so much easier to understand than CAB/SCSF stuff.  Last time, I tried to use it I gave up because there was so much to cover - that and it also involved installing a bunch of visual studio extensions, which I did not enjoy at all.\r\n\r\nI saw Brian Noyes's blog post, and immediately adapted it for my own use - in fact, I went back and added the region stuff and everything.\r\n\r\nThe only other request is that the WinForms version be based on .NET 2.0 - I am thinking that most WinForms development is still don on that version of the framework.",
      "PostedDate": "2008-10-29T08:03:23.083-07:00",
      "Id": 156031
    },
    {
      "Message": "Yes, Composite library the same time for WPF, Silverlight and WinForms would be a good idea. I believe that currently the library seems to be focused on Silverlight support but my quess is that lots of people still in the need of having composable WinForms applications even developed using .net 3.5",
      "PostedDate": "2009-01-13T06:58:27.71-08:00",
      "Id": 156032
    }
  ]
}