{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 3,
    "Custom": "",
    "Description": "We don't see our systems getting upgraded to .NET 4.0 in the near future. Is it possible to use PRISM's newer version with .NET 3.5? We do have VS2010 but still target all our applications to .NET 3.5. Exploring the idea of using PRISM. Any suggestions would be highly appreciated.",
    "LastUpdatedDate": "2013-03-15T02:16:51.583-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2012-12-05T12:09:41.29-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Can I use Prism 4.0/4.1 with .NET 3.5?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 9770
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Hi,\r\n\r\nBased on my understanding the current version of Prism (v4.1), as mentioned in the System Requirements section of the documentation,  will require having Microsoft .NET Framework 4.0 as this version was built benefiting from this version. Also, regarding this topic you could find the following blog post interesting:\r\n\r\nPrism 4.0 – Have Your Say! https://blogs.msdn.com/b/dphill/archive/2010/04/28/prism-4-0-have-your-say.aspx?Redirected=true\r\n\r\nBased on this, if moving your projects to .NET 4.0 is not an option, I believe you could consider using a previous version. For example, you could check the Prism 2.1 version which was built targeting Microsoft .NET Framework 3.5 SP1.\r\n\r\nYou could find the links to this version here:\r\n\r\nDownload: Prism (Composite Application Guidance for WPF and Silverlight) 2.1 - October 2009 (http://www.microsoft.com/en-us/download/details.aspx?id=20205)\r\n\r\nDocumentation: Prism 2.x (http://msdn.microsoft.com/en-us/library/ff648611.aspx)\r\n\r\nRegards,\r\n\r\nAgustin Adamihttp://blogs.southworks.net/aadami",
      "PostedDate": "2012-12-06T05:17:27.95-08:00",
      "Id": 156622
    },
    {
      "Message": "Thanks Agustin for your reply.. \r\n\r\nI know that Prism v4.1 is intended for .NET 4.0 but was still hoping that it will be the same as v4.0. I have googled few links below that says Prism v2.2 is for 3.5 and Prism v4.0 is for both v3.5 and v4. \r\n\r\n1. http://www.intertech.com/Blog/Post/7-Things-You-Need-to-Know-Before-Starting-a-Prism-WPF-Project.aspx2. http://briannoyes.net/2010/06/02/Prism22IsOutAndPrism4IsInTheWorks.aspx\r\n\r\nI feel that I can use Prism v4.0 with .Net 3.5. Don't know about Prism v4.1??",
      "PostedDate": "2013-01-07T09:37:17.39-08:00",
      "Id": 156623
    },
    {
      "Message": "Hi,\r\n\r\nIn my opinion, using the Prism 4.0 may not be appropriate for this scenario as this version was developed and tested focusing on the new features available in .NET 4.0.\r\n\r\nRegarding, the posts you mentioned, it seems that these may not be fully updated, as they have been written before the stable releases of Prism version 4. Also, as you may find in David Hill's blog post mentioned in this work item, there was a poll within the community to decide if Prism 4.0 version should also target .Net 3.5. There they decided to focus only on version 4.0 of the framework.\r\n\r\nRegarding version 4.1, there won't be much difference as this version primarily focused on updating Prism for Silverlight 5 and addressing issues identified by the community on CodePlex.\r\n\r\nAlso, as a quick test, you will find that version errors are thrown when trying to reference a version of Prism 4 in a .Net 3.5 project. And in case you consider changing the target framework of the Prism source code to avoid this kind of errors, you may find that many of its features will not be compatible, for example like the MefExtension as MEF was shipped with the .Net framework 4.0, or some Interativity features that deppend on .Net 4.0 assemblies, etc.\r\n\r\nBased on this, I believe Prism 2.2 version could be a more suitable choice.\r\n\r\nBest Regards,\r\n\r\nAgustin Adamihttp://blogs.southworks.net/aadami",
      "PostedDate": "2013-01-08T11:02:25.26-08:00",
      "Id": 156624
    }
  ]
}