{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Please see Prism 4.0 CTP - August 2010 at http://compositewpf.codeplex.com/releases/view/49963",
    "ClosedDate": "2010-08-02T13:55:41.4-07:00",
    "CommentCount": 0,
    "Custom": "",
    "Description": "This suggestion started as a question in the Discussions section: \nhttp://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=78259\n \nCurrently the Prism documentation does mention MVVM and \"Model-View-ViewModel\" in several places, but my suggestion is that be made more prominent in the next version.  The \"Stock Trader\" (\"RI\" = reference implementation) does make use of the \"Presentation Model\" pattern, which is basically equivalent to MVVM, but I'd be happier if that was made clearer.  The SL and WPF blogs are full of discussion of MVVM and \"Model-View-ViewModel\", and that's the naming that new learners (like me) are probably going to be looking for.\n \nOne of the things I like about David Hill's excellent Prism VS project templates, which I have used for a while, is that the class and directory names are all explicitly MVVM-oriented.  There are directories named Models, Views and ViewModels.  See:\n  http://blogs.msdn.com/dphill/archive/2009/05/29/prism-quick-start-kit.aspx\n  http://blogs.msdn.com/dphill/archive/2009/06/15/prism-quick-start-kit-update.aspx\n \nExternal Prism+MVVM resources like John Papa's PDC talk, and David Hill's MVVM-oriented templates are great, but I think that should get baked more directly into the Prism docs and demos.\n \nThanks,\nAlan Cobb\nwww.alancobb.com/blog",
    "LastUpdatedDate": "2013-05-16T05:28:55.33-07:00",
    "PlannedForRelease": "Prism 4.0 CTP - August 2010",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2009-12-18T22:05:47.953-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Make Prism's use of MVVM more explicit in docs and samples",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 16,
    "Id": 5622
  },
  "FileAttachments": [],
  "Comments": []
}