{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Hi,\r\n\r\nI'm closing this work item, as the feature suggested in it has already been implemented.\r\n\r\nThanks,\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
    "ClosedDate": "2011-08-19T07:36:47.277-07:00",
    "CommentCount": 1,
    "Custom": "",
    "Description": "I really need a mechanism from Prism which allow Prism-based application being able to navigate to a page opened in a separate window. I check the Prism document Chapter 7 Navagation, looks the navagation avaliable in the Prism are either State-based or View-based, the latter is quite close to what I am looking for. But it is still the navagation inside the one window. Will Prism provide this capability in Silverlight? Note, the page(view) hosted in a \"new window\" means that it is not \"Modal\" child window. The \"new window\" is more like a new shell to host necessary views(pages), it should like a \"sibling\" to origial shell window.",
    "LastUpdatedDate": "2013-05-16T05:28:47.867-07:00",
    "PlannedForRelease": "Prism v4 - Drop 8",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2010-09-30T12:17:19.753-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Navigation: Will Prism allow opening \"new window\" style navigation in Siverlight?",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 3,
    "Id": 7321
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "The way we would handle this in Prism is to have a region with a popup or create-new-window behavior.  We demonstrate this approch in the StockTraderRI and reading the news articles.  In the RI, the RegionPopupBehaviors creates a region that shows or updates the contents of Window based on the items in a region.\r\n\r\nHTH,\r\n\r\n-b",
      "PostedDate": "2010-10-08T11:46:13.22-07:00",
      "Id": 156323
    }
  ]
}