{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Hi,\r\n\r\nI'm closing this issue, as we were unable to reproduce the problem with code contracts mentioned in the work item.\r\n\r\nThanks,\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
    "ClosedDate": "2011-11-10T07:06:50.103-08:00",
    "CommentCount": 1,
    "Custom": "",
    "Description": "When using Microsoft Code Contracts together with CAL a \"duplicate module\" exception is thrown since code contracts creates an additional assembly (AssemblyName).Contracts.dll which for some reason receives the \"ModuleName\" from the assembly (AssemblyName).\n \nNot sure if this is a CAL or CC issue",
    "LastUpdatedDate": "2013-05-16T05:28:54.87-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2010-01-13T14:56:16.637-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "duplicate module exception with code contracts",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 5743
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Hi,\r\n\r\nWe've tried adding code contracts to a Prism module, and we changed the configuration so that the contract reference assemby (the AssemblyName.Contracts.dll one) was built. We've experienced no errors when doing so.\r\n\r\nWe did verify that the assembly had the same name than the module's assembly, which could cause problems in case you are using a DirectoryModuleCatalog. If you're doing so, you could try using another method for module loading, such as defining them in a Xaml or App.config file.\r\n\r\nIf you are still experiencing this issue, it would be helpful if you could provide us with a repro sample of your application, so that we can help you find the cause of your problem.\r\n\r\nNote that we've tested this using Code Contracts version 1.4.40314.1, with Prism v4.\r\n\r\nThanks,\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
      "PostedDate": "2011-04-05T10:47:07.54-07:00",
      "Id": 156206
    }
  ]
}