{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 1,
    "Custom": "",
    "Description": "If you think (Like me) that upload the Prism binaries to CDN (Like ajax - http://www.asp.net/ajax/CDN/) is good idea please vote for that issue. \nThis will give us the ability to make xap files smaller and download faster in addition of that the binaries will work as same as the GAC... \nThanks.",
    "LastUpdatedDate": "2013-02-21T18:38:42.997-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2009-11-04T00:32:34.307-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Adding Prism DLL's to CDN",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 5,
    "Id": 5415
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Hi,\r\n \r\nWe examined how Silverlight applications could benefit from assemblies uploaded to a CDN. We found that, while it’s possible to reference JavaScript files, or a whole Silverlight application from an external location, it might not be the same case for assemblies such as the Prism Library.\r\n \r\nOne possibility to achieve this might involve setting the Prism references with CopyLocal to false, remotely downloading the required assemblies from a CDN, and then loading them into the app domain programmatically. This should be done prior to loading the main XAP into the app domain, so users would need to have a “wrapper project” over their shell project with this code, and it should only load the shell project’s assemblies into the app domain once the required assemblies have downloaded. Taking these factors in consideration, we believe this might not be a straightforward approach for users wishing to benefit from this feature.\r\n \r\nThanks,\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
      "PostedDate": "2012-01-20T12:42:16.943-08:00",
      "Id": 156184
    }
  ]
}