{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Thank you for your comments and votes.\r\n\r\nWe have put a lot of work into the Prism Guidance in both v2.2 and the new v4 with updated Quick Starts and RI's.\r\n\r\nWe have also added a chapter on Designing the User Interface.\r\n\r\nHave a great day,\r\n\r\nKarl\r\n\r\n\r\n\r\n\r\n",
    "ClosedDate": "2010-09-15T15:12:38.763-07:00",
    "CommentCount": 3,
    "Custom": "",
    "Description": "It would be very helpful to have a document/guidance that covered the P&P teams learnings from the development process of Prism. The most significant one I can think of is how the development team interacted with the UI design expert and the impact that has on any pre-existing code base (obviously this is very different to historical UI applications). What approach was taken, and what learnings occurred after going through the real exercise. This guide should help others steer clear of any implementation 'gotchas' when building a composite application solution with Prism.",
    "LastUpdatedDate": "2013-05-16T05:29:05.91-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2008-06-04T16:10:08.313-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Create Prism learnings guide/blog",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 22,
    "Id": 2319
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I think a How-to section would be useful. Containing short, focused code examples, showing the P&P preferred approach to common programming tasks.\r\nIt may also be useful if we could request a particular How-to and let people show their need level by voting for it. \r\nHow to add pre-existing (non prism based) User Controls.\r\nHow to dynamically change content of a region. Collapse and show particular user controls in a given region.\r\n",
      "PostedDate": "2008-11-24T04:25:11.927-08:00",
      "Id": 155999
    },
    {
      "Message": "Great work!\r\nWe really need more examples. ",
      "PostedDate": "2008-11-28T05:13:51.683-08:00",
      "Id": 156000
    },
    {
      "Message": "Great work!\r\nWe really need more examples, I've seen a great WebCasts on using MVVM http://channel9.msdn.com/posts/akMSFT/Creating-a-modular-application-using-Prism-V2-Screencast-34--Implementing-views-and-services/ . This would be great to see these in work in examples you can just download.",
      "PostedDate": "2009-09-17T05:17:29.673-07:00",
      "Id": 156001
    }
  ]
}