{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 0,
    "Custom": "",
    "Description": "I have a WPF application build with CAL guide (I'm not using Unity but I do have modules, service, shell).\n \nI would like to have the state of my application persist and restore so that changes the user made to the UI will persist. By state I mean windows position and size, grid column order and size, selected menus, open windows, even down to the selected item in a list and the position of the scroll viewer.\n \nSure there is an application specific part here since I can't expect a framework understand all of my application but there is sure room here for a general purpose framework or guide on how to go about this thing.\n \nFor example, where to store the state while the application is not working. If I persist everything to a single file it may get very large and restoring state will be slow.\n \nVersioning - How to keep the data backward and forward compatible so if I remove a column from a grid the thing will not blow, also when I add new one it should get a reasonable default.\n \nEnterprise support - This go hand-in-hand with where to persist - for enterprise application I would like my state to be in any workstation I use, not just my local computer.\n \n[Related discussion at http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=216619&ANCHOR#Post463965 \n \nThank you,\n \nIdo",
    "LastUpdatedDate": "2013-02-21T18:38:36.83-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2010-07-06T15:15:26.013-07:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Application State Persist and Restore",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 1,
    "Id": 6954
  },
  "FileAttachments": [],
  "Comments": []
}