{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Hi,\r\n\r\nAs explained in this thread (http://compositewpf.codeplex.com/discussions/223941), and also by the user rmaciag in the comment below, it's not possible to unload modules in Prism.\r\n\r\nYou could try removing all the views your module added, and unregistering all the services registered by your module.\r\n\r\nThanks,\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
    "ClosedDate": "2011-11-18T09:47:37.817-08:00",
    "CommentCount": 1,
    "Custom": "",
    "Description": "Hi Prism Team,\n \nWe are using Prism 2.2 version for developing our WPF Application. We are using the DirectoryModuleCatalog to load the required Modules. To load the modules in the runtime we are using OnDemand Mode. \n \nOur application has sevaral modules, some has depencies to the others and some or not.  Suppose if i am working with a Standalone module which has one view and view model. After completing its work, i should have an option to Unload the module from the Prism Application. But currently i couldn;t find how to uloading the modules from the Module Manager.\n \nI want to understand, is the approach i have taken is correct ? if so, how do i remove the loaded module ?",
    "LastUpdatedDate": "2013-05-16T05:28:42.327-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2011-06-30T05:35:18.647-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Unloading the Module in Run Time",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 8407
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "One cannot unload a module. You would need to have separete Application Domain for every Module, That whould be very flustrating especially because of communication between modules in diferent app-domains. Only Application Domain can be unloaded from memory. If you thought about the same app-domian then what about static data in a module????",
      "PostedDate": "2011-07-01T07:35:28.923-07:00",
      "Id": 156473
    }
  ]
}