[
  {
    "Id": "307387",
    "ThreadId": "100423",
    "Html": "<p>I have a view that was added to a scoped region. &nbsp;This view references a composite command that is defined globally (static) to the application. &nbsp;I toggle the active state of all commands&nbsp;registered with the composite command when the active state of the view changes, i.e., IActiveAware. &nbsp;My issue is that the scoped view is always active because scoped views are never made aware of when a parent view is activated or deactivated. &nbsp;I have written a region behavior called SyncIsActiveAwareBehavior which syncs the active state of scoped views based upon the active state of a parent view (owner of the scoped region,) but I'm not sure if this is the best way to handle this type of scenario. &nbsp;Is there any guidance on how best to work with scoped regions? &nbsp;It seems like Prism really breaks down once you have to manage a lot of scoped regions, say in a MDI interface. &nbsp;I'm hoping that there is some guidance in this area currently and that future versions of Prism will provide a better programming model for dealing with scoped regions.</p>",
    "PostedDate": "2010-02-20T11:54:47.47-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "587500",
    "ThreadId": "100423",
    "Html": "<p>jcain or anyone else,</p>\r\n<p>I'm also facing the same issue and I was wondering if anyone can think of a nice solution.</p>\r\n<p>I was hoping that there would be an elegant way of registering a scoped region to it's parent-regions IActiveAware notifications.....</p>",
    "PostedDate": "2011-03-28T04:10:53.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "587632",
    "ThreadId": "100423",
    "Html": "<p>Hi,</p>\n<p>The solution proposed by jcain seems to be a valid workaround for achieving your scenario. I've copied this into a <a href=\"http://compositewpf.codeplex.com/workitem/8061\">work item</a> in the <a href=\"http://compositewpf.codeplex.com/workitem/list/basic\">Issue Tracker</a>, so that the possibility of adding a behavior that syncs the <strong>ActiveAware </strong>state of the views throughout scoped regions to a future version is considered.</p>\n<p>Thank you four your feedback.</p>\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-03-28T08:05:04.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "616876",
    "ThreadId": "100423",
    "Html": "<p>Hi,</p>\r\n<p>The user <a id=\"PostedByLink0\" href=\"http://www.codeplex.com/site/users/view/tearaway_Tea\">tearaway_Tea</a> has asked the following question in the work item associated to this thread:</p>\r\n<p><em>\"Hey, is it possible to get the implementation of yours SyncIsActiveAwareBehavior? Could you attach a file or something. Thanks!\"</em></p>\r\n<p>Thanks,</p>\r\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-05-23T10:27:20.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]