[
  {
    "Id": "344576",
    "ThreadId": "137452",
    "Html": "<p>Hi</p>\r\n<p>I'm in the learning process with Visual Studio 2010 Silverlight 4 and Prism. I want to create a simple Silverlight Client using Prism and I want to access a simple WCF service.</p>\r\n<p>I have read quite many&nbsp; articles and forum posts and get only more confused. The answers to my questions may depend on the version of Silverlight I use but here goes:</p>\r\n<p>1) To call a WCF service from Silverlight it must use the Async Pattern?</p>\r\n<p>2) Is it possible to call a WCF service using SOAP or do you have to use a RESTful service only?</p>\r\n<p>3) Do I have to use the ClienAccessPolicy.xml file in both SL2, SL3 and SL4? Or is this handle different in SL 4?</p>\r\n<p>I think I'll start with this questions and continue to search the web for answers.</p>",
    "PostedDate": "2010-02-21T11:22:07.113-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "409941",
    "ThreadId": "137452",
    "Html": "<p id=fade8620-0537-012d-fbaa-123139096d81>Hi</p>\r\n<p id=fade9470-0537-012d-fbab-123139096d81>I&rsquo;ll try to address your  questions separately. However, take into account that as this question  are not Prism specific and you might get a more complete answer in the  <a href=\"http://forums.silverlight.net/forums/\">Silverlight forums</a>.</p>\r\n<ol>\r\n<li>Yes, al Web service calls in  Silverlight are asynchronous. You can read more about that <a href=\"http://msdn.microsoft.com/en-us/library/cc197937(VS.96).aspx\">here</a>.</li>\r\n<li>You can read about Silverlight 4 and SOAP services <a href=\"http://msdn.microsoft.com/en-us/library/cc197959(VS.96).aspx\">here</a>.</li>\r\n<li>To make a service available across domain boundaries you have to  follow <a href=\"http://msdn.microsoft.com/en-us/library/cc197955(VS.96).aspx\">this  process</a>.</li>\r\n</ol>\r\n<p id=fadea5d0-0537-012d-fbac-123139096d81>Please  let me know if this helps.</p>\r\n<p id=faded000-0537-012d-fbad-123139096d81>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2010-02-26T11:08:43.917-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "416050",
    "ThreadId": "137452",
    "Html": "<p>Thank you for your answers. I'm working with Prism and SL on my sparetime so I'm a bit slow on responding.</p>\r\n<p>I can see that my questions are a bit more general, but here is a question related to Prism and the use of WCF services: When using the container is it possible to handle the lifetime of the service?</p>\r\n<p>Is there any good documentation on handling service lifetime in Prism?</p>\r\n<p>Thanks again for your patience!</p>",
    "PostedDate": "2010-03-09T11:33:24.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]