[
  {
    "Id": "436841",
    "ThreadId": "210942",
    "Html": "<p>As VS 2010 is available , Enterprise library 5 is here. PRISM 4.0 is not coming very soon. What if you people release some thing like PRISM 2.2 or 3.0 rather than builds. I am reading some where that these builds are not fully tested. What you say to those developers which are starting a new project with VS 2010 and enterprise library 5 should they use builts.</p>",
    "PostedDate": "2010-04-28T19:14:17.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "437226",
    "ThreadId": "210942",
    "Html": "<p id=0516cdf0-35da-012d-b70e-1231390ab261>Hi,</p>\r\n<p id=0516d730-35da-012d-b70f-1231390ab261>There is probably going to be  an interim updated, most likely called Prism 2.2, as stated on <a href=\"http://blogs.msdn.com/simplifying_patterns_and_practices/archive/2010/03/15/prism-a-look-ahead.aspx\">this  blog post</a> by the Patterns &amp; Practices Client Team. As mentioned in  <a href=\"http://blogs.msdn.com/bobbrum/archive/2010/04/23/prism-source-updated-for-unity-2-0-and-silverlight-4.aspx\">this  blog post</a>, no issues have been reported with this new build, but it  was only smoke tested.</p>\r\n<p id=a719c070-35e1-012d-2b09-1231390ab261>I hope you find this helpful.</p>\r\n<p id=0516f4f0-35da-012d-b711-1231390ab261>Guido Leandro Maliandi     <br><a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2010-04-29T10:24:09.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441202",
    "ThreadId": "210942",
    "Html": "<p>Hi Guido,</p>\r\n<p>I could see the WPF composite dlls are built on .NET 3.5, not on .NET 4.0 as mentioned in the blog post:</p>\r\n<p><a href=\"http://blogs.msdn.com/bobbrum/archive/2010/04/23/prism-source-updated-for-unity-2-0-and-silverlight-4.aspx\">http://blogs.msdn.com/bobbrum/archive/2010/04/23/prism-source-updated-for-unity-2-0-and-silverlight-4.aspx</a></p>\r\n<p><a href=\"http://compositewpf.codeplex.com/SourceControl/changeset/view/41709#839931\">http://compositewpf.codeplex.com/SourceControl/changeset/view/41709#839931</a></p>\r\n<p>Do you have plans to release an updated version with .NET 4.0 projs? Any reason why they are still .NET 3.5?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks,</p>\r\n<p>Jay</p>",
    "PostedDate": "2010-05-10T13:05:32.957-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441419",
    "ThreadId": "210942",
    "Html": "<p>&gt;&gt;&nbsp;&nbsp;Any reason why they are still .NET 3.5?</p>\r\n<p>There are a bunch of us in the corporate environments that dont have the ability to move to 4.0 yet.&nbsp; There are lots and lots of restrictions on what software is allowed and to use it, it has to go through the proper governance procedures.&nbsp;</p>\r\n<p>Its a pain, but&nbsp;a normal part of life in big corporations.&nbsp; We dont always get to move with the rest of the world.&nbsp; Heck, I am writing this on XP sp3, not by my choice, but because that is the corporate standard until Win 7 gets approved and moved to the desktops.&nbsp; Vista was a no go.&nbsp; Win 7 is early next year at the soonest, maybe.&nbsp; .Net 4.0 might make it by the end of the year.&nbsp; Certain groups might get exceptions and be able to run those earlier, but only&nbsp;on a limited set of client desktops as &quot;proving ground&quot;.</p>\r\n<p>When you have 10's of thousands of desktops, its a big thing to approve both OS's and the software that runs on them.&nbsp;</p>\r\n<p>It is my impression that the Corp world is a large target market for Prism.&nbsp; If&nbsp;the current&nbsp;distribution&nbsp;went to 4.0 and vs2010 <strong>exclusively</strong>, it would alienate a large percentage of that market IMO.&nbsp;</p>\r\n<p>I agree though, that the current prism should be able to be built and available in both 3.5 and 4.0 versions, and that there shold be a release that does just that.&nbsp;&nbsp;</p>\r\n<p>IMO, Prism vNext&nbsp;should target 4.0, but it should maintain backward compatibility if at all possible.&nbsp; If it cant, at least keep the 3.5 version working and quasi supported&nbsp;until .net 5.0 and vs2015 hits the streets.&nbsp; Create a branch, or whatever is needed, but dont drop the current&nbsp;prism's 3.5 compatibility/buildability&nbsp;for a while.&nbsp; Please.&nbsp;</p>\r\n<p>In my personal environments, I love to see Prism vNext use the latest and greatest.&nbsp; But the work environment aint quite the same.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-11T04:36:13.347-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441434",
    "ThreadId": "210942",
    "Html": "<p>Totally agree with pmon. &nbsp;We are still on XP SP3 at my large corporate environment and while we have been able to get SL3 and .NET 3.5 passed it is unlikely that we will get to move to SL4 and .NET 4 for quite a while. &nbsp;Very frustrating for us I can tell you!! &nbsp;</p>\r\n<p>I wouldn't want to hold people on the bleeding edge back but we also want to have some decent roadmap for our continued use of Prism.</p>",
    "PostedDate": "2010-05-11T05:31:37.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "441447",
    "ThreadId": "210942",
    "Html": "<p>Also at big corp.&nbsp; Just to offer a different perspective.&nbsp; Unless software is released, it doesn't get approved for use.&nbsp; Delaying a version for 4.0 Framework doesn't help anyone.&nbsp; In our case, we are working on a brand new 'big corp' software package for the enterprise.&nbsp; We were able to get it approved for VS2010 and 4.0 Framework because it will take over a year to get into production.&nbsp; The further we get along in development, the harder it will be to upgrade anything.&nbsp; But I can tell you that at the moment, we are using VS 2010, .NET 4.0 and the latest PRISM/CAL/CAG (Whatever you call it!).&nbsp; It all compiles and runs fine without complaint.</p>",
    "PostedDate": "2010-05-11T05:57:13.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "442306",
    "ThreadId": "210942",
    "Html": "<p>We are working on a Prism 2.2 that will be dropped to Codeplex. This version will target VS2010 and .NET 3.5. The point of this version is to provide a version of Prism that works with Silverlight 4. If anyone needs VS2008 and .NET 3.5, the current version on MSDN will work.</p>\r\n<p>Blaine Wastell</p>\r\n<p><a href=\"http://blogs.msdn.com/blaine\">http://blogs.msdn.com/blaine</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-12T16:18:13.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]