[
  {
    "Id": "443965",
    "ThreadId": "212942",
    "Html": "<p>It&rsquo;s a common requirement to turn the views in specific modules on/off or to add more view in a specific module in response to user action. What is the best way to accomplish this? Is there any extensibility point within Prism which can be used to accomplish this? (I can write a wrapper class and make all modules register to it on initialization and perform all such operations through this wrapper class, I am interested in knowing if there is a better way to do this)</p>\r\n<p>p.s. &ndash; I am using Prism v2&nbsp;with Silverlight 4</p>",
    "PostedDate": "2010-05-17T13:30:51.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "444911",
    "ThreadId": "212942",
    "Html": "<p id=2d7acbe0-44d5-012d-2c7e-1231390ee901>Hi,</p>\r\n<p>Before going  into the question itself, please note that although views are inside  modules, they cannot be added or removed from them. Modules are logical  units in your application, and are not part of the UI. Views are the  composite portions of the user interface, and they can be added into  regions, which are not inside modules. You can find a more detailed  explanation of this subject in <a href=\"View.aspx?ThreadId=62400\">this  thread</a>, where you can also find some information about loading a  view in response to user action.</p>\r\n<p id=2d7aea10-44d5-012d-2c80-1231390ee901>As for turning views on and  off, you probably don&rsquo;t need to use an extensibility point. A possible  approach for this would be to publish events through the EventAggregator  in response to user action, and have your modules listen to those  events so that they show or hide views when needed (you could find <a href=\"http://blogs.msdn.com/erwinvandervalk\">Erwin Van Der Valk</a>&rsquo;s <a href=\"http://blogs.msdn.com/erwinvandervalk/archive/2009/03/02/how-to-build-an-outlook-style-application.aspx\">Outlook  style application</a> useful for understanding this). You can check <a href=\"http://blogs.southworks.net/matiasb/2009/07/02/how-to-hide-views-inside-composite-application-guidance-aka-prism-v2-regions/\">this  post</a> by <a href=\"http://blogs.southworks.net/matiasb/\">Matias  Bonaventura</a> where he explains how to hide and show views in a Prism  application.</p>\r\n<p id=2d7b0160-44d5-012d-2c81-1231390ee901>I hope  you find this helpful.</p>\r\n<p id=2d7b1920-44d5-012d-2c82-1231390ee901>Guido  Leandro Maliandi    <br><a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2010-05-19T07:40:13.783-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]