[
  {
    "Id": "449592",
    "ThreadId": "214462",
    "Html": "When building a project using Prism are there any guidelines on where to locate the prism dll's.  Should I for example create a library folder within each module and copy the files into that library before referencing them?  Also I see three files with the dll, pdb and xml extensions. Do I need to also include the pdb and xml extension files? \r\n\r\nThanks in advance, \r\n\r\nRichard",
    "PostedDate": "2010-05-31T06:23:10.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "450230",
    "ThreadId": "214462",
    "Html": "<p id=a1959190-4fda-012d-ce83-1231390f0921>Hi,</p>\r\n<p>There are no specific guidelines on where to locate the Prism dll&rsquo;s. You could possibly place the CAL&rsquo;s dll files inside a library folder (e.g. lib). Take into account that you shouldn&rsquo;t place a library folder inside each module, but rather place them in a shared place, to avoid duplication that would increment your solution&rsquo;s size unnecessarily.</p>\r\n<p>In case you could benefit from modifying or adapting the CAL in any way, you could put a reference to the CAL projects in your solution, as done in the <a href=\"http://msdn.microsoft.com/en-us/library/ff649318.aspx\">Quickstarts</a>. In those cases, the CAL&rsquo;s assemblies get compiled and placed into your application&rsquo;s bin folder.</p>\r\n<p>As for the other files, you don&rsquo;t need to include XML nor PDB files, since the former contain documentation and the latter contain debug information that is not necessary for the deployment of the application. You can check <a href=\"http://msdn.microsoft.com/en-us/library/b2s063f7(VS.71).aspx\">this article</a> for more information about XML documentation files, and <a href=\"http://msdn.microsoft.com/en-us/library/b2s063f7(VS.71).aspx\">this one</a> for PDB files. In a development scenario, however, you could include those files as they provide a better experience.</p>\r\n<p id=a195c470-4fda-012d-ce86-1231390f0921>I hope you find this helpful.</p>\r\n<p id=a195d840-4fda-012d-ce87-1231390f0921>Guido Leandro Maliandi <br><a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2010-06-01T12:44:19.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]