[
  {
    "Id": "449473",
    "ThreadId": "214424",
    "Html": "<p>Hi all</p>\r\n<p>I am new to Prism and try to learn as fast as possible.</p>\r\n<p>Straight to my question.Is there&nbsp;anywhere a quick video on how you do TDD using Prism ideally with Moq?</p>\r\n<p>Has anybody got an example on Prism and Moq? It&nbsp; would be fantastic if somebody could share some projects where Prism and Moq are used. Tried to google but nothing really.</p>\r\n<p>I would like to TDD everything I do in Prism and some examples would definitely help.</p>\r\n<p>I know that in EntLib5 are also using Moq. Is the Prism Team &nbsp;planning to use Moq in their test?</p>\r\n<p>Thanks a lot</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-05-31T00:05:03.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468431",
    "ThreadId": "214424",
    "Html": "<p id=24fbeaf0-733b-012d-1734-1231390b9201>Hi,</p>\r\n<p id=24fbfdc0-733b-012d-1735-1231390b9201>The product team of <a href=\"http://compositewpf.codeplex.com/releases/view/48920\">Prism v4</a> is already using moq in their unit tests. Therefore, you would be able to find some sample in <a href=\"http://compositewpf.codeplex.com/releases/view/48920\">Prism v4</a> using this.</p>\r\n<p id=24fc1720-733b-012d-1736-1231390b9201>However, if I&rsquo;m not wrong there are not videos regarding to this. Additionally, take into account that when you download a Prism drop, you won&rsquo;t find the moq assemblies as they are not distributed. So you would need to manually download them and copy into the <strong>lib\\[desktop|silverlight]\\moq</strong> directory.</p>\r\n<p id=24fc3aa0-733b-012d-1737-1231390b9201>Please let me know if this helps.</p>\r\n<p id=24fc5ce0-733b-012d-1738-1231390b9201>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-07-16T21:32:32.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469123",
    "ThreadId": "214424",
    "Html": "<p>I want to add a few things to the above response. We are using Moq, but we are not yet using it everywhere.&nbsp; Lots of the existing unit tests still use hand-coded mocks and stubs.&nbsp; We will be converting unit tests to use Moq as we make changes to the code and tests, but in all probability, not everything will be converted.</p>\r\n<p>I hope that helps,</p>\r\n<p>Michael Puleio</p>",
    "PostedDate": "2010-07-19T10:43:00.933-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469221",
    "ThreadId": "214424",
    "Html": "<p>Thanks a lot that is a start.</p>\r\n<p>Not sure about the others but I also use the Practice and patterns project as a reference on how to do things. I was looking whether you used MOQ and learn how you handled and unit tested certain things.</p>",
    "PostedDate": "2010-07-19T13:42:19.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]