[
  {
    "Id": "452481",
    "ThreadId": "215203",
    "Html": "<p>Hi;</p>\r\n<p>As the new drop is out and I'm looking forward to this new version and I'm not knowledgeable on the Prism 2, my question is to learn prism 4, are there parts that are common or share with Prism 2 that we need to learn first or is Prism 4 a new start that we don't need to go and dig into Prism 2?</p>\r\n<p>Thank you in advance!</p>\r\n<p>..Ben</p>",
    "PostedDate": "2010-06-07T08:00:16.11-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "453133",
    "ThreadId": "215203",
    "Html": "<p>Hi Ben,</p>\r\n<p>Although the implementation for some features will change, and new  capabilities will be added in Prism v4, most of the concepts in the <a href=\"http://msdn.microsoft.com/en-us/library/dd458809.aspx\">Prism  documentation</a> will still be valid, as the main idea remains the same. That  is, Prism v4 will address mostly&nbsp;the same scenarios that Prism v2, the  development of flexible composite client applications (applications that are  composed of loosely coupled modular pieces that work together in the overall  application), as described in <a href=\"http://msdn.microsoft.com/en-us/library/ff648611.aspx\">this  article</a>.</p>\r\n<p>You can check <a href=\"http://blogs.msdn.com/b/simplifying_patterns_and_practices/archive/2010/03/15/prism-a-look-ahead.aspx\">this  blog post</a> by the <a href=\"http://blogs.msdn.com/b/simplifying_patterns_and_practices\">Patterns &amp;  Practices Client Team</a> to see the main features that will be introduced in  Prism v4.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br><a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2010-06-08T11:36:47.72-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "453647",
    "ThreadId": "215203",
    "Html": "Hi Guido;\r\n\r\nFrom reading your post, is it fair to say if we could use today's Prism 2 as a base of development, and then we can easily port it over to Prism 4? or do you suggest we start with Prism 4?\r\n\r\nNow that development has begun, is there a set date for Beta or RC?\r\nThanks!\r\n..Ben\r\n",
    "PostedDate": "2010-06-09T11:27:17.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "454488",
    "ThreadId": "215203",
    "Html": "<p>Hi Ben,</p>\r\n<p>As of today, the main difference that could impact your migration is the  inclusion of MEF. So the difficulty of that task might depend on whether you  want to adopt it or stay with Unity.</p>\r\n<p>However, there might be new features and changes as the development  continues, since it is iterational. The extent of your migration efforts will  depend mostly on how many of these new features from Prism v4 you are going to  include in your application. Perhaps you could find <a href=\"View.aspx?ThreadId=215293\">this  thread</a> useful.</p>\r\n<p>Another possibility, as you mentioned, is to start developing with Prism v4.  Take into account that Prism v4 is currently in alpha state, and if you chose to  do so, you would have to adapt your application as new drops appear.</p>\r\n<p>As for the dates, there won&rsquo;t be a Beta or RC. Instead, there will be  biweekly drops that will be released in Codeplex. You can download the first  drop <a href=\"../releases/view/46407\">here</a>.  Additionally, there is an estimated release date in the blog post I  mentioned.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br><a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2010-06-11T09:31:48.203-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]