[
  {
    "Id": "452707",
    "ThreadId": "215250",
    "Html": "<p>Hello everybody,</p>\r\n<p>I have just started a from-the-ground-up rewrite of my project, genesissmartclient.codeplex.com (The Genesis Smart Client Framework) using PRISM and Composite Application techniques.</p>\r\n<p>Currently I have a standard PRISM setup with a Shell, Infrastructure Library and one Module. This has been split over WPF and Silverlight using multi-target development aided by the PRISM Project Linker. I recommend anybody who is looking to learn the basic concepts of PRISM to go and download changeset 46607 of my project (<a href=\"http://genesissmartclient.codeplex.com/releases/view/46518\">http://genesissmartclient.codeplex.com/releases/view/46518</a>).</p>\r\n<p>As I have mentioned, I have just started a rewrite and I am basing alot (currently all) of the functionality of the modularization that I used to do myself on PRISM. This means that developers who are familiar with the Composite Application Library (PRISM) and Inversion of Control containers should have little trouble easing into the Smart Client arena. I know that PRISM almost acts like a Smart Client by having automatic module discovery and updating built in, but it still lacks a management implementation and some other features.</p>\r\n<p>I am going to be elaborating my project over the next month to include a full management system to maintain user security and access, module registration and delivery and some other things. You can also read my article on the basic requirements for a PRISM multi-target shell application here <a href=\"http://www.codeproject.com/KB/smart/GSCF2UXP1.aspx\">http://www.codeproject.com/KB/smart/GSCF2UXP1.aspx</a>.</p>\r\n<p>Alot of the application is based on the multi-target techniques that the Microsoft Patterns and Practices team have applied to the StockTraderRI application, in fact I have copied their Behaviors and some other base classes, and adapted some others. I have changed the mechanism used to display the Main View to disconnect it from the actual Shell application. The Shell application simply loads and executes the bootstrapper, which in turn loads and starts each module. I have adapted a module to contain the Main View so that I can reuse the Shell application to host any form design that I might envision.</p>\r\n<p>To explain what I mean: I sometimes want a User Interface that contains a Ribbon with a Docking control, and other times I want a simple menu/toolbar with a Tab control. By following PRISM coding recommendations I would have had to create two Shell applications containing each unique Main View. With my seperation of interest between the Shell and the actual Main View, I simply ship a different Module to the client.</p>\r\n<p>Please comment on any of the system components as I would love to improve them.</p>",
    "PostedDate": "2010-06-07T15:31:28.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "471786",
    "ThreadId": "215250",
    "Html": "<p>Hi,</p>\r\n<p>Based on our understating, you could use three techniques in that case depending on your specific scenario.&nbsp;If you have a different layouts, you&nbsp;might use&nbsp;multiple shells, each one with its specific layout. Another option to have different layouts is to have one shell containing one main region, and switch the view displayed on that region. While if the only difference in the UI is a view(Ribbon or Menu view), you could use <a href=\"http://msdn.microsoft.com/en-us/library/ff648265.aspx\">UI Composition</a> for displaying different views depending on some logic.</p>\r\n<p>For more information about Multiple Shells, you could take a look at the following links:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=216982\">Urgent help needed with Multiple Shell configurations in Prisim 4</a> </li>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=25938\">Multiple windows in a shell</a> </li>\r\n</ul>\r\n<p>For more information about using one shell containing one main region, you could check at the following links:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=67191\">Too many regions in my shell</a> </li>\r\n</ul>\r\n<p>Fore more information about <a href=\"http://msdn.microsoft.com/en-us/library/ff648265.aspx\">UI Composition</a>, you could take a look at the following links:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff649543.aspx\">View Discovery</a> </li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff647269.aspx\">View Injection</a> </li>\r\n</ul>\r\n<p>Please let me know if this helps.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-07-23T11:33:53.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]