[
  {
    "Id": "457582",
    "ThreadId": "216619",
    "Html": "<div>\r\n<p>Hi,</p>\r\n<p>I have a WPF application build with CAL guide (I'm not using Unity but I do have modules, service, shell).</p>\r\n<p>I would like to have the state of my application persist and restore so that changes the user made to the UI will persist. By state I mean windows position and size, grid column order and size, selected menus, open windows, etc.</p>\r\n<p>&nbsp;</p>\r\n<p>Sure there is an application specific part here since I can't expect a framework understand all of my application but there is sure room here for a general purpose framework or guide on how to go about this thing.</p>\r\n<p>For example, where to store the state while the application is not working. If I persist everything to a single file it may get very large and restoring state will be slow.</p>\r\n<p>Versioning - How to keep the data backward and forward compatible so if I remove a column from a grid the thing will not blow, also when I add new one it should get a&nbsp;reasonable&nbsp;default.</p>\r\n<p>Enterprise support - This go hand-in-hand with where to persist - for enterprise application I would like my state to be in any workstation I use, not just my local computer.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you,</p>\r\n<p>Ido</p>\r\n</div>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-06-19T08:42:19.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463965",
    "ThreadId": "216619",
    "Html": "<p id=79881170-6b69-012d-0888-123139097e01>Hi Ido,</p>\r\n<p id=79882ab0-6b69-012d-0889-123139097e01>This is something not supported in Prism out-of-the-box. However, I think that it is an interesting question, so you could post your requirement in the <a href=\"http://compositewpf.codeplex.com/workitem/list/basic\">issue tracker</a>, so it might be taking into account for future Prism releases.</p>\r\n<p id=79884d50-6b69-012d-088a-123139097e01>For implementing your custom persistence, you could subscribe to the application <strong>Application_StartUp</strong> and<strong> Application_Exit</strong> methods on the <strong>App.xaml.cs</strong> for persisting and restoring your app state. You can find the following related posts useful:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=65131\">Persisting shell settings and application shutdown</a></li>\r\n</ul>\r\n<p id=798879b0-6b69-012d-088b-123139097e01>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-07-06T14:43:54.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "463978",
    "ThreadId": "216619",
    "Html": "I've open an issue like you suggested.\r\n\r\n[workitem:6954]",
    "PostedDate": "2010-07-06T15:16:53.373-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]