[
  {
    "Id": "458497",
    "ThreadId": "216872",
    "Html": "<p>I am currently scoping out some future development and was curious if it is possible to assign the shell of another prism app to a region.</p>\r\n<p>We currently have one project that is good candidate for prism and would like to develop that in the short term.</p>\r\n<p>In the longer term we may wish to group all our different apps (some trivial some not) under a single prism application including the previous project that is already a prism project.</p>\r\n<p>Is it a matter of just treating the old prism app as a module and the shell as a view ? or will the two conflict with event aggregator and region manger instances ? Is it better to just extend the original prism app to&nbsp;accommodate&nbsp;the additional functionality ?</p>",
    "PostedDate": "2010-06-22T06:06:28.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "471783",
    "ThreadId": "216872",
    "Html": "<p id=88f00800-789a-012d-a0ca-12313b101101>Hi,</p>\r\n<p id=88f018f0-789a-012d-a0cb-12313b101101>I do not know the exact implementation of your shell views, but I think that this is something possible. Anyway, you would have to modify your code, as you supposed. However, it shouldn&rsquo;t be to hard, so you could perform the following high-level steps in order to achieve this scenario:</p>\r\n<ol>\r\n<li>Create a new Class Library project. This is why the Shell window is contained by a Windows Application project type. </li>\r\n<li>Add an class that implements IModule to this new project for initializing it as a module. </li>\r\n<li>Add the views (shell) to the new project. </li>\r\n<li>Change the Shell xaml code from window to user control. </li>\r\n<li>Migrate the logic&nbsp;in the old bootstraper to the new one.</li>\r\n</ol>\r\n<p id=88f02f60-789a-012d-a0cc-12313b101101>On the other hand, as another possibility, other users have multiple shell applications, so you could check for more information in the following links:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=216982\">Urgent help needed with Multiple Shell configurations in Prisim 4</a> </li>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=25938\">Multiple windows in a shell</a> </li>\r\n</ul>\r\n<p id=88f04f80-789a-012d-a0cd-12313b101101>Please let me know if this helps.</p>\r\n<p id=88f06c20-789a-012d-a0ce-12313b101101>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-07-23T11:27:28.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]