[
  {
    "Id": "459892",
    "ThreadId": "217307",
    "Html": "<p>Hi all.</p>\r\n<p>I know this topic has been discussed previously in this <a title=\"SL3 navigation framework and prism\" href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=57291\">post , </a>where the nav framework is implemented with various techniques usually involving a seperate Content PlaceHolder to accomodate the navigation framework specifics.</p>\r\n<p>Since that post Silverlight 4 has arrived and in regards to the Navigation Framework it has got an extensiblility point for adding a custom ContentLoader in the navigation Frame.<br>As far as I've understood, MEF is making use of this with the mef Xap loader.</p>\r\n<p>What I'm hoping to get some feedback on is what you guys would recommend for implementing when you have a Prism application (with Unity as DI container) with many dynamically loaded modules and also need to supply a external url for accessing the different Views in the application?</p>\r\n<p>Is it recommended to add a custom contentloaded to the existing application, or would it be better to transition over to use the MEF approach to this?</p>\r\n<p>I know some of these questions will be answered by the implementation of Prism 4.0, but would appreciate some feedback before the second phase of the prism 4.0.</p>\r\n<p>Thanks,<br>-Per-</p>",
    "PostedDate": "2010-06-25T04:10:49.393-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "501257",
    "ThreadId": "217307",
    "Html": "<p>Hi Per,</p>\r\n<p>I think that you can find interesting that there are new drops of Prism  v4&nbsp;that contain&nbsp;Quickstarts, documentation, etc&nbsp;in terms of navigation.&nbsp;You can  download them from <a href=\"../releases/view/52647\">here</a>.</p>\r\n<p>On the other hand, in <a href=\"View.aspx?ThreadId=225423\">this  other forum thread</a> the community has been discussing&nbsp;the navigation&nbsp;topic.&nbsp;  Additionally, you can find links to the Navigation documentation over there.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-01T13:48:11.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]