[
  {
    "Id": "461688",
    "ThreadId": "217865",
    "Html": "<p>Hi</p>\r\n<p>I am naive to Prism ( WPF as well as Silverlight) but right now working with CAB . I need expert advice on following points.</p>\r\n<p>1) We are exploring the possiblity to move existing CAB application in to web application. Right now&nbsp;i am under impression that using&nbsp;the&nbsp;prism 2.1&nbsp;( i.e migration from CAB to Prism ) I can achive the goal to migration windows application in to web application.But after doning the&nbsp;excersie provided in MSDN i found that&nbsp;there is no way to delopy the application in to web server ( i.e access over http).My question is that can&nbsp;it be possible to develop the WPF based browser application using Prism ? if yes then which section&nbsp;I have to look at MSDN.</p>\r\n<p>2) Is&nbsp;it possible to&nbsp;develop the&nbsp;WPF based browser application using the Web Client application block ?</p>\r\n<p>Sorry if some points mentioned above are invalid in terms of new technology like WPF and silver light.</p>\r\n<p>Thanks in advance for answer.</p>",
    "PostedDate": "2010-06-30T08:02:00.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "480374",
    "ThreadId": "217865",
    "Html": "<p id=0f7a86f0-8943-012d-e51f-1231390bad71>Hi,</p>\r\n<p id=0f7aa180-8943-012d-e520-1231390bad71>Nice to see that you are evaluating to use Prism. First of all, I think you could find it useful that Prism is a guidance, which supports&nbsp;to create&nbsp;Silverlight applications.</p>\r\n<p id=0f7ac100-8943-012d-e521-1231390bad71>That said, if you need to create a web based application, you might prefer to choose a Silverlight application, which will be able to deploy in a web server, so that&nbsp;you could access&nbsp;it over http. For more information on this topic you could take a look at the following links:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921170(PandP.20).aspx\">Deploying Silverlight Applications</a> </li>\r\n</ul>\r\n<p id=0f7ae730-8943-012d-e522-1231390bad71>As for your second question, Web Client Software Factory does not allow you to create WPF views like SCSF.</p>\r\n<p id=0f7b1530-8943-012d-e523-1231390bad71>Additionally, if you are about to start creating a new Prism application, please take into account that the product team was released <a href=\"http://compositewpf.codeplex.com/releases/view/49963\">Prism v4 CTP</a> on August 2nd.&nbsp;</p>\r\n<p id=0f7b4270-8943-012d-e524-1231390bad71>Please let me know if this helps.</p>\r\n<p id=0f7b7040-8943-012d-e525-1231390bad71>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-08-13T13:21:35.413-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]