[
  {
    "Id": "465421",
    "ThreadId": "218923",
    "Html": "<p>Hey all.</p>\r\n<p>I'm getting ready to choose/evaluate various frameworks/approaches for a corporate application (hence the need to stay in 3.5) and it looks like PRISM would be a good fit. Let me give a quick overview of the application. It would use a standard shell, have a navigation page, an &quot;Assistance&quot; page and then a main content window where users are essentially filling out a survey.</p>\r\n<p>The survey itself is configurable so there would be &quot;Manager&quot; objects that contain the details on each one. A single page would contain multiple query modules that might interact, depending on the choices made. &nbsp;When a user moves to a new page, an Public Event would fire that would save the data and also send notifications to the Nav and Assistance pages as needed.</p>\r\n<p>All actual updating is managed by these Manager objects which would likely reside in the main Shell, although it sounds like it could be called manually within each module.&nbsp;</p>\r\n<p>Based on the above and what I've been reading, PRISM sounds ideally suited for this. Does anyone foresee any gotchas based on the above description?</p>\r\n<p>Thanks</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-07-09T07:33:05.323-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468426",
    "ThreadId": "218923",
    "Html": "<p id=967497b0-7290-012d-6683-12313b023041>Hi,</p>\r\n<p id=9674ae30-7290-012d-6684-12313b023041>Nice to hear that you could start using Prism. As for your requirements/specs, Prism could help you in a lot of ways.</p>\r\n<p id=9674c7d0-7290-012d-6685-12313b023041>On the other hand, it seems that you performed a complete analysis on this, so from my side I want share with you some main assets in Prism that might help you:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff648404.aspx\">Modularity</a> in Prism gives you the guidance for creating Composite Applications.&nbsp;&nbsp; </li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff647269.aspx\">View Injection</a>/<a href=\"http://msdn.microsoft.com/en-us/library/ff649543.aspx\">View Discovery</a> is good alternative for managing views by using regions. For more information you could check <a href=\"http://msdn.microsoft.com/en-us/library/ff650182.aspx\">UI Composition</a>.</li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff649187.aspx\">Event Aggregation</a> could help you with the communication since you mentioned notification between modules.</li>\r\n</ul>\r\n<p id=9674e6a0-7290-012d-6686-12313b023041>Additionally, the <a href=\"http://msdn.microsoft.com/en-us/library/ff649318.aspx\">Quickstarts</a> and the <a href=\"http://msdn.microsoft.com/en-us/library/ff647434.aspx\">Reference Implementation</a> are your friends.</p>\r\n<p id=96751b40-7290-012d-6687-12313b023041>Please let me know if this helps.</p>\r\n<p id=96754790-7290-012d-6688-12313b023041>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-07-16T21:25:17.077-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468473",
    "ThreadId": "218923",
    "Html": "<blockquote style=\"border:solid .1em #ccc;font-style:italic;margin:.25em 1em 0 1em;padding:0 .25em 0 .25em\"><strong>fantivero wrote:</strong> you could check <a href=\"http://msdn.microsoft.com/en-us/library/ff650182.aspx\">UI Composition</a>.\r\n<p id=9674e6a0-7290-012d-6686-12313b023041>Additionally, the <a href=\"http://msdn.microsoft.com/en-us/library/ff649318.aspx\">Quickstarts</a> and the <a href=\"http://msdn.microsoft.com/en-us/library/ff647434.aspx\">Reference Implementation</a> are your friends.</p>\r\n</blockquote>\r\n<p>The reference implementation is not particularly friendly for anyone starting out and I'm not even sure it's friendly for a person with a lot of experience. As examples go I have found it to be far to big and complicated. Why not just break it up into some small applications. Is there a need to demonstrate so much complexity in the one application? I've a feeling the RI is one of those applications where the only person that really understands it all is the guy that wrote it.</p>\r\n<p>Quickstarts are my friends. Small, to the point and easy to follow.</p>",
    "PostedDate": "2010-07-17T03:37:09.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "468475",
    "ThreadId": "218923",
    "Html": "<p>Thanks for the thoughts Fernando and Richard. While I like the reference implementation for a full concept, I agree it would be nice to have individual ideas.</p>\r\n<p>In my application, I'm going to have to pull apart the RI for samples with Menus and toolbars and the like.</p>\r\n<p>One of the key concepts in this application will be multi-lingual support. My thought right now is to trigger an event at the highest level and then have it tunnel down to every possible component that supports it.</p>\r\n<p>Does that sound like it will work? Or am I possibly missing a better solution?</p>\r\n<p>Andrew</p>",
    "PostedDate": "2010-07-17T04:14:27.36-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "469017",
    "ThreadId": "218923",
    "Html": "I was able to find some useful sample templates over on CodeProject for menus and the like.\r\n\r\nHopefully they will fit in nicely.",
    "PostedDate": "2010-07-19T06:58:15.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]