[
  {
    "Id": "473734",
    "ThreadId": "221711",
    "Html": "<p>Hi!</p>\r\n<p>I want to put a customized menu control in the shell that populates at runtime from database. Each menu item fires an event and in response loads the view. Let us suppose we are creating nested menu that has n no of sub menus. So far that purpose I can't use module for each menu. What will be the easiest and simplest way to achieve this with low maintenance cost.</p>\r\n<p>&nbsp;</p>\r\n<p>Regards,</p>\r\n<p>&nbsp;</p>\r\n<p>Kausar Mehmood</p>\r\n<p>khan.kausar@gmail.com</p>",
    "PostedDate": "2010-07-28T08:19:10.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "474915",
    "ThreadId": "221711",
    "Html": "<p id=b7890c20-7d88-012d-814d-123139180385>Hi Kausar Mehmood,</p>\r\n<p id=b7892090-7d88-012d-814e-123139180385>Based on our understanding, Prism might help you with the following design concept(s):</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff650182.aspx\">UI Composition</a>, could help in this scenario for composing user interfaces in loosely coupled way. </li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff648404.aspx\">Modularity</a>, is really important if you have the requirement to divide an application into a set of decouple functional units. </li>\r\n</ul>\r\n<p id=b7893660-7d88-012d-814f-123139180385>First of all, I think you could start defining the layout of your application by designing what <a href=\"http://msdn.microsoft.com/en-us/library/ff647910.aspx\">regions</a> it might include. This way, you would be able to know where the nested menu will be displayed as well as the views.</p>\r\n<p id=b7895da0-7d88-012d-8150-123139180385>In my opinion, the <strong>menu view</strong> could be part of the same project where the Shell window is (Shell module project).</p>\r\n<p id=b7898110-7d88-012d-8151-123139180385>As for the views that would be displayed based on the user gestures, I think you have the following options:</p>\r\n<ol>\r\n<li>The Shell module could also include the views. </li>\r\n<li>Add a new module that could include all the views that can be displayed. </li>\r\n<li>Create a module for each functional unit in you application, and include the views to its rightful module. </li>\r\n</ol>\r\n<p id=b789a5a0-7d88-012d-8152-123139180385>If you plan to include all your UIs (menu + views) in the Shell module project, you could use <a href=\"http://msdn.microsoft.com/en-us/library/17sde2xt.aspx\">.Net events</a> to notify to a controller for displaying its view.&nbsp; <br>However, if you decided to build a more decoupled application, and it contains more than one module that might be communicated between them, the recommended approach in Prism is the usage of <a href=\"http://msdn.microsoft.com/en-us/library/ff649187.aspx\">Event Aggregator</a>. Additionally, you could check the <a href=\"http://msdn.microsoft.com/en-us/library/ff647735.aspx\">Communication</a> section that exposes all the different approaches in Prism on this subject.&nbsp;</p>\r\n<p id=b789e380-7d88-012d-8153-123139180385>Regarding to how to display a view into a region, you could take a look at the following documentation sections:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff649543.aspx\">How to: Show a View in a Region Using View Discovery UI Composition</a> </li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff647269.aspx\">How to: Show a View in a Region Using View Injection UI Composition</a> </li>\r\n</ul>\r\n<p id=b78a2030-7d88-012d-8154-123139180385><strong>Conclusion: </strong>ideally all the views&nbsp;should not be included in the Shell module, so it is highly coupled and in the future you could be <span><span>compromise </span></span>in terms of scalability. That said, I would recommend an scenario where there is different modules, even more if this application could response showing/hiding functionality based on a database.</p>\r\n<p id=b78a6880-7d88-012d-8155-123139180385>Please let me know if this helps.</p>\r\n<p id=b78aadb0-7d88-012d-8156-123139180385>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-07-30T14:50:08.47-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]