[
  {
    "Id": "475934",
    "ThreadId": "222312",
    "Html": "<p>I havent looked in the latest drop yet, so please excuse me if it is there, but are you guys planning on adding a Region Mgr for the new Ribbon Control?</p>\r\n<p>It just hit CTW, and would be nice to have one &quot;out of the box&quot;.</p>\r\n<p>Thanks</p>\r\n<p>pmont</p>",
    "PostedDate": "2010-08-03T06:26:33.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "476066",
    "ThreadId": "222312",
    "Html": "<p>There are a number of region adapters on the list to create once we get a few other hotspot areas locked down.&nbsp; At this point, the adapters are high enough on the priority list that they should make it in, but that is not a guarantee.&nbsp;</p>\r\n<p>Thanks for the feedback,<br>Michael Puleio</p>",
    "PostedDate": "2010-08-03T11:30:32.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "476067",
    "ThreadId": "222312",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7063\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-08-03T11:33:56.58-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "476382",
    "ThreadId": "222312",
    "Html": "<p>Thank you.</p>\r\n<p>So that we dont ask for something that is already planned,&nbsp;can you&nbsp;pubilsh the list of adapters that you guys are considering?&nbsp; Or is it already visible somewhere?</p>\r\n<p>Paul</p>",
    "PostedDate": "2010-08-04T04:45:57.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "476474",
    "ThreadId": "222312",
    "Html": "<p>The backlog item we have at this point is something like &quot;Create region adapters for new controls&quot;, rather than each specific one at this point.&nbsp; When we get closer to doing the work, we will get more details.&nbsp; However, it would probably be better for you to ask for everything you want (and get people to vote on the items) to help us prioritize the work and make sure we don't leave anything off the list..</p>\r\n<p>Thanks,<br>Michael Puleio</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-04T08:08:56.57-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]