[
  {
    "Id": "482717",
    "ThreadId": "224238",
    "Html": "<p>Is there a specific thread to raise issues around the documentation?&nbsp;</p>\r\n<p>Installing/finding information in PRISM v2 was a nightmare, partially solved by the folks at Sparkling Client posting a much cleaner set of instructions to help folk track down the appropriate bits. My initial perceptions are that for v4 things have got worse instead of better, with instructions (often incomplete) spread across the main .chm file, the documentation and discussion threads on CodePlex and various readme files scattered liberally throughout the folder installation. Life's too short for most developers to spend on this and they'll soon go elsewhere without clear, concise guidance that ties up with the real install experience.</p>\r\n<p>For example: the PRISM help file (&quot;Chapter 1: Introduction (updated)&quot; tells me that if I build the solution the dlls will be found in PrismLibrary\\Silverlight\\Prism.UnityExtensions\\bin\\debug&nbsp; This is not true and contradicts the information given on the Codeplex page for the Drop 6 download.</p>\r\n<p>Instructions like &quot;add the unit testing framework dlls&quot; are meaningless if you don't tell us what the dlls are as there is nothing I can see on the Toolkit site which identifies which dlls pertain to SLUT and which pertain to all the other stuff that ships with it.&nbsp; The specifically required dlls&nbsp;should be named, as they have been for the Moq folder. If you guys don't know them, who does?! It just adds to wasted time and frustration trying to find out. (By the way, the user should also be warned that if they want the solution to build they need to copy the Moq dlls to both the Silverlight folder&nbsp;AND the Desktop folder)</p>\r\n<p>On a separate note, the&nbsp;information as to the release status of Prism v4 is extremely confusing. On 2nd August we were a &quot;beta&quot; but on the 18th August we're an &quot;alpha&quot;. Did things really go backwards?</p>\r\n<p>Issues like the above may seem trivial but it's obvious a lot of hard work has gone into PRISM. However most developers I speak to regard it as &quot;too complex, too over-engineered and too difficult to master in the timescales we have&quot; (that's the polite version!).&nbsp; Time wasted&nbsp;on getting the basic installation&nbsp;to build&nbsp;only helps confirm the negative&nbsp;rumours around &quot;Pattern and Practices CAB&quot;.&nbsp; In all honesty, returning to PRISM in its v4 incarnation (at insistence of client) after having used PRISM v2 and then MVVM Light my initial reaction is &quot;They've learnt nothing from the nightmare that was v2 installation, and in fact appear to have got worse&quot;.&nbsp; If you want real take-up of PRISM you really need to fix this.</p>\r\n<p>Ian</p>",
    "PostedDate": "2010-08-20T05:09:19.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482874",
    "ThreadId": "224238",
    "Html": "<p>Hi Ian,</p>\r\n<p>Thanks for your feedback. This is the correct place&nbsp;to post your feedback, as the team is constantly sweeping the forums.</p>\r\n<p>One of the things that we try to focus on is consistency, but as code evolves faster than docs, the documentation will often have some outdated pieces. We can assure that you&nbsp;will find the latest and more accurate information&nbsp;on the codeplex page and&nbsp;the readme.txt file of&nbsp;every drop.</p>\r\n<p>Regarding the status of the drops, the August 2nd was a CTP drop, therefore the content of it was consider to be stable (beta version). The following drop included, apart from the stable assets, new work-in-progress assets that are probably going to change, that's why that release has the alpha status.</p>\r\n<p>We are going to tackle your feedback and hope that you continue to help us in improving Prism.</p>\r\n<p>Diego</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-20T10:03:55.383-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482888",
    "ThreadId": "224238",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7141\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-08-20T10:37:28.83-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]