[
  {
    "Id": "482794",
    "ThreadId": "224259",
    "Html": "<p>The document of Prism 4 mentioned using the open source tool <a href=\"http://compositewpf.codeplex.com/releases/view/14771\">ManifestManagerUtility for ClickOnce </a>to deploy WPF apps. It is really helpful. However the tool appears having some issues:</p>\r\n<p>1) The GlobalAssemblyInfo.cs file is missing from the zip file so the project can&rsquo;t be build; any solution or fix?</p>\r\n<p>2) The latest release is in 2008; any upcoming release for .NET 4?</p>\r\n<p>3) The sample code Prism 4 document mentioned is missing (Quickstarts\\Modularity\\ConfigurationModularity QuickStart solution); I assume the team is still working on it.</p>\r\n<p>TIA.</p>",
    "PostedDate": "2010-08-20T07:25:26.283-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482842",
    "ThreadId": "224259",
    "Html": "<p>Hi TIA,</p>\r\n<p>In Prism v4&nbsp;the ClickOnce documentation section as well as others have not been updated yet.&nbsp;However, the product team has plans on updating this on the final release of Prism. On the other hand, the tool you mentioned could be out of date for .Net 4&nbsp;and don&rsquo;t know if there is any official plan to get this updated.</p>\r\n<p>As for the GlobalAssemblyInfo.cs, as a workaround, you could comment this element out, so it allows to build this project.</p>\r\n<p>I will copy this to a work item, so&nbsp;it allows you and the community to vote this.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-08-20T08:58:11.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "482843",
    "ThreadId": "224259",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7140\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-08-20T08:58:25.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489098",
    "ThreadId": "224259",
    "Html": "<p>FYI - we have just updated this tool so it works fine with .NET 4.0&nbsp;this week and should be releasing it soon via the downloads section here on the codeplex site.</p>",
    "PostedDate": "2010-09-03T15:46:03.447-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]