[
  {
    "Id": "483427",
    "ThreadId": "224454",
    "Html": "<p>Hi, can anyone point me to a link where I will be able to download a sample applicatin using PRISM 4, WCF RIA service without Entity Framework and MEF for MVVM. I am baiscally looking for a sample everything above is hooked into one single application rather than separate application.</p>\r\n<p>As a part of qucikstarts, if this cant come under the Quickstarts then in Advanced section I would like to see sample either from PRISM team or WCF RIA team.</p>\r\n<p>I also want to leverage the Boolean expression based authorization configuration ( as in Ent Lib 5) to restrict the access at the client side silverlight application using claims or principal. If some one can point me to a sample for doing this would be great help.</p>\r\n<p>Thanks,</p>\r\n<p>Milind</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-22T23:09:25.92-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "485342",
    "ThreadId": "224454",
    "Html": "<p id=39de82d0-9109-012d-3452-12313b100c31>Hi Milind,</p>\r\n<p>There is not such a Quickstart or Reference implementation in Prism v4 out-of-the-box that fulfill all your requirements so far. Based on our understating you need a sample application using Prism v4, with a different IoC than MEF, MVVM pattern implemented and WCF RIA services. Almost all your requirements are covered in the following separated applications:</p>\r\n<ul>\r\n<li>MVVM: <strong>&lt;PrismInstallationDir&gt;</strong>\\MVVM RI; <strong>&lt;PrismInstallationDir&gt;</strong>\\Quickstarts\\BasicMVVM; <strong>&lt;PrismInstallationDir&gt;</strong>\\Quickstarts\\MVVM </li>\r\n<li>Unity as IoC: <strong>&lt;PrismInstallationDir&gt;</strong>\\Quickstarts\\Modularity\\Desktop\\ModularityWithUnity </li>\r\n<li>There is not a sample that uses WCF RIA Services but the following one uses a similar approach: <strong>&lt;PrismInstallationDir&gt;</strong>\\MVVM RI. This application make use of a custom implementation to write application logic in the mid-tier similar to WCF RIA services. For more information see the DomainObject and DomainObjects classes. </li>\r\n</ul>\r\n<p>As for how to leverage EntLib to use other models (claims, roles, etc) in order to make your security assertions, you could take a look at the following documentation section on MSDN:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff664544(PandP.50).aspx\">Extending and Modifying the Security Application Block</a> </li>\r\n</ul>\r\n<p>Please let me know if this helps.</p>\r\n<p id=39deabb0-9109-012d-3454-12313b100c31>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-08-26T12:07:19.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489946",
    "ThreadId": "224454",
    "Html": "<p>Thanks for the reply, I have gone through all these apps, I wanted to see a single running application using all the ingredients in the PRISM 4.0 demonstrating following</p>\r\n<p>1. Modularity with MEF</p>\r\n<p>2. Commanding using DelegateCommand and navigation</p>\r\n<p>3. Messaging with EventAggregation</p>\r\n<p>4. MVVM implmentation using MEF</p>\r\n<p>5. Validation and Exceptionhandling using WCF RIA services (optional)</p>\r\n<p>&nbsp;</p>\r\n<p>If you come across any sample app like using all of the above then request you to please redirect me to it. Besides this is there any plumbing or mechanism avaialbe from within the PRISM block to refresh application wide settings as and when we change those in the &lt;appsettings&gt; section in the web.config file on the server. I don't know duplex service will work here</p>",
    "PostedDate": "2010-09-07T00:25:15.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]