[
  {
    "Id": "484510",
    "ThreadId": "224742",
    "Html": "<p>Hi,</p>\r\n<p>I have noticed that in the latest drop 6 that all the MVVM examples uses silverlight and not wpf. And all the majority of old examples&nbsp; still uses the presenter.</p>\r\n<p>Wondering if there were any plans to have some MVVM examples in WPF Desktop?</p>\r\n<p>Being a &quot;Beginner&quot; in prism and for any other beginners out there its much easier to see also a wpf desktop example.</p>\r\n<p>Sorry where I work we dont use silverlight at all.Is the direction in future to use silverlight rather than wpf desktop?</p>\r\n<p>I am really pleased that you started to use Moq in your Unit testing.</p>\r\n<p>I have also noticed that the documentation is quite good.</p>\r\n<p>Thanks for any replies</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-24T23:53:49.673-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484798",
    "ThreadId": "224742",
    "Html": "<p>Thanks for the feedback.&nbsp; I have a few comments and hopefully an answer to the request for a WPF MVVM RI.</p>\r\n<p>Working on this version of Prism, we have intentionally implemented the MVVM samples in Silverlight first, as it is usually easier to port from Silverlight to WPF.&nbsp;&nbsp;We also determined it would be harder to do MVVM &quot;properly&quot; in SIlverlight than in WPF due to the constraints of Silverlight, so we wanted to show it there first to work around the pain points.</p>\r\n<p>One of our goals with Prism is to support both Silverlight and WPF, but we may not show everything on both platforms.&nbsp; We are planning on re-writing the Stock Trader RI using MVVM, MEF, our Navigation guidance and showing both WPF and Silverlight implementations, so there should be something showing MVVM in WPF by the time we ship.&nbsp; In the meantime, the principles and the concepts behind the implementation should be baked at this point, so it should be possible to learn how to do a WPF implementation from the Silverlight samples.&nbsp; There are a few things in WPF (like automatic data template selection) that should make&nbsp;the implementation&nbsp;simpler.</p>\r\n<p>As far as using Moq goes, we like using it, but not all the unit tests will be re-done to use Moq.&nbsp; We are using it on new code and changing fixtures selectively, since (believe it or not) we have a limited team and limited time. ;-)</p>\r\n<p>Thanks for the comment about the documentation. We spend quite a bit of effort trying to make it useful and readable.&nbsp; If you see any big gaps or challenges, let us know.&nbsp; If there are things that are difficult to get up to speed on, we really want to know.&nbsp;(We do know about the formatting issues in the code snippets and are working on ensuring that non-breaking spaces do not get in the docs again).</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-08-25T11:57:14.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "484984",
    "ThreadId": "224742",
    "Html": "<p>Thanks for your reply.</p>\r\n<p>I understand about having a limited team etc.. Sometimes because its Microsoft we tend to forget all that and assume that you have no budget :)</p>\r\n<p>Thanks again for your reply and again really like your documentation.</p>",
    "PostedDate": "2010-08-26T00:03:19.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]