[
  {
    "Id": "486876",
    "ThreadId": "225425",
    "Html": "<p>I think the terminology used in the current code samples and documentation is confusing. Most of the diagrams and text seem to describe the term module in terms of a deployable unit of code.&nbsp; The main introductory&nbsp;chapter&nbsp;pretty much defines&nbsp;a module as comprising multiple components such as Views, ViewModels, Controllers and Services.&nbsp;</p>\r\n<p>However the source code tends to then define the module Controller as a class called &quot;Module&quot; and the interface such a controller implements is called IModule. This has lead to much confusion on the team I'm currently working on when discusssion around &quot;modules&quot; is assumed to be about the controller by those who haven't read the documentation and just looked at the code. I suspect&nbsp;the differences in use of the term &quot;module&quot; will&nbsp;lead to similar confusion with others. Wouldn't it be better to call the interface IModuleController&nbsp;rather than IModule, and to rename the concrete implementations of these classes provided as source to more accurately reflect the fact that they're controllers rather than modules?&nbsp; There's enough confusion around modules vs services already without adding to the confusion by calling controllers &quot;modules&quot;!&nbsp;</p>",
    "PostedDate": "2010-08-31T05:15:11.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487173",
    "ThreadId": "225425",
    "Html": "<p id=d820ca70-9735-012d-abe8-12313b10155a>Hi,</p>\r\n<p>Thanks for your feedback since this is valuable for the prism product team. I will copy this as a work-item, so the community could vote this and the team could consider this in the scope of future drops.</p>\r\n<p>Please let me know if this helps.</p>\r\n<p id=d820f810-9735-012d-abea-12313b10155a>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-08-31T12:59:55.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "487174",
    "ThreadId": "225425",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7194\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-08-31T13:01:00.563-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]