[
  {
    "Id": "486842",
    "ThreadId": "225415",
    "Html": "<p>Hi,</p>\r\n<p>I've looked through a few threads and found the RI RegionPopupBehaviour for opening dialog windows but the solution just seems very convoluted. All I want is a have my module create a modal dialog with a view in it. Is the only option really to use the 4/5 classes required for RegionPopupBehaviour for such a simple concept? Could I just have a &quot;CreateDialog&quot; event that the shell subscribes to which dynamically creates a Window, adds a named region from the event parameters and then have the module register a view to that region?</p>\r\n<p>Regards,</p>\r\n<p>Neil Alderson</p>",
    "PostedDate": "2010-08-31T03:45:09.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489037",
    "ThreadId": "225415",
    "Html": "<p>Hi Neil,</p>\r\n<p>I do not know your exact scenario, but your approach seems to be possible.  Take into account that Prism meant to be guidance, and not something strict,  which you can not update.</p>\r\n<p>Anyway, consider that the approaches that you will find in the Reference  Implementations and Quickstarts are commonly the recommended by the product  team.&nbsp;&nbsp;</p>\r\n<p>Additionally, you could take a look at <a href=\"http://compositewpf.codeplex.com/releases/view/50749\">the latest drop of  Prism</a> in the Navigation Quickstart, since it uses a more simpler approach  though it does not use regions.</p>\r\n<p>For more information on this topic, you could take a look the following  article in the CHM:</p>\r\n<ul>\r\n<li>MVVM Advanced Scenarios (new), see the <em>Interaction Requests </em>section.</li>\r\n</ul>\r\n<p>Please let me know if this helps.</p>\r\n<p id=70686f70-9735-012d-5bf7-12313b10155a>Fernando Antivero&nbsp;<br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-03T13:03:26.357-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "489089",
    "ThreadId": "225415",
    "Html": "<p>the behavior that is coded into this example is primarily geared towards silverlight development since &quot;ChildWindow&quot; is a silverlight control from what I have found in documentation unless you know of another way to do this.&nbsp; Considering I love this idea of childwindows, but I fail to understand why just about ever example that has come out over the last 6 drops have pretty much all been in Silverlight.</p>\r\n<p>While I appreciate the examples and I will be cross developing soon for silverlight for windows phone, I am primarily a wpf developer so, I feel like prism is being geared more towards silverlight with these examples.</p>",
    "PostedDate": "2010-09-03T15:11:23.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]