[
  {
    "Id": "490674",
    "ThreadId": "226468",
    "Html": "<p><span style=\"color:black;font-size:10pt\" lang=EN-US>Hello to the prism Team.</span></p>\r\n<p><span style=\"color:black;font-size:10pt\" lang=EN-US>I would like to ask whether you consider the possibility of creating a region manager implementation using MEF as well as some base classes for Export/Import attributes and metadata. I believe that this would make possible that views could register regions in a strongly typed manner and thus facilitate the extensibility. I have developed a codebase for delivering RIA applications through Silverlight and it is heavily based upon Prism. I could be looking in the wrong direction but it seems that MEF by its own needs heavy glue code to be written, the kind of code that Prism provides.</span></p>\r\n<p><span style=\"color:black;font-size:10pt\" lang=EN-US>What are your thoughts towards this direction?</span></p>\r\n<p><span style=\"color:black;font-size:10pt\" lang=EN-US>Best regards,</span></p>\r\n<p><span style=\"color:black;font-size:10pt\" lang=EN-US>Constantinos</span></p>",
    "PostedDate": "2010-09-08T07:16:01.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "490790",
    "ThreadId": "226468",
    "Html": "<p>Hi Constantinos,</p>\r\n<p>Thanks for your feedback, since it is really valuable. I will copy the thread  as a work-item, so the all the prism product team is notified as well as the  community could vote this.</p>\r\n<p>Take into account that&nbsp;Prism is agnostic of any technology and extensible,&nbsp;so  it&nbsp;is something&nbsp;possible to achieve&nbsp;either by the product team as well users.&nbsp;As  for the implementation of the region manager using MEF, it could be possible  by&nbsp;implementing IRegionManager and updating the bootstrapper to use&nbsp;that custom  implementation.&nbsp;</p>\r\n<p>On the other hand, MEF support have been already developed for modularity in  Prism 4, thus you will find IModuleLoader implementation for MEF, custom  attributes, etc. But UI-Composition&nbsp;and communication&nbsp;with MEF have not been  tackled yet.</p>\r\n<p>Thanks again for your feedback.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-08T10:31:37.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "490791",
    "ThreadId": "226468",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7232\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-09-08T10:32:44.537-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "490818",
    "ThreadId": "226468",
    "Html": "<p>Hi Fernando</p>\r\n<p>thanks for the quick reply. I am already considering the option of implementing the IRegionMager interface as there is more than enough reference inside prism. The only thing that stops me from doing that is the upcomming release of prism v4.0. That is because I made a few twicks and tricks in the past and incorporated features that later on were available in a official release (like the NotifyingModuleLoader and the recent Notification and User Interactions).</p>\r\n<p>So&nbsp;I will whait and see what will the new goodies be first.</p>\r\n<p>Again,</p>\r\n<p>good work!</p>",
    "PostedDate": "2010-09-08T11:07:16.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "503007",
    "ThreadId": "226468",
    "Html": "<p>Hi Constantinos,</p>\r\n<p>I think that you can find interesting that in <a href=\"../releases/view/53420\">the latest drop (9)  of Prism</a> the Stock Trader RI&nbsp;has converted&nbsp;to&nbsp;MEF and MVVM. In this&nbsp;RI,  modules are intentionally left empty because views, services and other types are  discovered through declarative attributes. For example:</p>\r\n<p><strong>[ViewExport(RegionName = RegionNames.ResearchRegion)]</strong></p>\r\n<p>For more information you could download <a href=\"../releases/view/53420\">the latest  drop</a>&nbsp;and take a look at&nbsp;the following documentation section in&nbsp;the  Prism4.chm:&nbsp;&nbsp;</p>\r\n<ul>\r\n<li><span id=nsrTitle>Stock Trader Reference Implementation (updated)</span> </li>\r\n</ul>\r\n<p>Additionally, you could check the RI: <strong>StockTrader  RI\\StockTraderRI.sln</strong></p>\r\n<p>Hope this helps.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-10-06T07:50:08.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]