[
  {
    "Id": "490931",
    "ThreadId": "226532",
    "Html": "<p>Are ya'll going to be doing any WPF examples cause starting to get the impression that there isn't a drive towards WPF as much as you have pushed for Silverlight development.&nbsp; Some of the MVVM practices you are starting to code into Prism is targeted directly at Silverlight, prime example is &quot;ChildWindow&quot;,&nbsp; I can't use that code example since the childwindow control doesn't exist in WPF, it strictly Silverlight.&nbsp; Starting to concern me since I am primarily a WPF developer at present haven't made the jump into RIA development yet.</p>",
    "PostedDate": "2010-09-08T14:50:51.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "491049",
    "ThreadId": "226532",
    "Html": "<p>Do you know I thought exactly the same thing.</p>\r\n<p>I think they are really pushing silverlight now.I hope we are wrong as I am putting so much effort into wpf</p>",
    "PostedDate": "2010-09-08T22:15:30.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "491054",
    "ThreadId": "226532",
    "Html": "<p>least I am not the only one thinking this...</p>",
    "PostedDate": "2010-09-08T22:40:07.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "491350",
    "ThreadId": "226532",
    "Html": "<p>Hi,</p>\r\n<p>Thanks for your feedback.&nbsp;I will copy this as a work-item, so&nbsp;all the&nbsp;prism team will be notified about this.&nbsp;In addition, other users with the same interests could vote this.</p>\r\n<p>First of all, take into account that there&nbsp;are not intentions&nbsp;in&nbsp;providing less WPF&nbsp;than Silverlight support&nbsp;in Prism v4. Even more,&nbsp;in Prism&nbsp;one of the main design concepts&nbsp;is Multi-Targeting which&nbsp;is meant to provide guidance for the both&nbsp;platforms using the same code-base. For more information about this, you could take a look at the following documentation section on MSDN:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921109(PandP.20).aspx\">Multi-Targeting</a></li>\r\n</ul>\r\n<p>Regarding to the ChildWindow, in some quickstarts there are some assets that are specifically created for Silverlight, but those&nbsp;should not be much complex to migrate to WPF.</p>\r\n<p>On other words, you could find&nbsp;some things&nbsp;in the drops as you mentioned, since&nbsp;prism team&nbsp;could design some components for Silverlight. This is because,&nbsp;Silverlight codebase is&nbsp;subset of&nbsp; WPF&rsquo;s one.&nbsp;But this does not mean that&nbsp;the guidance will be more focused on Silverlight than&nbsp;in WPF, in&nbsp;the&nbsp;final release.</p>\r\n<p>Thanks again for your feedback, since it&nbsp;is really valuable.</p>\r\n<p>Please let me know if this helps.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-09T10:17:55.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "491352",
    "ThreadId": "226532",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7235\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-09-09T10:21:31.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]