[
  {
    "Id": "492439",
    "ThreadId": "226921",
    "Html": "<p>I have spent almost 2 weeks on the net trying to find a solution, but looks like either I am doing something really stupid, or Prism is not useful for such a decoupled applications i want to create.</p>\r\n<p>I am trying to create an application that will have a base shell that has no knowledge of the modules or the way it handles its own views on the screen, but provide the services for the modules to register with it for activation.</p>\r\n<p>As an example, think of a application for a clinic that can have different modules like: Patient Details, doctors, appointments, services etc. based on the logged in user some of these modules will be applicable for the user. when the user selects a module activation option on the shell, say Patients details, the region on the shell will load the container view of the patient details module and let it load its own views in the nested regions, and when other module is selected, it wil unload this first module and unregister all the nested regions and load the new module &amp; its nested regions.</p>\r\n<p>I have tried to make use of the infrastructure from John Papa's demo at Mix09, and it kind of works as long as my container view of these modules have no nested regions.</p>\r\n<p>I was wondering if there is any reference implimentation that I can look in to to see how this can be done, or if some one can point me how I can achieve to unload the regions that gets registred with the shell's region manager inspite of me using the option to create a new regionmanager scope.</p>\r\n<p>I am using Prism 4 drop 6 at the moment</p>\r\n<p>Thanks &amp; regards</p>",
    "PostedDate": "2010-09-12T03:26:51.54-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "493119",
    "ThreadId": "226921",
    "Html": "<p>I am begning to wonder if I am the only one thinking of developing the application in such a decoupled way. I thought it was a common practice to develop applications like that, and I have been doing something like this in my own framework for years now.</p>\r\n<p>Should I take it that Prism only works when we have well defined Ragions on the Shell and cannot be used when modules can themself define their own sub regions?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-09-13T20:01:27.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "493516",
    "ThreadId": "226921",
    "Html": "<p>&nbsp;</p>\r\n<p id=c0a36910-a1e8-012d-77e5-12313908103b>Hi,</p>\r\n<p>Based on our understanding you need to create an application where the shell  window has no knowledge on how the modules manage their assets (views, services,  etc).&nbsp;So first of all,&nbsp;you could use the <a href=\"http://msdn.microsoft.com/en-us/library/microsoft.practices.composite.presentation.regions.regionmanager.aspx\">RegionManager</a> from&nbsp;your modules&nbsp;to register their views into the main region. There two topics  that might help in this scenario:</p>\r\n<ol>\r\n<li>If&nbsp;you consider that the RegionManager&nbsp;is not enough based on your  requirements, you could&nbsp;take a look at&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ff921158(v=PandP.20).aspx\">Communication</a>&nbsp;(see  the <em>Shared Services</em> section) that could help you on creating a custom  service.</li>\r\n<li>As a user could decide when a module is started, you could&nbsp;load your modules  on demand:&nbsp;<a href=\"http://msdn.microsoft.com/en-us/library/ff921157(v=PandP.20).aspx\">Module</a>&nbsp;(see  the <em>Loading Modules on Demand </em>section). as you do not want </li>\r\n</ol>\r\n<p>&nbsp;As you mentioned that your the views of your modules could provide different  layouts, you could take a look at the following forums threads and MSDN  documentation section where this topic is treaded:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=67191\">Too many  regions in my shell</a></li>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=66540\">CAL -  How to define complex application layout(s) using regions</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921086(v=PandP.20).aspx\">UI  Design Guidance Overview</a> </li>\r\n</ul>\r\n<p>One possible approach in Prism for removing all the views of a particular  module&nbsp;might be to&nbsp;create&nbsp;a main view with a region (it could be scoped)&nbsp;where  all views of the module are added, so&nbsp;you could remove/deactivate the main view  from the region manager. If you need guidance on how to remove a view from a  region, you could check the following Quickstart:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921085(PandP.20).aspx\">View  Injection Composition QuickStart</a> (see this Quickstart to know how to remove  a view from a region)</li>\r\n</ul>\r\n<p>I know that you are using Prism v4, but just in case, you could take a look  at the <a href=\"http://blogs.southworks.net/dschenkelman/\">Damian Schenkelman&rsquo;s  Blog</a> post, which describes a memory leak using scoped regions:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.southworks.net/dschenkelman/2009/12/23/memory-leak-removing-view-with-child-regions-in-prism-v2/\">Memory  Leak removing View with child regions in Prism-v2</a></li>\r\n</ul>\r\n<p>As for how to notify to the application that a new view has been&nbsp;added to the  Main Region, I think there is not something implemented in Prism  out-the-box.&nbsp;But you could extend the Region class to notify when a view is  added (for example&nbsp;using EventAggregator).</p>\r\n<p>In addition,&nbsp;the following quickstarts &amp; reference implementation could  help as a reference:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921090(v=PandP.20).aspx\">Modularity  QuickStarts</a> </li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921074(v=PandP.20).aspx\">Stock  Trader Reference Implementation</a> </li>\r\n</ul>\r\n<p>Please let me know if this helps.</p>\r\n<p id=c0a39d20-a1e8-012d-77e7-12313908103b>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-14T14:06:45.833-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "493915",
    "ThreadId": "226921",
    "Html": "<p>Antivero,</p>\r\n<p>Thanks for your reply, these are indeed some very useful&nbsp;links that you have provided. It took me a while to go through them, but did learn a lot from these links.</p>\r\n<p>&quot;<a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=67191\">Too many regions in my shell</a>&quot; is in perticular very close to what I was looking at, but I was not exactly able to get this working in my previous try when I tried to create a scoped reagion for my modules.</p>\r\n<p>in nutshell this is what I tried.</p>\r\n<p>- Created a Shell with one &quot;ModuleRegion&quot; where my modules would register its container view.</p>\r\n<p>- Created a container view&nbsp; of ModuleX say &quot;ViewX&quot; with some regions for my module and in the module activation added this to the shells's &quot;ModuleRegion&quot; with CreateRegionManagerScope = true.</p>\r\n<p>- when a different module ModuleY is activated, I unregister the earler module container view using shellModuleRegion.Deactivate(ViewX) and shellModuleRegion.Remove(ViewX)</p>\r\n<p>- Now I add the container view of ModuleY say ViewY which has its own reagions</p>\r\n<p>It works fine up to this point, but when I re activate the ModuleX, I end up getting the following error in the big exception stack trace:&quot;Region with given name already registred:&quot;.</p>\r\n<p>Looks like shell somehow gets registred with the internal nested regions of ViewX eventhough its created with the scoped region and after I deactivate and removed it.</p>\r\n<p>do you see something wrong in my approach.</p>\r\n<p>&nbsp;Regards</p>\r\n<p>Kiran</p>",
    "PostedDate": "2010-09-15T09:07:45.653-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "496642",
    "ThreadId": "226921",
    "Html": "<p>Hi,</p>\r\n<p>I&rsquo;ve read all steps that you listed and they seem to be correct. The only  thing is that you&nbsp;could avoid to&nbsp;deactivate the ViewX, since it is not  necessary, but it is just a detail.</p>\r\n<p>Some time ago, I&nbsp;created an spike in Prism v2, that you could download from  <a href=\"http://cid-60a74023ee1812bd.office.live.com/self.aspx/.Public/ViewDiscoverySample.zip\">here</a>.  This spike is using scoped regions and you could remove/add views.</p>\r\n<p>If you download this spike, you could compare&nbsp;it with your scenario.</p>\r\n<p>I hope this helps,</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-21T11:28:23.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]