[
  {
    "Id": "497692",
    "ThreadId": "228362",
    "Html": "<p>Hi, <br>I'm new to PRISM and silverlight. And I'm not able to understand the real deal about the CommandBehaviorBase&lt;T&gt; extensions. I've been reading blogs on this topic for two days yet I'm unable to make any bigger and clearer picture out of it. The more I read about it the more unanswered questions raises. So can anyone post some good link[s] that can explain the the very basic concepts about this Class. I know we need it for creating custom behaviors. What I want to know is;</p>\r\n<ul>\r\n<li>what differentiate this from Behavior&lt;T&gt; which was part of SL3 </li>\r\n<li>Is it mainly related to WPF? </li>\r\n<li>Is there any other alternate for this in PRISM for silverilght? </li>\r\n<li>under what scenarios I'd need it? </li>\r\n<li>Can I implement my behaviors for &quot;FrameworkElement&quot;? should that work for every control or do I need to do that for every different control? </li>\r\n<li>And can I create behavior using this for some properties of the controls as well if yes then how can I do that? Because most of the blogs I've gone through only talk about Events somehow</li>\r\n<li>Last but not the least how can I debug this component, as I've made couple of hello world kind of behaviors for my custom grid but it doesn't work but thing is they don't even flash any kind of error whatsoever. </li>\r\n</ul>\r\n<p>your every answer will highly appreciated. Thanks in advance.</p>\r\n<div id=\"_mcePaste\" style=\"left:-10000px;top:0px;width:1px;height:1px;overflow:hidden\">\r\n<h3><strong><strong>Behavior&lt;T&gt;</strong></strong></h3>\r\n</div>",
    "PostedDate": "2010-09-23T10:54:44.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "497711",
    "ThreadId": "228362",
    "Html": "<p>Hi,</p>\r\n<p>&nbsp;</p>\r\n<p>Nice to see that you started using Prism. In the latest drop, there is a documentation section dedicated specifically to this topic. So, for more information I would recommend to you to download the latest drop from <a href=\"../releases/view/52647\">here</a>, so you could take a look at the following documentation section (this document hasn&rsquo;t been published online yet):</p>\r\n<ul>\r\n<li>Silvelight 3 Command Support (new)</li>\r\n</ul>\r\n<ul>\r\n</ul>\r\n<p>I think this document could cover most of your questions.</p>\r\n<p>I hope this helps,</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-23T11:38:28.56-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "498113",
    "ThreadId": "228362",
    "Html": "<p>Hi again, <br>thanks fantivero for your timely help, this makes much more sense now.</p>\r\n<p>I've managed to implement couple of commandbehaviors for couple of controls. One of which I'd like to ask inquire about which is SelectionChanged of a datagrid. Can you share some pointers about how can I get something like RowObject,of my datagrid that can let me customize my datagrid control in general like different cells or selected rows or something like that while implementing CommandBehaviorBase&lt;T&gt; type. I really can't see anything of that sort within my given delegate functions for the events in the behaviors. I assume It might be bit off topic as its not directly related to PRISM&nbsp; but I'd be really grateful to you once again if you can just shed some light on this too.</p>",
    "PostedDate": "2010-09-24T08:45:00.323-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "498163",
    "ThreadId": "228362",
    "Html": "<p>Hi,</p>\r\n<p>Nice to see that you find the documentation interesting.&nbsp;Based on&nbsp;my  understanding your&nbsp;want&nbsp;to create a CommandBehavior&nbsp;for&nbsp;the SelectionChange of  your grid.&nbsp;Additionally, this command should pass as argument the row  values.</p>\r\n<p>Therefore, for achieving your scenario, I would recommend you to take a look  at the <strong>Microsoft.Practices.Prism.Commands.Click</strong> class&nbsp;under  the&nbsp;Prism.Silverlight or Prism.Desktop projects, since this implementation uses  the ButtonBaseClickCommandBehavior and&nbsp;also supports CommandParamaters. So your  implementation might be similar to this.</p>\r\n<p>In addition in the documentation&nbsp;<em>Silvelight 3 Command Support (new)</em> there is a section related to this named&nbsp;<em>Providing a Command Parameter  Value</em></p>\r\n<p>On the other hand, you could check the reference implementations  applications, since it might be helpful to see how this commands are used.</p>\r\n<p>I hope that this helps,</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-24T10:18:59.187-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]