[
  {
    "Id": "500638",
    "ThreadId": "229187",
    "Html": "<p>I really need a mechanism from Prism which allow Prism-based application being able to navigate to a page opened in a separate window. I check the Prism document Chapter 7 Navagation, looks the navagation avaliable in the Prism are either State-based or View-based, the&nbsp;latter is quite close to what I am looking for. But it is still the navagation inside the one window. Will Prism provide this capability in Silverlight? Note, the page(view) hosted in a &quot;new window&quot; means that it is not &quot;Modal&quot; child window. The &quot;new window&quot; is more like a new shell to host necessary views(pages), it should like a &quot;sibling&quot; to origial shell window.</p>",
    "PostedDate": "2010-09-30T11:15:44.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500666",
    "ThreadId": "229187",
    "Html": "<p>Hi Shirley,</p>\r\n<p>There is no guidance on this topic in Prism out-of-the-box.&nbsp;Therefore, I  would recommend to you take a look at the following forum thread: <a href=\"View.aspx?ThreadId=228299\">Navigation  between two dynamically downloaded Silverlight application</a>.</p>\r\n<p>The information provided in the aforementioned forum thread is for  Silverligth 3, but it might help in your scenario.</p>\r\n<p>I will create a work-item for this. So the product team will be notified.  This way other users can vote this.</p>\r\n<p>I hope this help.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-09-30T12:14:29.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "500668",
    "ThreadId": "229187",
    "Html": "This discussion has been copied to a work item. Click <a href=\"http://compositewpf.codeplex.com/workitem/7321\">here</a> to go to the work item and continue the discussion.",
    "PostedDate": "2010-09-30T12:17:33.787-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]