[
  {
    "Id": "501829",
    "ThreadId": "229492",
    "Html": "<p>The Readme with the pre-release Prism v4&nbsp;&ldquo;Drop 8&rdquo; says under <em>&ldquo;Major changes in this drop&rdquo;:&nbsp; <br></em><em>&ldquo;Started converting the StockTraderRI to MEF and update for consistency with MVVM guidance.&rdquo;</em></p>\r\n<p>Does that mean the plan is to fully MVVM-ize it to the same extent as the MVVM-RI sample by the time v4 releases?</p>\r\n<p>Hmm.&nbsp; After looking at the &quot;Drop 8&quot;&nbsp;StockTraderRI sample again, it looks like&nbsp;some of the MVVM-izing has already been done.&nbsp; For example, ITrendLinePresentationModel.cs is now ITrendLineViewModel.cs.</p>\r\n<p>How much needed to be changed?</p>\r\n<p>Thanks,<br>SLEverywhere</p>",
    "PostedDate": "2010-10-03T21:26:39.053-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "501833",
    "ThreadId": "229492",
    "Html": "<p>That is the plan.&nbsp; Look for the changes in Drop 9, which <em>should</em> happen in the next week or so... assuming things go well.</p>\r\n<p>In addition to MVVM-izing the Stock Trader, we also MEFified it as people were requesting a more complex MEF example.</p>\r\n<p>Let me know if you have any questions</p>",
    "PostedDate": "2010-10-03T22:07:23.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "502653",
    "ThreadId": "229492",
    "Html": "<p>A related question about the MVVM-samples:</p>\r\n<p>I'm curious about the origin of the &quot;MVVM RI&quot; sample that is new with Prism v4.</p>\r\n<p>Is it somewhat positioned as a response to the <a href=\"http://www.galasoft.ch/mvvm/getstarted/\">MVVM-Light-Toolkit</a>?&nbsp; Like MVVM-Light, it strips away most of traditional features of full-Prism.&nbsp; It has no Unity Depenency-Injection or Prism-modularity features, no UI-Regions, no EventAggregator, etc.&nbsp; Instead of using Unity DI, or the Prism-ized MEF used by the full StockTrader-RI sample, it uses MEF directly.</p>\r\n<p>MVVM-Light seems to have quickly risen over the last year to become a strong #2 contender in this SL/WPF-framework space. Some have made the argument that with &quot;MVVM-Light plus MEF&quot;, many people don't really need the intimidating complexity of full-blown Prism.&nbsp; (See for example, <a href=\"http://forums.silverlight.net/forums/p/153083/343298.aspx\">Laurent's comment here</a>.&nbsp; Note this 2010-01 comment is about the older, pre-v4 version of Prism.)</p>\r\n<p>The &quot;MVVM RI&quot; sample seems to be Prism v4's way of saying: <em>&quot;Dude... You want 'lite'?&nbsp; We can do that too!&quot;</em></p>\r\n<p>Hey, competition is often good.</p>\r\n<p><br>Any truth to the above hypothesis?</p>\r\n<p>Thanks,<br>SLEverywhere</p>",
    "PostedDate": "2010-10-05T11:54:09.483-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]