[
  {
    "Id": "502964",
    "ThreadId": "229806",
    "Html": "<p>Hello,</p>\r\n<p>Having worked with the SCSF for a number of years I am keen to get a handle on Prism.</p>\r\n<p>I have been working with drop 7 of prism 4.0 and seem to be having an issue with View Injection, the application i'm working on has a standard Master --&gt; Detail set of regions and then a navigation region alongside all of which are contained within the Shell.xaml</p>\r\n<p>I have come across an issue when attempting to inject a view into the DetailRegion based on selection in the Master View, (I need to make use of injection to set the Datacontext of the view) No error messages are encountered and i can see the DetailView added and active within the RegionManager instance however the View does now show in the UI. The logic is plugged in via the Event Aggregator (FYI)</p>\r\n<p>I've tried using a few variations of injection (in line with examples in the quick starts and StockTrader examples) all of which produce the same result, If i choose to use View Discovery to show the detail view then it appears but of course with no data context.</p>\r\n<p>I've just created a simple HelloWord app that just has a Shell and single Module and still cannot get View Injection to work.</p>\r\n<p>Am i missing a step anywhere? Or is the issue around the Region Manager Context seeing as the injection occurs within the Module Controller but is targeting a region in the Shell?</p>\r\n<p>Any pointers would be appreciated.</p>\r\n<p>Thanks</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-06T06:24:47.79-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "503153",
    "ThreadId": "229806",
    "Html": "<p>Hi,</p>\r\n<p>Nice to see that you started using Prism. I think that you can find  interesting that the <a href=\"../releases/view/53420\">Drop 9 of Prism</a> has been released. In this drop&nbsp;the Prism Library 4.0 code base are now code  complete.</p>\r\n<p>On the other hand, there is not similar issues reported so far. I assume that  you need programmatic control when adding the view to your regions and this is  why you opted to use View Injection. But I would recommend to you take a look at  the following documentation section on MSDN:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921075(PandP.20).aspx\">UI  Composition</a> (see the <em>When to Use View Discovery vs. View Injection </em>section)</li>\r\n</ul>\r\n<p>If you continue experiencing this, could you send the repro sample that you  mentioned?</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-06T11:59:35.863-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]