[
  {
    "Id": "506822",
    "ThreadId": "230801",
    "Html": "<p>Is there any plan to have WPF support something similar to the popupchildwindowaction class?&nbsp; I've seem a few posts that say the Interaction Request functionality can be used with WPF but it doesn't seem very useful as it is today.</p>",
    "PostedDate": "2010-10-13T12:11:53.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "506902",
    "ThreadId": "230801",
    "Html": "<p>Hi,</p>\r\n<p>As we are really close to the RTM version of Prism 4, in the Major Changes section&nbsp; is mentioned that the code base, Quickstarts and Reference Implementations are code complete. So the next drops will probably contain bug fixes. Anyway, we have to wait for the final release.<br><br>On the other hand, you could try to implement it on your own and if you have any particular problem you could ask for help here as well in the WPF forum.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-13T14:48:23.013-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "507126",
    "ThreadId": "230801",
    "Html": "<p>Hi,</p>\r\n<p>That's what I have been worried about since I saw that all the new samples were only in Silverlight. In my opinion Prism should equally provide guideline for both Silverlight and WPF which is missing for interaction Requests, unfortunately.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-14T02:06:17.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "507579",
    "ThreadId": "230801",
    "Html": "<p>See this is exactly what I said in a previous post.&nbsp; I felt and still feel this way that they are focusing on silverlight as the primary implementation, not a single new example and not that StockTrader isn't an ok example but newer examples showing how to put out something like &quot;Child Windows&quot; for WPF, cause right now I am slightly stuck trying to figure out the best way to implement this feature at present.&nbsp; The example they show in StockTrader isn't nearly as elegant a solution as the one currently in the silverlight portion of this release. Trying to use the example as a basis for my implementation fails trying to load my MainRegion primarily crashing on the AutoPopulateExportedViewsBehavior and not having a key.&nbsp; Trying to debug this is like 1 legged man in a -_- kicking contest...</p>\r\n<p>I don't expect to see another ticket opened either guys.&nbsp; Lets be realistic ya'll aren't going to do anything else but bug fixes from this point on.&nbsp;</p>",
    "PostedDate": "2010-10-14T22:26:16.33-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "507779",
    "ThreadId": "230801",
    "Html": "<p>Hi,</p>\r\n<p>Thanks for you feedback. I think that you can find interesting the following work-item&nbsp;and forum thread:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/workitem/7235?FocusElement=CommentTextBox\">WPF Examples...</a> (work-item)</li>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=226532\">WPF Examples...</a> (forum thread)</li>\r\n</ul>\r\n<p>In the work-item, <a href=\"http://blogs.msdn.com/b/kashiffl/\">Karl Shifflett</a> (PM of the prism product&nbsp;team) mentioned that there will be a series of blog posts and Patterns &amp; Practices Symposium content that will be in WPF. And that if this does not address your requirements, you could write him back (<a href=\"http://compositewpf.codeplex.com/workitem/7235?FocusElement=CommentTextBox\">in the work-item</a>).</p>\r\n<p>Your feedback will be appreciated.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2010-10-15T07:06:43.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]