[
  {
    "Id": "509701",
    "ThreadId": "231571",
    "Html": "<p>Hi all,</p>\r\n<p>I try to explain myself clearly. Say I have an application with 2 regions in shell: Menu bar, main region. As name indicated, I host a menu bar in menu bar region; and main region is the main area my application works.</p>\r\n<p>I created several modules to host in main region as well. Let's say the first module is customer search module/view, there are some text boxes to let user enter search conditions, and there is a button to load list of customers. If user wants to see details of selected customer in the list, I would like to:</p>\r\n<ul>\r\n<li>unload current module/view from main region;</li>\r\n<li>load a different module/view (customer detail module/view) to main region;</li>\r\n<li>pass selected customer object from customer list module/view to customer detail module/view;</li>\r\n</ul>\r\n<p>The problem is that module is not aware of other modules, ﻿I can use event aggregator to publish events, but how can I broadcast customer object as parameter while event is publish? And how can I inform shell to load proper module (customer detail module/view) from customer list module/view?</p>\r\n<p>Thanks</p>\r\n<p>Hardy</p>",
    "PostedDate": "2010-10-19T17:37:52.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "509720",
    "ThreadId": "231571",
    "Html": "<p>Never mind my question, I figured out.</p>",
    "PostedDate": "2010-10-19T18:51:11.613-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "509950",
    "ThreadId": "231571",
    "Html": "<p>Hi Hardy,</p>\r\n<p>Nice to see that you figured out this. Additionally, take into account that the Stock Trader Reference Implementation provides guidance on this topic.</p>\r\n<p>I would like to share the following link on MSDN for other users with a similar scenario: <a href=\"http://msdn.microsoft.com/en-us/library/ff921122(PandP.20).aspx\">Event Aggregator</a></p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-20T07:37:52.04-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]