[
  {
    "Id": "509601",
    "ThreadId": "231544",
    "Html": "<p>Hello,</p>\r\n<p>I have a Shell which is defined in regions.</p>\r\n<p>Modules get loaded into the contenet region.</p>\r\n<p>Inside the module, I like to create multiple regions and inject the views. I took a look at the &quot;View Injection Composition&quot;, but it will not work for me. Because, ﻿﻿﻿InitializeModules in Bootstrapper loads both the modules where as I will have only one module and load the user controls into the region.</p>\r\n<p>Any help / thoughts will be appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-19T13:43:21.567-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "509618",
    "ThreadId": "231544",
    "Html": "<p>Hi,</p>\r\n<p>If your scenario requires to load modules on demand, you could take a look at following documentation section on MSDN:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921071(PandP.20).aspx\">How to: Load Modules on Demand</a></li>\r\n</ul>\r\n<p>For more information on this topic you could take a look at the Modularity Quickstart.<br><br>However, based on my understanding, the problem in your scenario is not strictly related to modularity, so I would recommend you to check <strong>the Navigation Quickstart</strong>. Since I think that you can find interesting how to manage more complex navigation scenarios.<br><br>On the other hand, take into account that when you expose a ContentControl as a region, it allows a maximum of one active view at a time (this view can contain the multiple regions). <br><br>Hope this helps.</p>\r\n<p>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2010-10-19T14:21:52.97-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "509621",
    "ThreadId": "231544",
    "Html": "<p>Fernando, Thanks for the quick response. I will take a look at the Navigation Quickstart.</p>",
    "PostedDate": "2010-10-19T14:31:32.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]