[
  {
    "Id": "512929",
    "ThreadId": "232409",
    "Html": "\r\n<p>I would like to manage a toolbar in my PRISM application. <br>\r\nMaybe i can create toolbar items using a &quot;shared&quot; service from all modules. Anyway an importan thing is that toolbar botton have to change his enabled state depending on active view. For example could have a CRUD toolbar and his buttons have to be disabled\r\n if current view isn't a CRUD view or just Save button have to be disabled if active cRUD view is in a query state instead than edit states.</p>\r\n<p>What can you suggest me... for reach this purpose? Did i have to implement an &quot;Application Controller&quot; pattern? How can i recognize what is the currentview and (for example) update te ViewModel connected to ToolBar control?</p>\r\n<p>regards.</p>\r\n",
    "PostedDate": "2010-10-26T12:30:29.813-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "513451",
    "ThreadId": "232409",
    "Html": "\r\n<p>after thinking about it and the way my application is coming together, implementing the application controller pattern might not be a bad idea.&nbsp; Actually put this into my code last night to help facilitate EF initilization and will be a precursor to\r\n login authentication later.</p>\r\n",
    "PostedDate": "2010-10-27T08:53:29.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "514119",
    "ThreadId": "232409",
    "Html": "\r\n<p>But...what can you tell me about my questions? What do you&nbsp; think about find what is the view in active state?</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-28T10:40:36.353-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "514682",
    "ThreadId": "232409",
    "Html": "\r\n<p>Hi,</p>\r\n<p>You can find a response to this in your other forum thread <a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=232618\">\r\nhere</a>.</p>\r\n<p>Fernando Antivero</p>\r\n<p><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-29T11:23:44.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]