[
  {
    "Id": "514143",
    "ThreadId": "232693",
    "Html": "\r\n<p>Are there any samples or quick starts of using Prism navigation with a Menu? Basically the Menu should be databound to data the defines it. Then I need some way to load a view into a region based on the menu item being selected?</p>\r\n<p>So, in my shell I would have a menu. There would also be a MainRegion or something that is most of the screen other then title bar and menu. Selecting a menu item should load a view into MainRegion. Bonus points.... if the view is in a module that hasn't\r\n been loaded yet then what?</p>\r\n<p>Off the top of my head I think I would need a view model with a ICommand like &quot;LoadView&quot;. The menu items are bound to that command (somehow?) and the command in the ViewModel checks if the view is in a loaded module.</p>\r\n<p>Is this possible? How would I know what module the view is in? Do I need that info in the menu data?</p>\r\n<p>I can find samples of doing this stuff with the SL navigation framework... but not with the prism navigation/regions stuff.</p>\r\n<p>BOb</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-10-28T11:39:01.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "514733",
    "ThreadId": "232693",
    "Html": "\r\n<p>Hi BOb,</p>\r\n<p>There is no an application like you described, but the Region Navigation Quickstart is pretty similar to this. For example you could assign a list of views to the right menu to define it. This menu is an ItemsControl, and as you mentioned that you need commands\r\n in each menu item, you could add to this buttons (it is also demonstrated in the Quickstart). Additionally, in this quickstart views are loaded based on the options selected in the right menu, as you required.</p>\r\n<p><br>\r\n<img src=\"http://pqht8w.bay.livefilestore.com/y1p2lrp2FhyRtnRWaeS0SyzwHZDlfraBhqmN6wCn10d1q2aQI3n8Me9oMeO7VY2Yoqxk-QZOIHFwOHmE2K45y2WEaUkR1X8LEV5/navigation.png?psid=1\" alt=\"\" width=\"505\" height=\"196\"></p>\r\n<p>If you need to know what is the current active view, you could check the following forum thread:\r\n<a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=232618\"><span>Recognize active view</span></a></p>\r\n<p>On the other hand, take into account that the Journal of Prism Navigation could provide you the Uri of the view where you navigated to (e.g.\r\n<strong>ModuleA\\View1</strong>). If you want more information about this, you could take a look at the following forum thread:\r\n<a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=232599\"><span></a><a>How to get resulting view from RequestNavigate?</a>\r\n</span></p>\r\n<p>Regarding to load modules on demand and how to manage this, you could take a look at the Modularity Quickstart, since it provides guidance on this topic.</p>\r\n<p>For more information you could check the following documentation section in the Prism4.chm:</p>\r\n<ul>\r\n<li><strong>View-Switching Navigation QuickStart </strong></li><li><strong>Modularity QuickStarts for Silverlight</strong> </li></ul>\r\n<p>&nbsp;Hope this helps.</p>\r\n<p>Fernando Antivero</p>\r\n<p><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n",
    "PostedDate": "2010-10-29T13:10:05.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]