[
  {
    "Id": "515858",
    "ThreadId": "233145",
    "Html": "\r\n<p>I'm starting a new LOB application with Silverlight v4 and WCF Ria Services (maybe Sp1), EF4 o Nhib</p>\r\n<p>The idea is to use Prism v4, that includes MVVM, MEF and Unity.</p>\r\n<p>Can I use all togheter these &quot;tecnologies&quot;: which scenario of architecture can be imagined?</p>\r\n<p>Make sense to write a skeleton to build such kind of application (with tests?!?) that can be reuse? Maybe already exist as sample application?</p>\r\n<p>(in Prism v4 there are a lot of sample project, but not one that includes all &quot;tecnologies&quot;)</p>\r\n<p>Thanks in advance.</p>\r\n",
    "PostedDate": "2010-11-02T04:14:06.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "515922",
    "ThreadId": "233145",
    "Html": "\r\n<p>Imo choose MEF or Unity not both... I am using WPF and EF4, but will probably include WCF later for communication with WinPhone7.&nbsp;&nbsp; Other than that yes it can be done.&nbsp; Also there have been some interesting developments from MS at PDC about\r\n using Silverlight for web development.&nbsp;&nbsp;Now they say to use Html5 and SL is for WinPhone7</p>\r\n",
    "PostedDate": "2010-11-02T06:51:45.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "515995",
    "ThreadId": "233145",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Nice to see that you are considering to use Prism 4 in your application. First of all, when you start a new application with Prism, you have to take key decisions. Therefore, I think that you can find the following documentation sections in the Prism4.chm\r\n interesting (it will be available on MSDN early the following week):</p>\r\n<ul>\r\n<li><strong>Chapter 2: The Prism Bootstrapper</strong>, see the <em>Key Decisions</em> section.\r\n</li><li><strong>Chapter 3: Managing Dependencies Between Components</strong>, see the\r\n<em>Key Decisions</em> section.<strong></strong> </li><li><strong>Chapter 4: Modular Application Development</strong>, see the <em>Key Decisions</em> section.\r\n</li><li><strong>Chapter 5: Implementing the MVVM pattern</strong>, see the <em>Key Decisions</em> section.\r\n</li><li><strong>Chapter 6: Composing the User Interface</strong>, see the <em>UI Layout Key Decisions\r\n</em>section. </li></ul>\r\n<p>As for the Dependency Injection Container (DIC), the product team of Prism recommends you the usage of Unity or MEF. Quickstarts and Reference Implementation Applications are using them. But take into account that Prism is container-agnostic. That means\r\n that you could use the DIC of your choice. Therefore, one of your key decisions will be to choose the DIC for your application, as mentioned in this thread.</p>\r\n<p>Regarding to your questions about architecture, there is a specific document about the Prism Library Architecture, so you could take a look at the following documentation section in the Prism4.chm:\r\n<strong>Prism Library Baseline Architecture</strong></p>\r\n<p>Most Quickstarts and Reference Implementation Applications include acceptance tests, so you will find in the following list some of them:</p>\r\n<ul>\r\n<li>Commanding Quickstart </li><li>EventAggregation Quickstart </li><li>Modularity Quickstart </li><li>MVVM Quickstart </li><li>Navigation Quickstart </li><li>UIComposition Quickstart </li><li>Stock Trader Reference Implementation Application </li></ul>\r\n<p>If you are looking for a more complex scenario that ties together all technologies provided in Prism, you could check the\r\n<strong>Stock Trader RI</strong>. Some of the Design Concepts, Technologies and Patterns implemented in this application are:</p>\r\n<ol>\r\n<li>Managed Extensibility Framework (MEF) as the dependency injection container. </li><li>Modularity and user interface (UI) composition through custom attributes. </li><li>Model-View-ViewModel pattern (MVVM). </li><li>Region-based navigation. </li><li>Modularity. </li><li>UI Composition. </li><li>More... </li></ol>\r\n<p>For further information about this Reference Implementation, you could check the following documentation section in the Prism4.chm:\r\n<strong>Stock Trader Reference Implementation</strong></p>\r\n<p>On the other hand, about the Silverlight role, which is mentioned in Bob Muglias's interview during PDC, he posted some clarifications&nbsp; as well as Somasegar:</p>\r\n<ul>\r\n<li><a href=\"http://team.silverlight.net/announcement/pdc-and-silverlight/\">PDC and Silverlight</a>\r\n</li><li><a href=\"http://blogs.msdn.com/b/somasegar/archive/2010/11/01/silverlight-lighting-up-the-client.aspx\">Silverlight: Lighting up the client</a>\r\n</li></ul>\r\n<p>Hope this helps.</p>\r\n<p>Fernando Antivero <br>\r\n<a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n",
    "PostedDate": "2010-11-02T09:10:28.457-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]