[
  {
    "Id": "522180",
    "ThreadId": "234747",
    "Html": "\r\n<p>So most descriptions of the MVVM pattern state that ViewModels should not have access to the View it services a<em>t least not in a direct way</em>.&nbsp;It seems to me that the RegionManager implementation forces us to have at the very least an indirect\r\n reference to the view. Take for example a CloseCommand that exists on a ViewModel. In order to remove said view from the region manager that command would need to have access to its view either directly or indirectly in order to call the RegionManager's remove\r\n methods. Has anyone come up with a solution to closing views that can avoid this indirect reference?</p>\r\n<p>BDN</p>\r\n",
    "PostedDate": "2010-11-15T08:06:12.967-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "522309",
    "ThreadId": "234747",
    "Html": "\r\n<p>Hi BDN,</p>\r\n<p>In a Prism application, views can be removed from any place if you have access to the RegionManager and the name for identifying a particular view. That said, you could avoid removing views from its ViewModel if you want.</p>\r\n<p>For example in the Stock Trader RI, views are removed from a Controller class. If you need more guidance on this topic you could take a look at the following Reference Implementation Application:\r\n<a href=\"http://msdn.microsoft.com/en-us/library/ff921074%28PandP.40%29.aspx\">Stock Trader Reference Implementation</a>, see the\r\n<strong>OrdersController </strong>class in the <strong>StockTraderRI.Modules.Position\r\n</strong>project.</p>\r\n<p>Hope this helps.</p>\r\n<p>Fernando Antivero<br>\r\n<a href=\"http://blogs.southworks.net/fantivero\"><span style=\"color:#0066cc\">http://blogs.southworks.net/fantivero</span></a></p>\r\n",
    "PostedDate": "2010-11-15T12:20:34.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "522716",
    "ThreadId": "234747",
    "Html": "\r\n<p>Thanks for the insight Fantivero. Missed that overload :-) My MVVM impl in once again pure.</p>\r\n",
    "PostedDate": "2010-11-16T07:32:33.16-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]