[
  {
    "Id": "526233",
    "ThreadId": "235819",
    "Html": "\r\n<p>Hi,</p>\r\n<p>I have the following setup</p>\r\n<ul>\r\n<li>Shell\r\n<ul>\r\n<li>MainRegion\r\n<ul>\r\n<li>ModuleA\r\n<ul>\r\n<li>ModuleAView\r\n<ul>\r\n<li>Tab control </li></ul>\r\n</li></ul>\r\n</li></ul>\r\n</li></ul>\r\n</li></ul>\r\n<p>Assume the tab control has 3 tabs in it with each tabs content being a view with its own view model. Each of the 3 tabs have a edit mode. Now when a user edits something in tab 1 and then clicks on tab 2 without saving, I want to alert the user with a confirmation\r\n message saying &quot;You have unsaved changes. Do you wish to continue to navigate?&quot; using a InteractionRequest.</p>\r\n<p>As far as I understand the IConfirmNavigationRequest interface handles this. But its ConfirmNavigationRequest gets called only when the RegionManager is attempting to switch views within a region. i.e. say when it tries to navigate away from ModuleA to ModuleB\r\n in the MainRegion. But my scenario above is not the case. In my case the ModuleAView remains in the MainRegion, but its a navigation between the tabs in the view.</p>\r\n<p>How should I handle this? Do I need to create TabRegionAdapter instead? If yes then can you post and example demonstrating the same?</p>\r\n<p>Thanks.</p>\r\n",
    "PostedDate": "2010-11-23T21:24:55.857-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "526452",
    "ThreadId": "235819",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Based on my understanding, you need to detect when a view has undergone changes. Now, when a user switches between views, you need to prompt a confirmation dialog. First of all, it does not seem necessary to create a custom Region Adapter for achieving this,\r\n since Prism has already provided a region adapter for the Silverlight TabControl.</p>\r\n<p>That said, another user with a similar scenario has just been answered yesterday, so I think that you can find the following forum thread interesting:\r\n<a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=235477\">TabControlRegionAdapter: how to confirm tab switching</a></p>\r\n<p>Hope this helps.</p>\r\n<p>Fernando Antivero <br>\r\n<a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n",
    "PostedDate": "2010-11-24T07:27:01.333-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "527167",
    "ThreadId": "235819",
    "Html": "\r\n<p>Thanks Fernando.</p>\r\n<p>I'll have a go and let you know if I get stuck anywhere.</p>\r\n",
    "PostedDate": "2010-11-25T19:20:18.567-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]