[
  {
    "Id": "528368",
    "ThreadId": "236414",
    "Html": "\r\n<p>It would be really nice if there was a sample app that used XBAP.</p>\r\n<p>Specifically one that uses an xaml file to load the modules.</p>\r\n<p>Many companies like the ease of browser based deployment but since they own the computer they can ensure that the computer has the full .net framework.</p>\r\n",
    "PostedDate": "2010-11-29T09:15:13.973-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "528389",
    "ThreadId": "236414",
    "Html": "\r\n<p>Hi,</p>\r\n<p>There is no guidance on this topic in Prism out-of-the-box. But I think that you can find the following blog posts in the Matias' blog and Damian's blog interesting:</p>\r\n<p><a href=\"http://blogs.southworks.net/matiasb/2009/03/11/using-cal-with-xbap-applications/\">Migrating Composite Application Guidance (Prism-v2) to XBAP</a></p>\r\n<p><a href=\"http://blogs.southworks.net/dschenkelman/2009/03/13/composite-application-guidance-for-wpf-silverlight-prism-v2-reference-implementation-migrated-to-xbap/\">Composite Application Guidance for WPF &amp; Silverlight (Prism v2) Reference Implementation\r\n migrated to XBap</a></p>\r\n<p>Both are for Prism v2, but I think that you could use them as a starting point.</p>\r\n<p>Hope this helps.</p>\r\n<p>Fernando Antivero <br>\r\n<a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-11-29T10:05:01.083-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "528522",
    "ThreadId": "236414",
    "Html": "\r\n<p>Thanks for the quick response.</p>\r\n<p>I tried both of those and they failed for a &quot;true&quot; xbap.&nbsp; (the first one works as far as it goes, but you don't end up with an xbap, just an exe that is running as a page in a separate navigation window.&nbsp; Trying to run that in IE does not work\r\n (and the link it offers to get it to run in IE does not work).</p>\r\n<p>Either way, when you create a xbap project and try to lay it out the way those links describe it fails to run.</p>\r\n<p>Note, that all of the above examples seem to be with Prism v2 and Visual Studio 2008.&nbsp; When I tried them I was using Prism v4 and Visual Studio 2010 (Ultimate).&nbsp; I suspect that some of the problems I have had are related to both the move of Prism\r\n versions and the different version of Visual Studio.</p>\r\n<p>I was hoping for a reference implementation because none of those worked for me.&nbsp;</p>\r\n<p>Just as a side note: I am trying to get a good deployment strategy for Prism and am really struggling.&nbsp; I had problems with Click Once (http://compositewpf.codeplex.com/workitem/7546) and the Xbap stuff is not working for me either.&nbsp; I will give\r\n the click once stuff another try as xbap just does not seem to be the common route for prism users.</p>\r\n",
    "PostedDate": "2010-11-29T15:14:14.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "813216",
    "ThreadId": "236414",
    "Html": "<p>Hi,</p>\r\n<p>For those interested in this topic, you can find a small sample <strong>XBAP </strong>application using <strong>Prism v4</strong> attached to the following work item:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/workitem/9241\">IRegion.ActivateView doesn't show the View in an XBAP application - (HelloWorld XAP Sample.zip attachment)</a></li>\r\n</ul>\r\n<p>However, take into account that, as mentioned in this thread and in the aforementioned work item, there is no official guidance about this in Prism and it seems that the Prism library is not prepared to be used in <strong>XBAPs </strong>application as out of the box.</p>\r\n<p>Regards,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-03-20T14:01:11.7-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]