[
  {
    "Id": "529504",
    "ThreadId": "236727",
    "Html": "\r\n<p>I am currently building a Proof of Concept to start using Prism in our LOB Silverlight applications.&nbsp; This is due to the overal size of the applications we are required to build, so we need a more modular framework to help increase developer productivity.&nbsp;\r\n In essence it is nice for the developers to be able to focus on a streamlined set of requirements focused around one &quot;module&quot; in the application.</p>\r\n<p>I am having difficulty with 2 similar areas in setting up my POC.&nbsp; So it is pretty much 2 questions.</p>\r\n<p>1) I would like the modules to be pretty loosly coupled (of course) from the shell, so that a developer would just have some base guidlines (size of module, events to subscribe/publish, etc).&nbsp; This means I would like the developer to be able to develop/use\r\n RIA services that are module specific.&nbsp; However the issue I am seeing is with where I would actually HOST the RIA services so that the modules can actually be debugged in the Shell.&nbsp; It doesn't seem like the developer would be able to have their\r\n own Host/Web project specific to the module, because then the RIA service wouldn't be associated with the Host/Web project that the shell is using.&nbsp; So I guess the basic question would be, what is the best practice for Hosting/Using RIA services during\r\n module development?</p>\r\n<p>2) This would pretty much be the same question, except related to WCF services that are pre-existing in our current SOA.&nbsp; We have a large inventory of re-usable business services that I would like to be consumed (if needed) during module development.&nbsp;\r\n However in my POC I'm having difficulty getting the Shell to correctly load the service references in the host project.&nbsp; I'm simply building the module like I would any other, except adding a Service Reference and using the data contract as my &quot;model&quot;.&nbsp;\r\n However when loading the module in the Shell, I get tons of issue around it not finding the endpoints, etc.&nbsp; Do you also have an example/guidance in this area?</p>\r\n<p>Thanks!&nbsp; So far I love what i'm seeing with Prism, it seems like a great framework!</p>\r\n<p>Travis</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-01T08:05:10.327-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "529592",
    "ThreadId": "236727",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Nice to see that you are considering to use Prism 4 in your LOB Silverlight Application. Prism is meant to be a guidance to help you on building composite application.</p>\r\n<p>Regarding to your first question, there is no guidance on how to use RIA services in Prism out-of-the-box. But I think that you can find the following forum thread interesting:\r\n<a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=78350\"><span>Prism - Silverlight WCF RIA Services - Authentication</span></a></p>\r\n<p>If you need to use WCF Services in your Prism application, you could take a look at the following links:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.southworks.net/matiasb/2009/06/20/how-to-consume-wcf-services-from-composite-application-guidance-for-wpf-and-silverlightprism-v2-modules/\">How-to: Consume WCF services from Composite Application Guidance for WPF and Silverlight(Prism-v2)\r\n Modules</a> </li><li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=236657\">Configuring Unity Container with Service that calls WCF service?</a>\r\n</li></ul>\r\n<p>Hope this helps.</p>\r\n<p>Fernando Antivero <br>\r\n<a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-01T11:17:39-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "530112",
    "ThreadId": "236727",
    "Html": "\r\n<p>I found another good article (though for Prism v2) that provides a sample implementation.&nbsp;</p>\r\n<p><a href=\"http://blogs.msdn.com/b/dphill/archive/2009/08/17/prism-and-net-ria-services.aspx\">http://blogs.msdn.com/b/dphill/archive/2009/08/17/prism-and-net-ria-services.aspx</a></p>\r\n",
    "PostedDate": "2010-12-02T08:01:38.943-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "530176",
    "ThreadId": "236727",
    "Html": "\r\n<p>Hi Travis,</p>\r\n<p>Thank you for sharing this with the community, since other users might find this helpful to further clarify this subject.</p>\r\n<p>Guido Leandro Maliandi <br>\r\n<a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>\r\n",
    "PostedDate": "2010-12-02T09:33:47.507-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]