[
  {
    "Id": "532921",
    "ThreadId": "237598",
    "Html": "\r\n<p>Greetings All!</p>\r\n<p>I would like to bind a list box to a list of views in a given region.&nbsp; What I already have is a treeview whereby when a user clicks on a node a view is rendered in a region.&nbsp; The region can end up with multiple views on it depending on the number\r\n of nodes the user clicks on.&nbsp; What I would like is for the end-user to visually see how many views they have open by displaying a view count AND a list of the views so the user can click on a given view and navigate to it.&nbsp; Anybody have any suggestions\r\n on how to bind a list box to a regions views?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>\r\n<p>&nbsp;</p>\r\n<p>-Andy</p>\r\n",
    "PostedDate": "2010-12-08T07:51:20.913-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "532974",
    "ThreadId": "237598",
    "Html": "\r\n<p>Why not use an event, we use lots of them to pass things back and fourth in our app... You really didn't give enough info, I assume you have viewmodels that are created for each of the views displayed in the region you mentioned. How are you opening the\r\n views? I think if I had a little more info I could be more helpful...&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks!</p>\r\n",
    "PostedDate": "2010-12-08T09:33:36.337-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "533030",
    "ThreadId": "237598",
    "Html": "\r\n<p>I ended up using events to manage this.&nbsp; Yes -- I have a view-model, I am following MVVM.&nbsp; I ended up using an event aggregtor in my view model.&nbsp; The view model is navigation aware and I am firing an event in the OnNavigatedTo event.</p>\r\n",
    "PostedDate": "2010-12-08T11:14:51.75-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "533211",
    "ThreadId": "237598",
    "Html": "\r\n<p>Yep - that is the way to go, you pass entire view models around in the app I am working on right now...</p>\r\n",
    "PostedDate": "2010-12-08T19:10:05.1-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]