[
  {
    "Id": "533099",
    "ThreadId": "237650",
    "Html": "\r\n<p>I apologize in advanced for the rookie question.</p>\r\n<p>&nbsp;</p>\r\n<p>I want to write a desktop application from the ground up.&nbsp; I know that I want feautures of the Enterprise Library.&nbsp; I also want to write the code for WPF.&nbsp; I dont want to dirty/confused my development machine with multiple libraries, if they\r\n are not going to be used.</p>\r\n<p>Should I install&nbsp;Enterprise Library, Prism, or both?</p>\r\n<p>For example, I know that I want Unity, but its already included with Prism.&nbsp; So, I am not sure if installing the Prism libraries will give me everything that I need (Prism &#43; Unity &#43; Ent Lib).</p>\r\n<p>Last but not least, I read about a product called The Box, that had everything needed to develop (sample project &#43; documentation).&nbsp; Could someone tell me where I can download that?</p>\r\n<p>Thanks in advance!</p>\r\n<p>&nbsp;</p>\r\n<p>Frank</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2010-12-08T13:32:52.21-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "533123",
    "ThreadId": "237650",
    "Html": "\r\n<p>Let me clarify a few things as I try to answer your questions:</p>\r\n<p>Unity is a dependency injection container.&nbsp; It is available by itself and included in a number of other\r\n<em>patterns &amp; practices</em> guidance projects.</p>\r\n<p>Prism is guidance for building rich, well-written, modular and composable apps in WPF or Silverlight.&nbsp; The guidance includes written documentation in the form of a guide/ebook, a library of code that may help others use the&nbsp;ideas taught in the\r\n guide in their own&nbsp;implementations, and sample code in the form of QuickStarts (showing one concept) and Reference Implementations (bringing together a number of concepts into an app that is based on a real world scenario). The Prism Library of re-usable\r\n code makes use of Unity, so it is included in the Prism install. Prism was built so&nbsp;developers can write a little bit of &quot;glue&quot; code and plug in any dependency injection container, so you are not constrained to only using Unity unless you want to.</p>\r\n<p>Enterprise Library is a set of guidance around cross-cutting concerns in application development like data access, logging, etc.&nbsp; It also uses Unity for dependency injection internally, so&nbsp;Unity is included in the install.</p>\r\n<p>Since EntLib and Prism provide guidance in different areas, I could see a lot of value in installing and using Prism, Enterprise Library, and the docs from Unity.</p>\r\n<p>As far as the &quot;In the Box&quot; training that Karl Shifflett published (<a href=\"http://karlshifflett.wordpress.com/2010/11/07/in-the-box-ndash-mvvm-training/\">http://karlshifflett.wordpress.com/2010/11/07/in-the-box-ndash-mvvm-training/</a>) and updated (<a href=\"http://karlshifflett.wordpress.com/2010/12/01/updated-in-the-box-mvvm-training/\">http://karlshifflett.wordpress.com/2010/12/01/updated-in-the-box-mvvm-training/</a>),\r\n it is a walkthrough of part of the guidance included inside of Prism. The currently available &quot;In the Box&quot; focuses on using MVVM and supplements the MVVM topics in the Prism written guide.</p>\r\n<p>Thanks,<br>\r\nMike</p>\r\n",
    "PostedDate": "2010-12-08T14:11:30.953-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "533142",
    "ThreadId": "237650",
    "Html": "\r\n<p>Amazing response, can't thank you enough.&nbsp; Exactly what I needed to hear.</p>\r\n<p>&nbsp;</p>\r\n<p>Frank</p>\r\n",
    "PostedDate": "2010-12-08T14:52:46.94-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]