[
  {
    "Id": "533832",
    "ThreadId": "237853",
    "Html": "\r\n<p>Can anybody provide some guidance on how best to show a busy inidcator (silverlight toolkit) from a button click on the UI. We have an ICommand exposed for a login screen and would like to display a busy indicator whilst the WCF service request happens.\r\n I see that&nbsp;I can show a confimation popup but all I need is a busy indicator?</p>\r\n<p>Ron Milne.</p>\r\n",
    "PostedDate": "2010-12-10T03:32:27.307-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "533849",
    "ThreadId": "237853",
    "Html": "\r\n<p>Hi Ron,</p>\r\n<p>In order to show a Busy Indicator you need to wrap your content inside the <strong>\r\nBusyIndicator </strong>control, and set its <strong>IsBusy </strong>property to true. Since the\r\n<strong>IsBusy </strong>property is a <a href=\"http://msdn.microsoft.com/en-us/library/cc221408%28VS.95%29.aspx\">\r\ndependency property</a>, you could bind its value to a property in your <strong>ViewModel\r\n</strong>that gets changed when your WCF service request happens. If the service reference is in another module, you could use the Event Aggregator to publish an event indicating that there is a service request going on, and another one indicating that it's\r\n over, for example.</p>\r\n<p>If you wish to use regions inside BusyIndicators, you might find <a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=213048\">\r\nthis thread</a> useful, in which there is a sample application showing that.</p>\r\n<p>For more information about specific functionality of the Busy Indicator control, you could check the\r\n<a href=\"http://forums.silverlight.net/forums/35.aspx\">Silverlight Controls and Silverlight Toolkit</a> section of the\r\n<a href=\"http://forums.silverlight.net/\">Silverlight forums</a>.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br>\r\n<a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>\r\n",
    "PostedDate": "2010-12-10T04:36:08.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]