[
  {
    "Id": "538182",
    "ThreadId": "238978",
    "Html": "\r\n<p>Hi,</p>\r\n<p>I'm new in Prism v4&nbsp; and I would like to know: is it poslible to create aplicaton that will actvate and execute commands in some of my modules without clicking on them.</p>\r\n<p>For example, if I have simple application that has one button, which when is pressed some message will be shown. Can I create application that when it's started I can see complete&nbsp; UI</p>\r\n<p>and then create new thread that will execute commands that I want to see working?</p>\r\n<p>Thanks,</p>\r\n<p>Drasko</p>\r\n",
    "PostedDate": "2010-12-20T02:18:09.18-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "538331",
    "ThreadId": "238978",
    "Html": "\r\n<p>Hi Drasko,</p>\r\n<p>I'm glad to see that you've started using Prism. The requirement that you're mentioning is possible. If by command you're referring generically to any kind of action, you can use for example the Event Aggregator, which provides a means to publish and subscribe\r\n to events from different loosely coupled components (for example, different modules that reside on a separate assembly). Using the Event Aggregator, there is an option to specify that you want to receive your event in a background thread. From the documentation,\r\n<em>&quot;<strong>BackgroundThread</strong>. Use this setting to asynchronously receive the event on a .NET Framework thread-pool thread.&quot;\r\n</em>You can read more about Event Aggregation (as well as other means of communication between loosely coupled components) in\r\n<a href=\"http://msdn.microsoft.com/en-us/library/ff921122%28PandP.40%29.aspx\">this chapter</a> from the Prism MSDN documentation.<em></em></p>\r\n<p>If you specifically mean that you need to execute an <strong>ICommand</strong> (such as a\r\n<strong>RoutedCommand</strong>, a<strong> DelegateCommand</strong> or a <strong>CompositeCommand</strong>) responding to an action that isn't clicking a button, you might find one of following articles useful:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=235002\"><span>custom command on a System.Windows.Shapes.Ellipse</span></a>\r\n</li><li><a href=\"http://msdn.microsoft.com/en-us/library/ms753300.aspx\">How to: Hook Up a Command to a Control with No Command Support</a>\r\n</li><li><a href=\"http://msdn.microsoft.com/en-us/library/ms750591.aspx\">How to: Hook Up a Command to a Control with Command Support</a>\r\n</li><li><a href=\"http://msdn.microsoft.com/en-us/library/ms752308.aspx\">Commanding Overview</a>\r\n</li></ul>\r\n<p>You can also read more about commanding in Prism v4 in <a href=\"http://msdn.microsoft.com/en-us/library/ff921122%28PandP.40%29.aspx\">\r\nthe aforementioned chapter</a> from the MSDN documentation.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br>\r\n<a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>\r\n",
    "PostedDate": "2010-12-20T08:51:04.59-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]