[
  {
    "Id": "542657",
    "ThreadId": "240144",
    "Html": "\r\n<p>Hello and happy new year,</p>\r\n<p>&nbsp;</p>\r\n<p>I am new to Prism and have been reading the documentation about the many features. It is fascinating how many problems I had in the past are addressed here.</p>\r\n<p>One thing that I still am missing and had many problems in the past are states of models and how to update them back into the database. I am not sure if Prism solves this problem and I am 95% through all documentation without having found any&nbsp;reference&nbsp;to\r\n it.</p>\r\n<p>Lets assume I would like to use Entity Framework 4 to connect to my Database. &nbsp;Within my DAL layer I would have to convert the data from EF4 entities into my models (MVVM) correct?</p>\r\n<p>But once a model (representing a row in in a table) has been deleted, modified or inserted, how do I write these changes back to EF4 DAL layer? &nbsp;</p>\r\n<p>Or<br>\r\n<br>\r\nUnless I should treat my EF4 entities as models and I am meant to build my ViewModels around EF4 Entities directly, which would then track the changes all the time.</p>\r\n<p>I would appreciate it if you could advice me on this regarding a good strategy,</p>\r\n<p>Regards</p>\r\n",
    "PostedDate": "2011-01-01T03:51:37.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "543223",
    "ThreadId": "240144",
    "Html": "\r\n<p>Hi,</p>\r\n<p>I'm glad you've found Prism useful to address your problems. As for the requirement you're mentioning, you might find\r\n<a href=\"http://www.silverlight.net/getstarted/riaservices/\">WCF RIA Services</a> useful.</p>\r\n<p>From the description in the site above, <em>&quot;Microsoft WCF RIA Services simplifies the traditional n-tier application pattern by bringing together the ASP.NET and Silverlight platforms. RIA Services provides a pattern to write application logic that runs\r\n on the mid-tier and controls access to data for queries, changes and custom operations. It also provides end-to-end support for common tasks such as data validation, authentication and roles by integrating with Silverlight components on the client and ASP.NET\r\n on the mid-tier.&quot;</em></p>\r\n<p>Additionally, if you have any problem specifically related to WCF RIA Services, you might find support in its\r\n<a href=\"http://forums.silverlight.net/forums/53.aspx\">forum</a>.</p>\r\n<p>I hope you find this helfpul.</p>\r\n<p>Guido Leandro Maliandi<br>\r\n<a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>\r\n",
    "PostedDate": "2011-01-03T08:03:07.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]