[
  {
    "Id": "551503",
    "ThreadId": "242307",
    "Html": "\r\n<p>Does anyone have the quickstarts totally in WPF?</p>\r\n<p>I am new to this and only working in the WPF environment.&nbsp; Having to convert from Silverlight may seem easy to those who are familiar with both, but it is a major obstacle for me.&nbsp; All tutorial style presentations should encompass both VB and C#\r\n and the silverlight and wpf differences.&nbsp; Trying to understand the concepts being presented and also having to deal with converting is a major problem when I am just trying to find out if some of my concepts are even doable using the Prism environment\r\n and WPF.&nbsp; Coming from another language environment after 15 years, it takes some time for the new&nbsp;concepts to be clear, and having to translate it on top of that gets to be too much!</p>\r\n<p>Brian</p>\r\n",
    "PostedDate": "2011-01-18T13:37:41.763-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "551928",
    "ThreadId": "242307",
    "Html": "\r\n<p>Hi Brian,</p>\r\n<p>You might find the <a href=\"http://www.microsoft.com/downloads/en/details.aspx?FamilyID=bd727f0f-a52d-4503-b006-a91c375b9241&displaylang=en\">\r\nPrism 4 Visual Basic version</a> useful to tighten your learning curve of Prism's capabilities.</p>\r\n<p>As for the WPF and Silverlight versions for all the QuickStarts, you could add that as a work item in the Issue Tracker, so that it is considered for future versions. However, taking into account the\r\n<a href=\"http://msdn.microsoft.com/en-us/library/cc917841%28VS.95%29.aspx\">differences between WPF and Silverlight</a>, the migration should be straightforward, especially because Silverlight is considered to be a subset of the .NET framework, so things supported\r\n in Silverlight are likely to be supported in WPF. In order to learn more about this, you might find the\r\n<a href=\"http://msdn.microsoft.com/en-us/library/ff921176%28PandP.40%29.aspx\">Multi-Targeting QuickStart</a> useful. Additionally, you might the following Codeplex Project useful:</p>\r\n<p><a href=\"http://wpfslguidance.codeplex.com/\"><span id=\"x_ctl00_ctl00_MasterContent_ProjectTitleControl1_TitleLabel\">Guidance on Differences Between WPF and Silverlight</span></a></p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br>\r\n<a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>\r\n",
    "PostedDate": "2011-01-19T06:36:40.31-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]