[
  {
    "Id": "562125",
    "ThreadId": "245014",
    "Html": "\r\n<p>Our development team recently&nbsp;switched from a XP(x86) boxes over to Win 7(64bit) boxes and this is when&nbsp;we noticed the issue.</p>\r\n<p>When running a build on the new Win 7 machines the app loads the shell and everythings ok at that point. When prism tries to download modules is when we recieve the white screen.</p>\r\n<p>With the following error:</p>\r\n<p><span style=\"color:#ff0000\">Failed to load type for module X.</span></p>\r\n<p><span style=\"color:#ff0000\">If this error occurred when using MEF in a Silverlight application, please ensure that the CopyLocal property of the reference to the MefExtensions assembly is set to true in the main application/shell and false in all other assemblies.</span></p>\r\n<p><span style=\"color:#ff0000\">Error was: The remote server returned an error: NotFound..</span></p>\r\n<p>We are not using MEF and have none of the MEF assemblies installed.</p>\r\n<p>We have&nbsp;also tried running the Quick-Start ModularityWithUnity app and have the same issue on the Win7 machines and runs great on the old XP machines....</p>\r\n<p>Has anyone else had an issue like this? Is there a setting in VS that we're missing?</p>\r\n<p>Thanks</p>\r\n<p>Rob</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-07T11:04:55.403-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "562675",
    "ThreadId": "245014",
    "Html": "\r\n<div id=\"x_ctl00_ctl00_MasterContent_Content_PostRepeater_ctl02_BodyDiv\">\r\n<p>Hi Rob,</p>\r\n<p>All Prism&acute;s QuickStarts have been tested in Windows XP, Vista and Windows 7. Both 32bit and 64bit versions.</p>\r\n<p>You could check if you have another kind of problem, just by&nbsp;creating a simple Silverlight OOB application (in VS, File -&gt;&nbsp;New Project -&gt; Silverlight Application)&nbsp;and try to run it in both configurations.</p>\r\n<p>If you are experiencing the same problems, you can check this issue on <a href=\"http://forums.silverlight.net/\">\r\nSilverlight Forum</a>, since is not directly related to Prism.</p>\r\n<p>Thanks,</p>\r\n<p>Miguel Bronzovic<br>\r\n<a href=\"http://blogs.southworks.net/mbronzovic\">http://blogs.southworks.net/mbronzovic</a></p>\r\n<p>&nbsp;</p>\r\n</div>\r\n",
    "PostedDate": "2011-02-08T07:19:27.4-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "563158",
    "ThreadId": "245014",
    "Html": "\r\n<p>From my very short experience with Prism i found that most exceptions which&nbsp;are not&nbsp;necessarily&nbsp;related to loading moudle result in such message</p>\r\n<p>Also i found that if the web project is not the startup project i get this message as well</p>\r\n<p>I am running Prism samples on windows 7 32 bit without any problems</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-09T00:59:55.63-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "563328",
    "ThreadId": "245014",
    "Html": "\r\n<p>Yes, the main silverlight project is set as the start-up project and Yes, I have seen this error occur when it's been related to other issues.</p>\r\n<p>It's the fact that when I download the Quick-Start project and run on Win 7 x64 machine and I&nbsp;receive the error and then copy the exact same files over to the XP x86 machine and it runs perfectly that has me confused. It leaves me thinking that were\r\n missing a setting in Visual Studio.&nbsp;&nbsp;</p>\r\n",
    "PostedDate": "2011-02-09T06:55:27.643-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]