[
  {
    "Id": "563098",
    "ThreadId": "245223",
    "Html": "\r\n<p>Hi All,<br>\r\nI have to build application which you can think is very much similar to Outlook. However I need to dynamically add / remove modules without making code changes. I should be able to do this with few configuration changes and new module is plugged into application.\r\n Say for instance in Outlook today I have only Mail and Calendar module. Now I want to add Contact module which is developed seperately. All I want is to copy the XAP in client bin and make some configuration changes and application show be up and running with\r\n Contacts module added in left panel.</p>\r\n<p>As of now to achieve above I have to make changes in ModuleCatalog.xaml and add region in Shell. With this I have to build and deploy complete app for every plug and unplug of module.\r\n<br>\r\nFor dynamically adding module, I should be able to read the some configuration and&nbsp;based on number of modules I will add regions dynamically in my left panel. Right panel will have only Main Region to display module specific views.</p>\r\n<p>Please let me know if this is achievable.</p>\r\n<p>Regards,<br>\r\nAbhilash</p>\r\n",
    "PostedDate": "2011-02-08T22:47:34.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "563341",
    "ThreadId": "245223",
    "Html": "\r\n<p>Hi Abhilash,</p>\r\n<p>Based on my understanding of your scenario, you could achieve this functionality using Regions and Modules loaded on demand to satisfy your configuration settings. You can read about these features in the following links:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg405479(v=PandP.40).aspx\">Chapter 4: Modular Application Development</a> (also you can check the\r\n<a href=\"http://msdn.microsoft.com/en-us/library/ff921163(v=PandP.40).aspx\">Modularity QuickStart for Silverlight</a>)\r\n</li><li><a href=\"http://msdn.microsoft.com/en-us/library/ff921098(v=PandP.40).aspx\">Chapter 7: Composing the User Inteface</a>\r\n</li></ul>\r\n<p>Additionally, regarding the rebuild and deploy every time you add or delete a module from your application, as Prism documentation shows: &ldquo;<em>Silverlight does\r\n<strong>not support using configuration files</strong>. If you want to use a configuration-style approach for Silverlight, the recommended approach is to\r\n<strong>create your own ModuleCatalog</strong> that reads the module configuration from a web service on the server</em>&rdquo;. You can read\r\n<a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=48265\">this thread</a> where a similar approach is covered.</p>\r\n<p>I hope you find this information useful.</p>\r\n<p>Thanks,</p>\r\n<p>Miguel Bronzovic<br>\r\n<a href=\"http://blogs.southworks.net/mbronzovic\">http://blogs.southworks.net/mbronzovic</a></p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-02-09T07:33:29.163-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]