[
  {
    "Id": "572082",
    "ThreadId": "247558",
    "Html": "\r\n<p>Hi</p>\r\n<p>I'm in the beginning of creating my first Silverlight application with PRISM&nbsp;and want to know how I should structure my code. The problemdomain is how to add data to my PRISM application from multiple services and how to create client-side proxies to\r\n do the calls?</p>\r\n<p>I have looked at the reference applications but I can't see any good solution for calling real-world web services there. Am I wrong?</p>\r\n<p>Well, I have read that it is bad practice to use &quot;Add Service Reference&quot; and create the proxy that way. I like the idea of creating my own proxy-classes based on the ClientBase&lt;T&gt; class and so on, because it gives me full controll over the code. I\r\n would also like to create a infrastrucure module that provide all the modules with a service reference. Does anyone think the same and have some code snippets to show me how you have solved it? Is this the right way of thinking?</p>\r\n<p>I have a WCF service that gives me access&nbsp;to the business logic. The service has multiple endpoints (Customers, Products, Suppliers etc), I may as well let each module (Customers, Suppliers) to have their own service reference because each module will\r\n only need one of the endpoints available from the service. But then again, I would like to create my own proxies and not use the &quot;Add Service Reference&quot;, is this a weired requirement from me? Is &quot;Add Service Reference&quot; an acceptable way of doing it? WCF-guru\r\n Juval Lowy&nbsp;does not think so!!.... ;-)</p>\r\n<p>I want to do the right decisions as early as possible in the project lifetime in order to use the PRISM framework for what it's worth.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks in advance!</p>\r\n",
    "PostedDate": "2011-02-25T05:08:34.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "572135",
    "ThreadId": "247558",
    "Html": "<p>Hi,</p>\r\n<p>There is no guidance in Prism regarding how to call web services. However, you might find the following threads useful, as they deal with a similar concern:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=243611\"><span>simple wcf in prismv4</span></a></li>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=241013\"><span>How to create the optimal infrastructure?</span></a></li>\r\n<li><a href=\"http://compositewpf.codeplex.com/discussions/245929\"><span>WCF service call Async</span></a></li>\r\n</ul>\r\n<p>As for whether to use \"Add Service Reference\" for the proxy, you might find better support in the <a href=\"http://social.msdn.microsoft.com/Forums/en/wcf/threads/\">WCF Forum</a>.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-02-25T07:10:40.277-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]