[
  {
    "Id": "572457",
    "ThreadId": "247655",
    "Html": "\r\n<p>I am working on a Silverlight application that uses Prism 4 and MEF. I need to call a web service during application startup to get some lookup and configuration data? What's the recommended location for making this call? I was thinking either some method\r\n of the&nbsp;MefBootstrapper or inside&nbsp;Application_Startup( ) (after the bootstrapper has run completely).</p>\r\n",
    "PostedDate": "2011-02-25T22:23:11.723-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "573365",
    "ThreadId": "247655",
    "Html": "<p>Hi,</p>\r\n<p>There is no guidance in Prism regarding how or when to call web services. However you could place your services in a module and add it to the catalog.</p>\r\n<p>In this module, when you have finished loading your data asynchronously you could use the <strong>Module Manager</strong> to load another module or for example publish an event using the <strong>Event Aggreagator</strong> in order to communicate with other modules to perform necessary operations accordingly.</p>\r\n<p>Additionally, you might find this thread handy in order to achieve your requirement:</p>\r\n<p><a href=\"http://compositewpf.codeplex.com/discussions/247558\">Best practice when calling services via proxy</a></p>\r\n<p>I hope you find this information useful.</p>\r\n<p>Thanks,</p>\r\n<p>Miguel Bronzovic<br /><a href=\"http://blogs.southworks.net/mbronzovic\">http://blogs.southworks.net/mbronzovic</a></p>",
    "PostedDate": "2011-02-28T10:09:55.587-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "573618",
    "ThreadId": "247655",
    "Html": "<p>Thanks Miguel - this is very helpful. My web service happened to be in an infrastructure project and not in a module. However, based on your suggestion, I called it from the&nbsp;module that depended on it (during its initialization). So everything is working well now.</p>\r\n<p>Thanks again!</p>\r\n<p>Naresh</p>",
    "PostedDate": "2011-02-28T18:00:58.73-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]