[
  {
    "Id": "581533",
    "ThreadId": "249974",
    "Html": "\r\n<p>Prism documentation uses the term service often, which is a pretty general term.&nbsp; From the Prism examples a service seems to most often provide an interface to the Model Class.&nbsp; In this case the Model itself becomes nothing more than a class to\r\n hold the data and the service does all the data access and validation.&nbsp; In a general sense I think of a service as any functionality (methods) exposed externally through an interface.<br>\r\n<br>\r\n<span style=\"text-decoration:underline\">Questions:</span><br>\r\n1) When should I employ a service to access the Data instead of just using the Model within the MVVM pattern?<br>\r\n<br>\r\n2)&nbsp; What is a good definition for a service in the Prism world?&nbsp; I am looking for a deterministic way to determine when I should create a service.<br>\r\n<br>\r\nThanks,<br>\r\naidesigner</p>\r\n",
    "PostedDate": "2011-03-16T09:58:58.533-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "581653",
    "ThreadId": "249974",
    "Html": "<p>Hi,</p>\r\n<p>From the description of the Model class in the <a href=\"http://msdn.microsoft.com/en-us/library/gg405484%28PandP.40%29.aspx\">MVVM chapter</a> of the Prism MSDN documentation:</p>\r\n<p><em>\"The model in the MVVM pattern encapsulates business logic and data.  Business logic is defined as any application logic that is concerned  with the retrieval and management of application data and for making  sure that any business rules that ensure data consistency and validity  are imposed. To maximize re-use opportunities, models should not contain  any use case&ndash;specific or user task&ndash;specific behavior or application  logic.\"</em></p>\r\n<p>Therefore, if you need to expose certain functionality or use case that would be consumed from other components under a certain interface, you could encapsulate it into a service. Prism provides the means to share that service (you can read more about it in the <strong>Shared Services</strong> section inside the <a href=\"http://msdn.microsoft.com/en-us/library/ff921122%28PandP.40%29.aspx\">Communication chapter</a> of the Prism MSDN documentation) across different modules. The decision on whether to use a service or not depends on your requirements and preference for the architecture of your application.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-03-16T12:38:06.64-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]