[
  {
    "Id": "584623",
    "ThreadId": "250752",
    "Html": "\r\n<p>&#65279;&#65279;&#65279;&#65279;&#65279;When using the Manifest Manager Utility to add DLLs to the application manifest and then resign the application manifest, how do you eliminate the risk of version update problems caused when a user launches the application before the Manifest Manager\r\n step is completed?&nbsp; In Visual Studio I'm using the ClickOnce automatic update option, the application is available offline,&nbsp;and the application is being pubished to a file share.&nbsp; Would it be safest to temporarily restrict permissions on the\r\n file share until the publish is completed?</p>\r\n",
    "PostedDate": "2011-03-22T14:07:06.603-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "585170",
    "ThreadId": "250752",
    "Html": "<p>Hi,</p>\r\n<p>Since this topic is not strictly related to Prism, you might find better support in the <a href=\"http://social.msdn.microsoft.com/Forums/en-US/winformssetup/threads\">ClickOnce Setup &amp; Deploy Projects</a> forum.</p>\r\n<p>Thanks,</p>\r\n<p>Miguel Bronzovic<br /><a href=\"http://blogs.southworks.net/mbronzovic\">http://blogs.southworks.net/mbronzovic</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-03-23T10:22:48.743-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "585301",
    "ThreadId": "250752",
    "Html": "<p>Prior to posting here, I posted in the <a title=\"ClickOnce and Setup &amp; Deployment Projects\" href=\"http://social.msdn.microsoft.com/Forums/en-US/winformssetup/threads\">ClickOnce Setup &amp; Deploy Projects </a>forum.</p>\r\n<p>In that forum RobinDotNet has provided an answer.&nbsp; The solution is to publish to a work&nbsp;directory structure&nbsp;(i.e. not the deployment file share).&nbsp; When you're done using the Manifest Manager Utility, copy the ﻿﻿﻿﻿﻿version folder (yourapp_x_y_b) to the \"Application Files\" folder in the target directory structure (in my case the file share).&nbsp; Then copy the deployment manifest (.application) and setup.exe in the top folder to the top folder in the target directory (root folder of file share).</p>",
    "PostedDate": "2011-03-23T14:15:28.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]