[
  {
    "Id": "585375",
    "ThreadId": "250936",
    "Html": "\r\n<p>Hi, it's said in the documentation that it's possible to use regions navigation mechanism to navigate to ViewModels. But how it can be implemented in practice?</p>\r\n",
    "PostedDate": "2011-03-23T16:33:57.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "586001",
    "ThreadId": "250936",
    "Html": "<p>The only way I currently see is to implement INavigationAware for a ViewModel, and when I call RequestNavigate method for this ViewModel, I can handle incoming request in OnNavigatedTo method and using injected IRegionManager explicitly set appropriate view for neccessary region. But it looks like just a way to publish a navigation event and to do all the work manually. In this case the benefit from region navigation mechanism is minimal.</p>",
    "PostedDate": "2011-03-24T13:14:40.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "587601",
    "ThreadId": "250936",
    "Html": "<p>Hi,</p>\r\n<p>Navigation to a ViewModel can be useful when using the ViewModel-First approach in the MVVM pattern defining the View as a DataTemplate of the ViewModel.</p>\r\n<p>The following note in the <a href=\"http://msdn.microsoft.com/en-us/library/gg430861%28PandP.40%29.aspx\">Navigation Chapter</a> from the Prism MSDN documentation might clarify the aforementioned:</p>\r\n<p><em>\"The preceding description illustrates view-first navigation, where the  URI refers to the name of the view type, as it is exported or registered  with the container. With view-first navigation, the dependent view  model is created as a dependency of the view. An alternative approach is  to use view model&ndash;first navigation, where the navigation URI refers to  the name of the view model type, as it is exported or registered with  the container. View model&ndash;first navigation is useful when the view is  defined as a data template, or when you want your navigation scheme to  be defined independently of the views.\"</em></p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-03-28T07:35:03.943-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "588702",
    "ThreadId": "250936",
    "Html": "<p>Hi Guido,</p>\r\n<p>Thanks for reply. I've read documentation and it was actually original cause of the question ). The main question I try to find out now is how to show View if I navigate to ViewModel.</p>",
    "PostedDate": "2011-03-30T03:04:39.727-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "588830",
    "ThreadId": "250936",
    "Html": "<p>Hi,</p>\r\n<p>You might find an example of how to define a DataTemplate to specify how you wish to render your ViewModel in the UI in the <a href=\"http://msdn.microsoft.com/en-us/library/gg430869%28PandP.40%29.aspx#DataTemplates\">MVVM QuickStart</a>. You'll find more information regarding that in the section titled \"Data Templates\" in the MVVM QuickStart's article.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-03-30T07:12:24.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]