[
  {
    "Id": "596711",
    "ThreadId": "253751",
    "Html": "\r\n<p>Basically I'm stuck in the following scenario:</p>\r\n<p>Shell.xaml, UserControl1.xaml, UserControl2.xaml, UserControl3.xaml (each has their own ViewModel which is extended from NotificationObject).</p>\r\n<p>&nbsp;</p>\r\n<p>My ShellViewModel needs to be able to manage the TabControl and load in not only TabItems, but also the content that goes inside the TabItem as one of the UserControls, which need to be wired up to their corresponding ViewModels. I'm running into some issues\r\n and I'm not sure how to wire this up appropriately following MVVM.</p>\r\n<p>I'm using MEF, so I figure that should help me import/export. I'm not sure if this helps or not. Any advice as to how to accomplish this would be great.</p>\r\n<p>&nbsp;</p>\r\n<p>One big decision is my ObservableCollection I have bound to the TabControl, should it be a collection of ViewModels or TabItems?</p>\r\n",
    "PostedDate": "2011-04-13T10:36:03.183-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "596746",
    "ThreadId": "253751",
    "Html": "<p>Hi,</p>\r\n<p>Your TabControl could be a Region, and then you could add your items as views of that region. You could add the ViewModels, for example using Region Navigation, and define the view as the DataTemplate for that ViewModel, or you could add the View and wire up the ViewModel to the View by using for example the Import attribute and assigning the ViewModel as the View's DataContext.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-04-13T11:34:24.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "907274",
    "ThreadId": "253751",
    "Html": "<p>Hi,&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>Can you please show an example? this is exactly my problem too. I'm fairly new and am quite desperate to know how to achieve this</p>\r\n<p><a href=\"http://compositewpf.codeplex.com/discussions/394045\">http://compositewpf.codeplex.com/discussions/394045</a></p>",
    "PostedDate": "2012-09-01T06:25:15.02-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]