[
  {
    "Id": "598408",
    "ThreadId": "254175",
    "Html": "<p>Hi - Two issues.</p>\n<p>1. The walkthrough doc says \"Make sure that the BasicMVVMApp.<strong>Web </strong> project is set as the Startup project.\".</p>\n<p>When this is true, all I get is the folder listing in the browser window when I start the project in the debugger. But if I set the <strong>BasicMVVMApp </strong>project as the startup project, at least I get the main window to show up. Is the doc wrong (the most obvious assumption), or do I need to set some magic setting somewhere that I'm just supposed to know?&nbsp; I am not a Silverlight  expert. I have studied WPF and done several small desktop apps though.</p>\n<p>2. The app apparently runs correctly, since the color name changes color based on selection in the list box, but also the debugger will not hit any breakpoints even when I enable Silverlight Debugging, and no output shows up in the Output Window, even if  I have the debugging option to show output turned on.</p>\n<p>I'm using:</p>\n<p>Win 7</p>\n<p>Microsoft Visual Studio 2010 Premium<br /> Version 10.0.40219.1 SP1Rel<br /> Microsoft .NET Framework<br /> Version 4.0.30319 SP1Rel</p>\n<p>Firefox latest version. I don't use IE if I can help it.</p>\n<p>Thanks for any ideas...</p>\n<p>Dave</p>\n<p>======================================== 4 hours later...</p>\n<p>Well, well. Isn't this interesting. Find anOTHER page where it says to set the startup OBJECT to the html page.</p>\n<p>Scratch 1.</p>\n<p>Set IE as the default browser, and LO AND BEHOLD - the debugger starts working. Isn't that interesting. The VS Attach Process dialog box doesn't LOOK any different, except for the browser name, but... obviously it is. Same Silverlight control, same html page, same xap, same managed code, no tweaks to IE or Firefox in any way... but it won't work unless you use IE.</p>\n<p>Scratch 2.</p>\n<p>And thanks for nuthin.</p>\n<p>&nbsp;</p>",
    "PostedDate": "2011-04-16T08:11:21.84-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]