[
  {
    "Id": "628806",
    "ThreadId": "261672",
    "Html": "<p>I have Prism 4 - WPF 4. application that loads two modules using MefBootStrapper. The shell has two regions and I want the modules to load into the two regions. As in Module1 into Region1 and Module2 into Region2. This application is based off the Modularity  Quickstart sample application, where the ModuleTracker tracks the progress of the application.</p>\n<p>The application loads fine if I load just one module. Either of the modules work fine. However I get compostion errors when I try to load both the modules.</p>\n<p>I tried mefx to debug the problem but it does not come up with anything useful.</p>\n<p>Any ideas?</p>",
    "PostedDate": "2011-06-16T10:10:48.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "628921",
    "ThreadId": "261672",
    "Html": "<p>Hi,</p>\r\n<p>Take into account that you load views into regions not modules.</p>\r\n<p>On the other hand, you might find handy the following Prism&rsquo;s documentation chapters:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg430868(PandP.40).aspx\">Chapter 2: Initializing Prism Applications</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921140(PandP.40).aspx\">Chapter 3: Managing Dependencies Between Components</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg405479(PandP.40).aspx\">Chapter 4: Modular Application Development</a></li>\r\n</ul>\r\n<p>Additionally you can follow the <a href=\"http://msdn.microsoft.com/en-us/library/ff921068(PandP.40).aspx#sec3\">Modularity QuickStart for WPF Walkthrough</a> in order to perform the steps required to build the application.</p>\r\n<p>Also, it could be helpful if you could provide us with your repro sample (for example, uploading to <a href=\"http://skydrive.live.com/\">SkyDrive</a>) of your solution, so that we can help you find out the cause of the unexpected behavior you're experiencing.</p>\r\n<p>I hope you find this information useful.</p>\r\n<p>Thanks,</p>\r\n<p>Miguel Bronzovic<br /><a href=\"http://blogs.southworks.net/mbronzovic\">http://blogs.southworks.net/mbronzovic</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-06-16T14:06:14.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "629383",
    "ThreadId": "261672",
    "Html": "<p>Unfortunately I cannot use SkyDrive from work. Its restricted. I think I will just have to deconstruct the project to see what the problem is. The design is based off the Modularity Quickstart application.</p>\r\n<p>Any good debugging tools besides mefx? That anyone can suggest.</p>",
    "PostedDate": "2011-06-17T11:59:19.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]