[
  {
    "Id": "633308",
    "ThreadId": "262872",
    "Html": "\r\n<p>Hi,</p>\r\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; I am new to prism 4 and would like to know that does prism 4 supports third party user controls like telerik or I have to ask control vendor regarding the support?</p>\r\n<p>Nilkanth Desai</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2011-06-26T19:23:16.62-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "633651",
    "ThreadId": "262872",
    "Html": "<p>Hi,</p>\r\n<p>Any User control be that custom or third party is supported by PRISM.&nbsp; Sometimes you may have to create your own region adaptor(s) but those are relatively simple to create.&nbsp; Telerik has examples on their user forums creating Ribbon Tool bars etc.&nbsp;</p>",
    "PostedDate": "2011-06-27T11:02:42.633-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "633652",
    "ThreadId": "262872",
    "Html": "<p>Hi Nilkanth,</p>\r\n<p>Prism provides guidance to help you more <strong>build and design rich WPF and Silverlight Internet applications</strong>. Using design patterns that embody important architectural design principles, such as separation of concerns and loose coupling, it helps you to design and build applications referred to as <strong>Composite Applications</strong>.</p>\r\n<p>On the other hand, Prism is not tied to any particular suit of controls, because it is target to create solutions focused on designs and patterns and not tied to any UI solution. Therefore, you could use any kind of third-party user controls. If you wish to integrate those controls with Prism, for example using a third party control as a region, the vendor of the specific control should create (for example) the custom region adapter.</p>\r\n<p>In the case of Telerik, there seems to be some support for integrating their controls with Prism, as evidenced by this blog post:</p>\r\n<p><a href=\"http://blogs.telerik.com/blogs/posts/09-08-31/using_the_raddocking_control_with_prism.aspx\">Using the RadDocking control with Prism</a></p>\r\n<p>You might find more information about that in the <a href=\"http://www.telerik.com/community/forums.aspx\">Telerik forums</a>.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-06-27T11:03:05.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]