[
  {
    "Id": "642732",
    "ThreadId": "265238",
    "Html": "\r\n<p>Hi, Im hoping you could help me with this problem.</p>\r\n<p>I have my shell with only one main region, nothing more... Then I have one module which I call LayoutModule, in this module I have a LayoutView that I place on the main region of my shell. This LayoutView defines 2 new regions NavigationRegion and ContentRegion.\r\n I place another 2 Views corresponding to the last regions mentioned, I have these views in the LayoutModule (NavigationView and BackgroundView). All these views are placed using View Discovery.&nbsp;</p>\r\n<p>I can't figure out how to place a view from a different module in the ContentRegion.</p>\r\n<p>I've tried RequestNavigate afterloading my background view on LAyoutModule, but it seems that contentRegion is not registered on the regionManager. The same problem when I use requestNAvigate on anotherModule trying to set a view from that module on the\r\n contentREgion</p>\r\n<p>I've read a lot of documentation, but I think I'm missing something.</p>\r\n<p>Could you point me in the right direction please.</p>\r\n<p>Thanks for your time...</p>\r\n",
    "PostedDate": "2011-07-14T19:51:55.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "643053",
    "ThreadId": "265238",
    "Html": "<p>Hi,</p>\r\n<p>The problem you're experiencing might be happening due to the fact that you're defining your content region inside a data template. That could cause your region not to be registered in the region manager, but still work when you use view discovery. Another possibility might be that you're placing that region in a control that does not have a parent in the visual tree (for example, placing it in a popup window, etc).</p>\r\n<p>You might find the following threads useful, as they provide more information about the scenarios I mentioned:<a id=\"ThreadTitleLink\" class=\"ThreadLink\" href=\"262237\"></a></p>\r\n<ul>\r\n<li><a id=\"ThreadTitleLink\" class=\"ThreadLink\" href=\"262237\">MEF &amp; WPF Region not found</a></li>\r\n<li><a id=\"ThreadTitleLink\" class=\"ThreadLink\" href=\"237203\">Region defined in a view is not added to RegionManger.Regions collection</a></li>\r\n</ul>\r\n<p>Additionally, you could check to see if you can add views using view discovery from other modules. This could be useful to confirm that the problem might be related to the former.</p>\r\n<p>If you continue experiencing these problems after following the suggestions described here and in the aforementioned threads, it would be helpful if you could provide us with a repro sample of your scenario, so that we can help you identify and solve your problem.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-07-15T10:54:25.487-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]