[
  {
    "Id": "643530",
    "ThreadId": "265488",
    "Html": "\r\n<p>I'm evaluating using PRISM for a new project and part of my research is determining if PRISM will have many of the services and features that I've come to depend on with CAB.&nbsp; One area I can't seem to find much information on is how to incorporate role-based\r\n security in a PRISM application.&nbsp; I found one thread which doesn't really address the issue to my satisfaction:<a href=\"http://compositewpf.codeplex.com/discussions/247854\"> http://compositewpf.codeplex.com/discussions/247854</a></p>\r\n<p>I require a more granular solution that simple module catalog level security, I need the type of control the Action Catalog provided.&nbsp; Can anyone comment if there is an equivalent in PRISM and if not... how are some of you handling role based security\r\n with your PRISM apps?</p>\r\n",
    "PostedDate": "2011-07-17T18:13:28.07-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "643665",
    "ThreadId": "265488",
    "Html": "<p>Hi,</p>\r\n<p>The subject of authentication and authorization isn't supported in Prism out of the box. Therefore, there is no equivalent of the action catalog in the Prism Library, nor there is guidance in the Prism assets that indicates how to achieve that.</p>\r\n<p>However, there should be no impediments for you to create a custom service of your own, that achieves similar functionality.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-07-18T05:35:23.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "647508",
    "ThreadId": "265488",
    "Html": "<p>Hi Guido,</p>\r\n<p>Thank you for the reply.&nbsp; I'm disappointed that there aren't existing solutions for the larger topic of authentication &amp; authorization.&nbsp; I'm curious, maybe you know; was this a conscious and planned decision to exclude an Action Catalog-like system in Prism?&nbsp; I would have thought P&amp;P would look at what worked in CAB (obviously I think action catalog was valuable - maybe most don't?) and roll it all into prism.&nbsp; Of course I understand they can't do EVERYTHING and maybe action catalog is one of the item that was chopped due to limited resources.&nbsp; Anyway, just kind of wondering why something so valuable (IMO) wasn't rolled in.</p>\r\n<p>Anyone else have any input?&nbsp; Did you all use action catalog?&nbsp; If not, what strategy or pattern did you employ to conditionally expose features based on the current user's permissions?</p>\r\n<p>Thanks,<br />Steve</p>",
    "PostedDate": "2011-07-25T21:32:52.403-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681470",
    "ThreadId": "265488",
    "Html": "<p>Steve,<br /> <br /> You might find the following blog post useful, which deals with authentication and role based authorization in Prism (using shared services):</p>\n<p><a href=\"http://blogs.southworks.net/gmaliandi/2011/10/authentication-and-role-based-authorization-in-prism-v4/\">Authentication and role based authorization in Prism v4</a></p>\n<p>Thanks,<br /> <br /> Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-10-07T13:00:50.463-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]