[
  {
    "Id": "643952",
    "ThreadId": "265625",
    "Html": "\r\n<p>Hi everyone,</p>\r\n<p>During the last couple of months I have been working on a constantly (intended that is...!) growing solution for a lob application. While discovering Prism as worthful, at the same time I have my doubts. Reason: when I copy, replay and learn from examples\r\n as provided on several forums and blogs, I allways end up with the obligation to download this and install that. Several versions, several concepts, different approaches and different techniques. With growing fear I see the moment of deployment coming... how\r\n will that ever perform once on the production machine? Will it ever run at all? Maintenance and sustainability once were key notions to choose Prism/MVVM...! But that was some time ago (four months!).</p>\r\n<p>Anyone experience with that? All I see is oversimplified mockups, but no real-world experience...</p>\r\n<p>Is my fear grounded?</p>\r\n<p>Best regards, Peter</p>\r\n",
    "PostedDate": "2011-07-18T13:55:11.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "644384",
    "ThreadId": "265625",
    "Html": "<p>Hi Peter,</p>\r\n<p>There is a chapter in the Prism MSDN documentation that goes through the concepts needed for deploying Prism applications:</p>\r\n<p><a href=\"http://msdn.microsoft.com/en-us/library/gg430856%28PandP.40%29.aspx\">Chapter 11: Deploying Prism Applications</a></p>\r\n<p>Prism is intended to help you, along other things, build more maintainable and modular applications. However, whether your application will perform well in production environments depends on your development efforts; Prism only provides the guidance to apply proven patterns for building well-architected solutions.</p>\r\n<p>Additionally, you might find the <a href=\"http://msdn.microsoft.com/en-us/library/ff921074%28PandP.40%29.aspx\">Stock Trader Reference Implementation</a> useful, as it portrays the use of Prism in a complex application, akin to a real-world LOB application.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-07-19T07:58:10.607-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "644423",
    "ThreadId": "265625",
    "Html": "<div>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">Hi Guido,</span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\"> </span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">Thanks fort his relevant and rapid response to my discussion item. Chapter 11 looks very useful indeed. </span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\"> </span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">I appreciate your reaction on the purpose of Prism and understand quite well what it&rsquo;s intention and limitation is. Nonetheless, I hope you (partly) must agree with me that it is easy to get lost  in all the examples, versions, concepts and practices there are out there. And explicit or implicit many of them appear to have adopted some add-on installed. That&rsquo;s what I was pointing out. And that&rsquo;s where my fear comes from.</span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\"> </span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">I am in the middle of studying the stocktrader example. It needed just a few changes in settings before it would compile for the first time. I don&rsquo;t remember which corrections precisely. I run VS2010  version 10.0.40219.1 SP1Rel on Windows 7 Ultimate N SP1 64bit OS. Prism 4 and everything of what I think is relevant is installed by now (I hope).</span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\"> </span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">Thank you,</span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">Best regards,</span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\"> </span></p>\n<p><span lang=\"EN-US\" style=\"font-size: 11pt;\">Peter Klein</span></p>\n</div>",
    "PostedDate": "2011-07-19T08:36:08.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]