[
  {
    "Id": "656814",
    "ThreadId": "268758",
    "Html": "<p>Recently I tried to install the prism application template from david hill and it gave a reply like this path could not be found</p>\n<p>I am using windows 7.. win zip&nbsp;<a href=\"http://blogs.msdn.com/b/dphill/archive/2010/03/25/prism-template-pack-for-visual-studio-2010.aspx\">http://blogs.msdn.com/b/dphill/archive/2010/03/25/prism-template-pack-for-visual-studio-2010.aspx</a></p>\n<p>The post said copy to the path mentioned in this article...How can this be done in winzip</p>\n<p>&nbsp;&nbsp;<a href=\"http://kb.winzip.com/kb/entry/82/\">http://kb.winzip.com/kb/entry/82/</a>&nbsp; Is this what I need to do in win zip? Please answer this question THank you...</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>",
    "PostedDate": "2011-08-11T13:38:44.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "657097",
    "ThreadId": "268758",
    "Html": "<p>Hi,</p>\r\n<p>This package should be treated as a Visual Studio Add in, so you should rename the file to .vsix extension and double click it. This is explained in David&acute;s hill blog:</p>\r\n<p>\"You can download the VSIX package <a href=\"http://dphill.members.winisp.net/Download/Prism.TemplatePack.RC.zip\" target=\"_blank\">here</a> &ndash; <strong><em>note that you will have to change the file extension from .zip to .vsix in order to install it</em></strong> &ndash;\"</p>\r\n<p>As this is not strictly related to Prism, you might find better support about this in the Visual Studio <a href=\"http://social.msdn.microsoft.com/Forums/en/category/visualstudio\">forum</a>.</p>\r\n<p>I hope you find this useful,</p>\r\n<p>Agust&iacute;n Rodriguez Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-08-12T05:49:47.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "658530",
    "ThreadId": "268758",
    "Html": "<p>I am have tried to do this multiple times and yet I&nbsp;repeat this no has has stepped up to the plate and helped me!!!</p>\n<p>This means explaining things in detail!!! Yes I have&nbsp;right to be mad because yes&nbsp;I have tried this multiple times!! yet no one wants to to explain even&nbsp;if this really simple. &nbsp;</p>\n<p>Yes This should be a part of the prism forum!!!!&nbsp;I am very very very &nbsp;disappointed in this forum!! I am mad!&nbsp; Because you</p>\n<p>agustin should have explained it in greater detail rather than brushing this off!!! Dont you want&nbsp;people to succeed??&nbsp;</p>\n<p>don't you want to help people? I would greatly appreciate any one's help on this matter...Thank you...</p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>",
    "PostedDate": "2011-08-15T13:51:08.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "658836",
    "ThreadId": "268758",
    "Html": "<p>Hi,</p>\r\n<p>I'm sorry to hear that our previous answer was not helpful for your problem. The Prism templates mentioned in David Hill's blog are packaged inside a <a href=\"http://msdn.microsoft.com/en-us/library/ff363239.aspx\">VSIX package</a>, which is a means of packaging content to be installed in the Visual Studio gallery. In case you are having problems installing a VSIX package, it's very likely that your problem is related to your visual studio installation.</p>\r\n<p>On the other hand, although the VSIX package is in fact a zip file with its extension changed, it not only contains the actual files that will be installed, but it also contains additional metadata such as the vsix manifest and the content types (i.e. the <strong>extension.vsixmanifest</strong> and <strong>[Content_types].xml</strong>, which are both xml files). Visual Studio probably uses this metadata to perform some operations that result in correctly installing the extension contained in the package; so extracting the files and manually copying them might not be enough to have the extension installed. You need to rename the <strong>Prism.TemplatePack.RC.zip</strong> file to <strong>Prism.TemplatePack.RC.vsix</strong> and double click it.</p>\r\n<p>Note that you need to have the \"<strong>Hide extensions for known file types</strong>\" box located in the <strong>View </strong>tab of the <strong>Folder Options</strong> in Windows 7 unchecked in order to see the extension of the files. You can read more about that in the following article:</p>\r\n<p><a href=\"http://windows.microsoft.com/en-CA/windows-vista/Show-or-hide-file-name-extensions\">Show or hide file name extensions</a></p>\r\n<p>So to summarize this, the steps for installing this are the following:</p>\r\n<p>1. Download the <strong>Prism.TemplatePack.RC.zip</strong> file from David Hill's blog.</p>\r\n<p>2. Rename it to <strong>Prism.TemplatePack.RC.vsix</strong>.</p>\r\n<p>3. Double click the <strong>Prism.TemplatePack.RC.vsix</strong> file, which will install the templates.</p>\r\n<p>Also, please note that you will need Visual Studio 2010 to be able to install a VSIX package.</p>\r\n<p>Based on the aforementioned considerations, the situation you're explaining here is related to a problem specific to Visual Studio, rather than a Prism related issue, and that's why we believe you will find better support in the <a href=\"http://social.msdn.microsoft.com/Forums/en/category/visualstudio\">Visual Studio forum</a>. There you will find a community dedicated to specific Visual Studio issues.</p>\r\n<p>If you have any further question which you believe is related to Prism, or if you're still unable to make this work after following the steps we mentioned, you could post it here along with the detailed steps you've taken, so that we help you find a solution to your problem.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-08-16T07:08:35.73-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "659058",
    "ThreadId": "268758",
    "Html": "<p>Guido,</p>\r\n<p>&nbsp;Thank you for replying,&nbsp;&nbsp; and for caring I still unfortunately am having multiple&nbsp;problems and their&nbsp;&nbsp;should be a much easier solution for people.</p>\r\n<p>Your directions were still &nbsp;not detailed enough for example there a number of templates to install both with unity and mef &nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n<p>The biggest error I seem to be getting C:users/computername/prismtemplate1.4 pack refers to a location unavailable</p>\r\n<p>I will voice my complaint to the vsix forum on msdn as well. I am sorry to get upset however&nbsp;when you install any templates</p>\r\n<p>the directions should be clearer than what they are</p>\r\n<p>&nbsp;c:\\users\\mycomputer name\\documents\\visual studio 2010\\Projects is where I normally set my projects</p>\r\n<p>Thank you....</p>\r\n<p>&nbsp;&nbsp;&nbsp;</p>\r\n<p>&nbsp;&nbsp;&nbsp;</p>",
    "PostedDate": "2011-08-16T13:32:03.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "659514",
    "ThreadId": "268758",
    "Html": "<p>Hi,</p>\r\n<p>From what I've seen, the templates that are present in the blog post you mentioned are using Unity. If you believe there should be more templates, you could create a work item in the <a href=\"http://compositewpf.codeplex.com/workitem/list/advanced\">issue tracker</a> describing your request.</p>\r\n<p>Have you followed the steps I've detailed in my previous answer?  Does the VSIX installation throw you that exception? In case you can't find a solution for this, it would be helpful if you could provide us with the exact steps you've followed and the error message you've experienced, so that we can help you further with this.</p>\r\n<p>Note that you don't need to manually place the templates in the folder where they should be, as the VSIX installation will do that automatically. Once installed, the templates should work regardless of where you place your projects.</p>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-08-17T09:56:15.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "659598",
    "ThreadId": "268758",
    "Html": "<p>Guido,</p>\n<p>You are a genius!!! Thank you so much!!! &nbsp;Mef unity prism templates installed!!! &nbsp;</p>\n<p>I am very happy.Thank you so much&nbsp; for your help!!! &nbsp;&nbsp;I tried to do exactly&nbsp;according to your directions. This time it&nbsp;worked.!!!&nbsp;&nbsp;<a href=\"http://blogs.msdn.com/b/dphill/archive/2011/03/04/prism-template-pack-1-4-now-with-mef-support.aspx\">http://blogs.msdn.com/b/dphill/archive/2011/03/04/prism-template-pack-1-4-now-with-mef-support.aspx</a></p>\n<p>This is what worked for me I followed your directions and on my computer I changed the&nbsp;name of the prism template</p>\n<p>to prismtemplate 1.4&nbsp; vsix and hit the open button&nbsp; One comment a popup warning&nbsp;-- gave a warning when you change this extension this may not work-I ignored that&nbsp; message &nbsp;&nbsp;and hit ok and it worked!! &nbsp;</p>\n<p>&nbsp;Thank you so much for your help!!!</p>\n<p>If anyone wants some more documentation I would be happy to provide directions</p>\n<p>By the way if I have any questions using unity&nbsp;for prism should I post this on the unity forum?? or can I use this forum</p>\n<p>I know you are big into mef...</p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>",
    "PostedDate": "2011-08-17T12:42:49.317-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "659988",
    "ThreadId": "268758",
    "Html": "<p>Hi,</p>\r\n<p>I'm glad you found our support helpful.</p>\r\n<p>If your questions are entirely related to Unity and do not have anything to do with Prism, you might obtain better support in the <a href=\"http://unity.codeplex.com/discussions?ProjectName=unity\">Unity forums</a>; but if your questions are about using Unity in a scenario that Prism covers, you could post them in the Prism forums.</p>\r\n<p>Thanks,</p>\r\n<p>Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-08-18T06:08:56.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]