[
  {
    "Id": "657425",
    "ThreadId": "268911",
    "Html": "<p>I am using Prism + MEF in a project with multiple XAP modules.</p>\n<p>In my bootstrapper i register a service in the ConfigureContainer method like so: this.Container.ComposeExportedValue&lt;IService&gt;(new MyService());</p>\n<p>Importing the service instance works fine in all my viewmodels that are part of a module.</p>\n<p>But when I try to import it in a project that is in a separate class library it is not found.</p>\n<p>Basically in some other class library, and a control in that class library. The control imports its viewmodel. This works. The viewmodel seems to be able to import some basic classes fine (like the IRegionManager and IModuleCatalog), but cannot satisfy my  IService. It is being imported the same way as in other module viewmodels and it works, just not in this class library.</p>\n<p>edit: actually it looks like none of the imported instances in the class library are the same. I just tried publishing an event from the imported EventAggregator and it was not caught by the subscriber like it is with other viewmodels in my modules.&nbsp;</p>\n<p>My concrete service is not marked with an [Export()] in this case, but I did try and the class library viewmodel did find it then, but its not the same configured instance I registered in the bootstrapper.</p>\n<p>So it seems like this class library is pulling from a different AggregateCatalog or something. Am I composing it wrong? Or leaving some step out?</p>",
    "PostedDate": "2011-08-12T13:50:32.94-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "658347",
    "ThreadId": "268911",
    "Html": "<p>Hi,</p>\r\n<p>It would be helpful if you could provide us with a repro sample  application that portrays your problem, so we can help you find the  cause and a possible workaround for your issue.</p>\r\n<p>Thanks,</p>\r\n<p>Agust&iacute;n Rodriguez Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-08-15T07:37:09.99-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]