[
  {
    "Id": "90460",
    "ThreadId": "27102",
    "Html": "\r\nThe reference implementations, quick starts, and spikes feature slightly different implementations of a Bootstrapper class to carry out application initialization duties. Will Prism eventually address bootstrapping as a first class concept, or will this responsibility forever lie with the applications themselves?<br />",
    "PostedDate": "2008-05-04T17:56:14.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90500",
    "ThreadId": "27102",
    "Html": "\r\nDo you mean will we have a reusable bootstrapper? <br /><br />Yes the bootstrapper is different in the quickstarts. We did this because in quickstarts we want you to focus on a specific topic and not have to grok too many concepts, hence quick. We will be pointing this out in our docs. The implementaiton we use in the RI is the recommended approach.<br /><br />Thanks<br />Glenn<br />",
    "PostedDate": "2008-05-05T00:45:46.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "90524",
    "ThreadId": "27102",
    "Html": "\r\nYes, my question is whether the Prism team will eventually create a reusable bootstrapper. Even in the various ramp-up projects, the Bootstrapper classes are more similar than dissimilar.<br /><br />At the core of my question is whether my team should try to solve the bootstrapping problem for our application set or if we should first wait for guidance from the Prism team. And at the core of <b>that</b> question is what the Prism team considers to be in scope,<br /><br />Sorry if I'm jumping the gun a bit here. I'm just very excited with this effort and eager to apply it.<br /><br /><br />",
    "PostedDate": "2008-05-05T05:58:01.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "91148",
    "ThreadId": "27102",
    "Html": "\r\nWe are looking into a Boostrapper template (abstract base class) for this.<br /><br />Thanks for the suggestion.<br />",
    "PostedDate": "2008-05-08T00:20:25.21-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]