[
  {
    "Id": "672790",
    "ThreadId": "272855",
    "Html": "<p>Hi,</p>\n<p>I have a shell which contains single region that used to load different views. So I need to remove the current view so the memory can be released and I can load a different view. Since this is a hosted class library I want to do the remove when the shell is closed. So in my Shell.xam.cs, I call \"RemoveViews\" on Shell_Closing:</p>\n<div style=\"background-color: white; color: black;\">\n<pre> <span style=\"color: blue;\">private</span> <span style=\"color: blue;\">void</span> RemoveViews()\r\n {\r\n       _region = _regionManager.Regions[<span style=\"color: #a31515;\">\"MainRegion\"</span>];\r\n        <span style=\"color: blue;\">if</span> (_region != <span style=\"color: blue;\">null</span>)\r\n            {\r\n                <span style=\"color: blue;\">foreach</span> (<span style=\"color: blue;\">object</span> view <span style=\"color: blue;\">in</span> _region.Views)\r\n                {\r\n                    _region.Remove(view);\r\n                }\r\n            }         \r\n}\r\n</pre>\n</div>\n<p>The line \"_region.Remove(view)\" will throw error \"The region does not contain the specified view.\", even \"view\" is returning my view type (ModuleAView)&nbsp;correctly, in this case the view is my ModuleAView which&nbsp;decorate with&nbsp;<span style=\"font-family: Consolas; font-size: x-small;\"><span style=\"font-family: Consolas; font-size: x-small;\"><span style=\"font-family: Consolas; font-size: x-small;\">[<span style=\"font-family: Consolas; color: #2b91af; font-size: x-small;\"><span style=\"font-family: Consolas; color: #2b91af; font-size: x-small;\"><span style=\"font-family: Consolas; color: #2b91af; font-size: x-small;\">Export</span></span></span><span style=\"font-family: Consolas; font-size: x-small;\"><span style=\"font-family: Consolas; font-size: x-small;\">(</span></span><span style=\"font-family: Consolas; color: #0000ff; font-size: x-small;\"><span style=\"font-family: Consolas; color: #0000ff; font-size: x-small;\"><span style=\"font-family: Consolas; color: #0000ff; font-size: x-small;\">typeof</span></span></span><span style=\"font-family: Consolas; font-size: x-small;\"><span style=\"font-family: Consolas; font-size: x-small;\">(</span></span><span style=\"font-family: Consolas; color: #2b91af; font-size: x-small;\"><span style=\"font-family: Consolas; color: #2b91af; font-size: x-small;\"><span style=\"font-family: Consolas; color: #2b91af; font-size: x-small;\">ModuleAView))].</span></span></span></span></span></span><span style=\"font-family: Consolas; font-size: x-small;\">&nbsp;The view also implement IRegionMemberLifetime and have \"keepAlive\" property return to false.</span></p>\n<p>&nbsp;&nbsp;What is wrong with the code? Is this the right way to remove view?</p>\n<p>Thanks!</p>\n<p>&nbsp;</p>\n<p>&nbsp;</p>",
    "PostedDate": "2011-09-16T08:57:44.19-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "672856",
    "ThreadId": "272855",
    "Html": "<p>Hi,<br /><br />We haven't received similar issues before, as removing views after closing the shell is not a common scenario in Prism.<br />Therefore, it would be helpful if you could provide us with a repro sample application that portrays that problem, so we can help you find the cause and a possible workaround for it.</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-09-16T11:27:17.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "674148",
    "ThreadId": "272855",
    "Html": "<p>Sorry for the delayed response. I've been&nbsp;trying to put together a repro sample app for you to look at. Because&nbsp;my class library hosted in a commercial Win32 (arcmap.exe) application, so I have to use a WPF app to pretend to be the host app. My class library implements an extension for the host app with bunch of tools/ commands. In my sample app, there are 2 buttons on the host window&nbsp;and each should bring up a shell window and I will need to load different views in one of the shell and unload the view when shell is closed or the view is navigated away.</p>\r\n<p>The sample app (WPFRemoveViewTest.zip)&nbsp;is at <a href=\"https://skydrive.live.com/redir.aspx?cid=4f0ce6c357477187&amp;resid=4F0CE6C357477187!121\">https://skydrive.live.com/redir.aspx?cid=4f0ce6c357477187&amp;resid=4F0CE6C357477187!121</a></p>\r\n<p>Thanks a lot for offering the help!</p>",
    "PostedDate": "2011-09-20T05:24:25.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "674382",
    "ThreadId": "272855",
    "Html": "<p>Hi Julie,</p>\r\n<p>I think that this exception is mostly caused because the <strong>Remove </strong>method of the region is called twice:</p>\r\n<p>It's possible that when you remove the view manually (in the <strong>RemoveViews </strong>method of <strong>Shell1</strong>) the region manages to remove the view successfully. However, as your view (<strong>ModuleAView</strong>) implements <strong>IRegionMemberLifetime</strong>, it gets notified that it's not the active view anymore and then, as the <strong>KeepAlive </strong>property returns <strong>false</strong>, Prism tries to remove the view from the region.</p>\r\n<p>So as the view is already removed, the view cannot be found inside the region and the exception is thrown.</p>\r\n<p>To prevent this from happening you could use one of the following approaches:</p>\r\n<ul>\r\n<li>Remove the views using the <strong>Remove </strong>method of the region, but the <strong>KeepAlive </strong>property of the views should return <strong>true </strong>(or the views shouldn't implement <strong>IRegionMemberLifetime </strong>at all).</li>\r\n<li>Deactivate the views using the <strong>Deactivate </strong>method of the region and, if the <strong>KeepAlive </strong>property of views return <strong>false</strong>, Prism will remove them from the region.</li>\r\n</ul>\r\n<p>If not all of your views' <strong>KeepAlive </strong>property return <strong>true </strong>or <strong>false</strong>, you could have a combination of both approaches: first, try to <span style=\"text-decoration: underline;\">deactivate </span>all the views (the ones with <strong>KeepAlive false</strong> should be removed) and then iterate through the view collection again and <span style=\"text-decoration: underline;\">remove </span>the views that are still in the region (those should be the ones with <strong>KeepAlive true</strong>).</p>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\" target=\"_blank\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2011-09-20T13:13:28.507-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "674677",
    "ThreadId": "272855",
    "Html": "<p>Hi Darmian,</p>\r\n<p>Thans for the help! Following are some findings and questions.</p>\r\n<p>1. I was judging if a view is unloaded by checking if \"InitializeComponent\" of ModuleA is called again when \"Open Shell 1\" button is clicked again. Is this the right approch?</p>\r\n<p>2. If the answer is \"yes\", then I was able to use <strong>Deactivate </strong>of the region and <strong>KeepAlive = false </strong>to unload the ModuleAView (or decorate ModuleAView with \"[RegionMemberLifetime(KeepAlive=false)]\",&nbsp;<strong>and </strong>ModuleAView need to have \"CreationPolicy.NonShared\". True?</p>\r\n<p>3. When ModuleAView is unloaded, ModuleAViewModel is not, because&nbsp;it&nbsp;is \"Shared\" and was never \"unloaded\". The result is that if a control on ModuleAView is binding to the data on ModuleAViewModel, that control content will still be there even ModuleAView is re-initialized (I tested, if&nbsp;a control is not binded, it will be cleared out when the view is re-opened). So is that to say, if I need a real memory release if ModuleAView is not needed anymore, I shuld also unload ModuleAViewModel?</p>\r\n<p>4. What is the best practice in this senario that I need the shell to host many views, one at a time?</p>\r\n<p>Thank you very much!</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2011-09-21T06:27:44.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "674951",
    "ThreadId": "272855",
    "Html": "<p>Hi Julie,</p>\r\n<p>I believe that the approach you mentioned about using the invocation of the <strong>InitializeComponent </strong>method in the <strong>ModuleAView </strong>to check if the view has been unloaded before could cause some problems in some scenarios. For example, if you have to instantiate the view more than once (e.g. in a tabbed control) the <strong>InitializeComponent </strong>will be invoked in each view and this approach wouldn't work properly.</p>\r\n<p>Another approach for this would be to simply check the if the view is in the region or not through the <strong>Views </strong>property of the region.</p>\r\n<p>Regarding the <strong>ModuleAViewModel</strong>, if it's declared as a singleton (based on my understanding) the view model will not be disposed as the container will hold a reference to the \"singleton\" instance. As there should only be one instance of the <strong>ModuleAViewModel</strong>, this should not create a big memory load. However, if you wish to dispose the view model when the view is destroyed, it may make sense to declare the <strong>ModuleAViewModel </strong>with the <strong>\"NonShared\" </strong>attribute.</p>\r\n<p>Also, based on my understanding of your scenario, it seems like a <strong>common view-based navigation approach</strong> should work just fine. When you need to show a view in the shell and it already have another view, the previous view should be disposed automatically if its <strong>KeepAlive </strong>method returns <strong>false</strong>.</p>\r\n<p>You can find more about view-based navigation in the following link:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg430861%28v=PandP.40%29.aspx\">Chapter 8: Navigation in MSDN</a></li>\r\n</ul>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\" target=\"_blank\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2011-09-21T14:39:13.44-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]