[
  {
    "Id": "673983",
    "ThreadId": "273143",
    "Html": "\r\n<p>I'm studying PRISM right now. My application going to be LoB application with modules. I do understand most aspects but I pretty much hit a brick wall with this security problem.</p>\r\n<p>I want users to Authenticate before they log in into my application. I do not allow ANY anonymous activity, this is business application strictly for authorized users. What is the proper approach to do this in PRISM? I found bunch of topics here on how to\r\n create login window first and so on but I don't think they cover what's really needed. I don't want any modules to even load before users authenticated. So, I'm all confused. It seems like a common problem but there is no guidance on how to handle this scenario.</p>\r\n<p>I almost feel like authenticate user via ASP.NET form and then just use this authentication in my silverlight application.</p>\r\n<p>&nbsp;</p>\r\n<p>Question #2 is how do I store and share some common information. For example, I have &quot;Session&quot; object. How do I carry it across application. Or, how would I access &quot;Module&quot; object from inside my ViewModel?</p>\r\n<p>Thanks!</p>\r\n",
    "PostedDate": "2011-09-19T19:14:39.52-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "674352",
    "ThreadId": "273143",
    "Html": "<p>Hi,</p>\n<p>There are several ways to achieve a login scenario. Based on my understanding a good approach could be to load your authentication module, before loading all your business modules. And then you could load the other modules <strong>on demand</strong> (e.g. using the <strong>moduleManager.LoadModule</strong>(\"MyModule\") method).</p>\n<p>You can find more information regarding that in the Prism documentation:</p>\n<ul>\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg405479%28v=PandP.40%29.aspx#sec29\">Modular Application Development, Loading Modules on Demand</a>. </li>\n</ul>\n<p>Also might check the following thread where a similar issue is adressed:</p>\n<ul>\n<li><a href=\"http://compositewpf.codeplex.com/discussions/58292\">Show login modal form before</a> </li>\n</ul>\n<p>I hope you find this helpful.</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-09-20T12:23:30.993-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]