[
  {
    "Id": "676056",
    "ThreadId": "273675",
    "Html": "<p>I'm working on PRISM application with View-switching navigation and modules/regions.</p>\n<p>I have 3 regions: Navigation (on top), Tabs (second one) and Main (remaining area)</p>\n<p><strong>Navigation </strong>on top that dinamically changes depending on modules loaded (that works)</p>\n<p><strong>Tabs </strong>- this is basically region that I inject 1 view into and it will visually reflect state of my navigation. All opened views will be displayed as tabs so I can click them to open view or hit \"x\" to dispose view. That should help users when they want to work in \"MDI\" mode with different documents or modify same entity via different instances of same view. This part is not done YET, but I'm reading/re-reading PRISM 4 book and I think it&nbsp;should be&nbsp;doable.</p>\n<p><strong>Main </strong>region -&nbsp;Main region will have multiple views that basically different \"windows\" user interact with. I want those Views to be independent from each other in certain way. They will share same services, etc. But on UI - they should not block one another. What I mean by that is if there is&nbsp;2 different instances of \"Order Entry\" View - user will see 2 tabs in Tabs region and will be able to \"navigate\" from one to another by clicking on tabs.</p>\n<p>Now to my question. Let's say I work with 2 Order Entries and in my current Active View (Order1) I do some action that requires Interaction - I'm presented with child window that blocks whole Visual Root. I want this Interaction (messagebox, selector screen, etc) to be modal only to that Active view. I.E. I want to click on another tab and go to \"Order2\" without a problem. And then I want to go back to Order1 and see same Interaction open. I know navigation framework provides stuff like \"OnNavigatingAway\" but I don't even care about that because tabs will be there.</p>\n<p>I'm very new to Behaviors concept, every step is a pain for me :) Currently I implemented Child window using StockTraderRI code - I use \"PopupRegion\" on main Shell and just navigate my View's there(this code still a magic for me). I used this approach for Login screen. I also implemented InteractionRequestTrigger from PRISM library to do simple user messages.</p>\n<p>I'm not sure in which direction I should work/search in order to achieve:</p>\n<p>1. Modal only to parent view (not to whole shell)</p>\n<p>2. MVVM friendly - I mean I can open popups that have view and viewmodel</p>\n<p>3. When user closes pop-up - want to get result</p>\n<p>Any help/pointers?</p>\n<p>&nbsp;</p>",
    "PostedDate": "2011-09-23T16:45:25.13-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "676869",
    "ThreadId": "273675",
    "Html": "<p>Hi,</p>\n<p>You might find <a href=\"http://karlshifflett.wordpress.com/2010/11/07/in-the-box-ndash-mvvm-training/\"> Karl Shifflett's MVVM training kit</a> useful. This is a multi-media training which is consumed within <strong>Visual Studio 2010</strong>. It provides MVVM Technical Description and many MVVM common Scenarios that can be use as a reference.</p>\n<p>Based on my understanding of your scenario, you might find the <strong>04 - MVVM Scenarios</strong> application handy.</p>\n<p>In the aforementioned link you will find the requirements and the procedure to install this training kit.</p>\n<p>I hope you find this helpful.</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-09-26T14:13:28.477-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "676939",
    "ThreadId": "273675",
    "Html": "<p>Thanks! Exactly what I needed. I remember that I saw it SOMEWHERE and it was from Karl but forgot where I saw it. I have this training kit installed on my PC already :)</p>",
    "PostedDate": "2011-09-26T18:13:24.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "680029",
    "ThreadId": "273675",
    "Html": "<p>Well. I thought that's it. But it's not.. In this sample Karl uses UserControl to overlay parent Grid. Also it works visually and for mouse clicks - it doesn't work for keyboard. After dialog displayed I can tabl through underlining controls, click on buttons (tab and enter), etc.</p>\r\n<p>Is there any better way?</p>",
    "PostedDate": "2011-10-04T15:07:27.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "680253",
    "ThreadId": "273675",
    "Html": "<p>Hi,</p>\n<p>As this is not strictly related to Prism, you might find better support in the <a href=\"http://forums.silverlight.net/\">Silverlight forums</a>.</p>\n<p>Thanks,</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-10-05T05:32:45.667-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]