[
  {
    "Id": "684200",
    "ThreadId": "275886",
    "Html": "\r\n<p>Hi</p>\r\n<p>I have a view in a parent region that contains several regions. &nbsp;When a view contained within one of the child regions is displaying a&nbsp;validation&nbsp;error i.e the entity that the view is bound to has validation errors, then I want to run a storyboard\r\n animation on the parent region. &nbsp;What is the best way to communicate to the view in the parent region that the view in the child region is in a 'has validation error' state and then to communicate that the validation errors have been resolved? &nbsp;</p>\r\n<p>I could use an prism event or is this something a custom region behavior achieve?</p>\r\n<p>Any suggestions?</p>\r\n<p>Thanks</p>\r\n<p>Kevin</p>\r\n",
    "PostedDate": "2011-10-14T02:54:39.097-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "684256",
    "ThreadId": "275886",
    "Html": "<p>Kevin,</p>\r\n<p>In my opinion you could use the event aggregator to communicate this information between your views; region behaviors are mainly intended to address UI Composition behaviors (such as when to create a region, when to populate it with views from the registry, etc), so basically they're useful to extend the region mechanisms. In your case, your scenario implies passing information between decoupled components, which sounds like a good opportunity to use the event aggregator.</p>\r\n<p>You can read more about the aforementioned topics on the following chapters from the Prism MSDN documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921098%28PandP.40%29.aspx\">Chapter 7: Composing the User Interface</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921122%28PandP.40%29.aspx\">Chapter 9: Communicating Between Loosely Coupled Components</a></li>\r\n</ul>\r\n<p>I hope you find this helpful.</p>\r\n<p>Guido Leandro Maliandi <br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-10-14T05:44:18.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]