[
  {
    "Id": "687215",
    "ThreadId": "276663",
    "Html": "<p>Hi there!</p>\n<p>I've already posted this question on the <a title=\"StackOverfow\" href=\"http://stackoverflow.com/questions/7833041/prism-region-loses-context-during-navigation\" target=\"_blank\"> StackOverflow</a>, but there is no activity there.</p>\n<p>There main idea is that when I navigate through views in the main app's region it's Context clears. Context clears cause of I implemented INavigationAware and IRegionMemberLifetime interfaces. I implemnted these interfaces cause of I need to recreate views  and view models every navigation step.</p>\n<p>You'll find two solutions: before and after. In the first solution views and views models are not recreated when you navigated to the first view, back and to the first view again. But Context still exists. In the second solution, views and view models are  recreated but context loses.</p>\n<p><a title=\"PrismNavigationSample.zip\" href=\"https://skydrive.live.com/redir.aspx?cid=09f9aac932650216&amp;resid=9F9AAC932650216!140\">PrismNavigationSample</a></p>\n<p>What I'm doing wrong?</p>",
    "PostedDate": "2011-10-20T20:20:01.12-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "687407",
    "ThreadId": "276663",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding of your scenario, this might be related to a known  <a href=\"http://compositewpf.codeplex.com/discussions/256908\">issue</a> in prism: when removing views that shares a region context with other views in a  region, causes the region context in all the views in that region to be  lost.</p>\r\n<p>If this is your case you might find more information regarding that and  a possible workaround in the following the following blog post:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.southworks.net/aadami/2011/09/22/prism-v4-regioncontext-lost-when-removing-a-view-from-a-region/\">Prism v4: RegionContext lost when removing a view from a region</a></li>\r\n</ul>\r\n<p>I hope you find this helpful.</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2011-10-21T06:18:57.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]