[
  {
    "Id": "691843",
    "ThreadId": "277822",
    "Html": "\r\n<p>I know this is&nbsp;probably&nbsp;a subject that has been discussed many times before, but I'm hoping that someone&nbsp;might&nbsp;have some new idea on it.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>So what i would like to do:</strong></p>\r\n<p>in SCSF, there was a workspace add-on by infragistics that allowed you to define a workspace and when you gave the workspace a view, it would open it in a dialog.</p>\r\n<p>So in Prism i would like to define a region, and for that region to open in a dialog window.</p>\r\n<p>&nbsp;</p>\r\n<p><strong>What I have tried</strong></p>\r\n<ul>\r\n<li>Dialog Service - &nbsp;while I can understand having a service to open the 'browse/save/load' dialogs, it seem messy to me passing a view around to a service to be&nbsp;displayed\r\n</li><li>PopupRegionAdapter &nbsp;- I wrote a popup region adapter and&nbsp;defined&nbsp;a popup in the shell with a region name. Now I can pass a View across &nbsp;and it will open in the popup. this is more along the line that I think might work\r\n</li></ul>\r\n<p>&nbsp;</p>\r\n<p>I think that the region&nbsp;adapter&nbsp;is the way to go, but not extending the RegionAdapterBase class&nbsp;provided&nbsp;with the prism framework.</p>\r\n<p>Has anyone done something along these lines before? or any hints or anything I should watch out for. Or am i barking up the wrong tree?</p>\r\n<p>&nbsp;</p>\r\n<p>Any advice would be&nbsp;appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>Thank you</p>\r\n",
    "PostedDate": "2011-10-31T14:34:58.733-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "692234",
    "ThreadId": "277822",
    "Html": "<p>Hi,</p>\r\n<p>You might find the <strong>WindowDialogActivationBehavior </strong>(for WPF) or the <strong>PopupDialogActivationBehavior </strong>(for Silverlight) included with the <strong>Stock Trader RI</strong> useful for this. Those behaviors allows you to define a region that, when a view is added to it, will be shown in a new window/popup.</p>\r\n<p>Also, you might find the following threads useful where similar concerns are discussed:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/discussions/265715\">Modal Dialog</a></li>\r\n<li><a href=\"http://compositewpf.codeplex.com/discussions/268575\">Popup region implementation for WPF class library</a></li>\r\n</ul>\r\n<p>I hope you find it useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\" target=\"_blank\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2011-11-01T09:46:45.87-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]