[
  {
    "Id": "697921",
    "ThreadId": "279394",
    "Html": "\r\n<p>Hi All,</p>\r\n<p>lets have some views in a tabcontrol. each view is represented by his own tabitem.</p>\r\n<p>Lets also have a toolbar with entrys like &quot;Edit&quot;, &quot;Save&quot;, &quot;Undo&quot; and so on.</p>\r\n<p>Be so kind and give me a tip how can i realize:</p>\r\n<p>=&gt; The toolbar items should be enabled/disabled due to the state of the view in the current tabitem - also if a tabselectionchange occurs or the view change his state</p>\r\n<p>=&gt; How can i pass&nbsp;the command of an enabled toolbaritem&nbsp;to the active view</p>\r\n<p>I am searching for the relevant prism-way. Hardcoded (strange) will be no problem ;-)</p>\r\n<p>Regards and thanks for help and time</p>\r\n",
    "PostedDate": "2011-11-14T08:47:20.817-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "698070",
    "ThreadId": "279394",
    "Html": "<p>Hi,</p>\r\n<p>The details of how to implement this depends mostly of your personal preferences and the requirements of your scenario.</p>\r\n<p>As possible approach you could do something like this:</p>\r\n<ul>\r\n<li>First, make the views or the view models that are going to be injected in the <strong>TabControl </strong>implement the <strong>IActiveAware </strong>interface. With this, those views or view models can know when their are being activated or deactivated.</li>\r\n<li>Then, create a <strong>Shared Service</strong> that you can use to store the state of the items in the toolbar.</li>\r\n<li>When the a view is activated, you could use the shared service to change the state of the items in the toolbar. You could either change the state directly in the view / view model, or \"inform\" the shared service of the activation of the view, and make the changes in the service. This depends mostly of your personal preferences.</li>\r\n<li>Also, you could \"pass\" a command from the toolbar to the view / view model using a similar approach.</li>\r\n</ul>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\" target=\"_blank\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2011-11-14T12:59:19.68-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]