[
  {
    "Id": "93526",
    "ThreadId": "28032",
    "Html": "Hello,<br>\r\n<br>\r\nI'm coming from CAB/SCSF background. I'm thinking to start using WPF with SCSF for my future projects in my company.. Based on what Glenn Block said,&nbsp; but CAB doesn't support full WPF functionalities. So, if we like to get full WPF support, we can use Acropolis, <a href=\"http://blogs.msdn.com/gblock/archive/2007/10/26/wpf-composite-client-guidance-it-s-coming.aspx\">WPF Composite Client</a> (Prism). ( Actually, I didn't know that WPF Composite Client is renamed to Prism. Michael Puleio from SCSF pointed me your project). <br>\r\n<br>\r\nI have a few questions that I like to ask you guys. <br>\r\n<br>\r\n<ol>\r\n    <li>Can I use Prism with MVP pattern?Can I use Prise like the way that I used to use with CAB/SCSF?</li>\r\n    <li>What is the differences (pros and cons) between Acropolis, <a href=\"http://blogs.msdn.com/gblock/archive/2007/10/26/wpf-composite-client-guidance-it-s-coming.aspx\">WPF Composite Client</a> and Prism? </li>\r\n    <li>I have a lot of CAB/SCFS projects that are already working fine. Can I convert those applications to Prism easily?&nbsp; Why I want to convert? Well, I wanna do if I have some times. At least, we can get the standard interface or theme for all projects.</li>\r\n    <li>AFAIK, Acropolis is dead or something. Is it true? Do you know any reason why Acropolis is dead? Acropolis is dead cuz of the birth of Prims?&nbsp; :) </li>\r\n</ol>\r\n<br>\r\nThanks in advance. <br>\r\n",
    "PostedDate": "2008-05-19T19:10:13.343-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "94402",
    "ThreadId": "28032",
    "Html": "<p>Hi Michael,</p>\r\n<p>1. Absolutely. We have some examples of using MVP in the code, as well as Presentation Model (aka Model View ViewModel).</p>\r\n<p>2. Pros compared to Acropolis: Prism is something that will actually ship, and soon. WPF Composite Client is Prism, Prism is just the code name, and that will probably go away when we ship and become something more formal and hard to say  but that pleases the lawyers.</p>\r\n<p>3. We designed Prism to be a lot less invasive than CAB, and have a sample of integrating it into Family.Show that we will be showing at TechEd. So you could incorporate Prism features into a CAB application without doing a full migration. In terms of removing the existing CAB aspects and replacing them with Prism, that is going to be a lot harder because they are fundamentally different architectures and CAB is intertwined into your whole application (one of the things we made sure not to require in Prism).</p>\r\n<p>4. Acropolis is officially on pause I believe. But the fact is that it will probably not be resurrected as Acropolis, but some of the ideas and features of Acropolis will be incorporated in whatever comes next. Acropolis got put on hold because there were too many things that they were signed up to do, and they realized they could not ship all those features in any reasonable time frame. Prism was launched to help bridge the gap between now and whenever the product team can release something like Acropolis but with more coherent requirements.</p>\r\n<p>That is my perspective as a vendor working on the product anyway, with what I know and can say. :)</p>\r\n<p>Hoper that helps.</p>\r\n<p>Brian</p>\r\n",
    "PostedDate": "2008-05-23T09:04:00.76-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]