[
  {
    "Id": "705009",
    "ThreadId": "281244",
    "Html": "\r\n<p>Sorry for such a basic question, but here we go.&nbsp; I'm new to Prism.&nbsp; We have created a shell project and some modules that work fine.&nbsp; I learn well by stepping through code to see what is going on.&nbsp; The problem I run into is that anytime\r\n it gets to a call into Prism I get the &quot;No Source Available&quot; tab in Visual Studio.&nbsp; Is there a way to have that not happen?&nbsp; Or, is there a better way to Debug apps using Prism?</p>\r\n<p>Thanks for any help.</p>\r\n",
    "PostedDate": "2011-11-29T14:55:05.997-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "705232",
    "ThreadId": "281244",
    "Html": "<p>Hi,</p>\r\n<p>You could try adding Prism Library Source Projects to your Solutions, to do this, right-click the solution, point to Add, and then click Existing project, then select the Prism Library projects. Also after this your projects using the Prism library should reference these projects.</p>\r\n<p>You will find more information in the Prism documentation at MSDN:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg405471(v=PandP.40).aspx#sec24\">Adding Prism Library Source Projects to Solutions</a></li>\r\n</ul>\r\n<p>I hope you find this useful</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2011-11-30T04:26:31.207-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "705443",
    "ThreadId": "281244",
    "Html": "<p>Thanks for the suggestion... I think I like the idea of using the assemblies for now.</p>\r\n<p>So my next question is the following... Does this not bother anyone else?&nbsp; Do you get these tabs alot or are you smart enough to debug around them?&nbsp; Would like to know what others are doing here.</p>\r\n<p>Thank you.</p>",
    "PostedDate": "2011-11-30T11:21:47.747-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]