[
  {
    "Id": "716535",
    "ThreadId": "283996",
    "Html": "\r\n<p>Hi all</p>\r\n<p>I'm looking at using Prism navigation in a new silverlight project. &nbsp;When the user opens a view and enters some data, then opens another instance of the same view can I call some method like 'Show all open views' in the navigation framework that will\r\n return me the list of open views that I can then navigate to?</p>\r\n<p>p.s I came across an app by Karl Shifflett (<a href=\"http://karlshifflett.wordpress.com/2010/02/07/bbq-shack-ocean-v2-for-visual-studio-2008/\">http://karlshifflett.wordpress.com/2010/02/07/bbq-shack-ocean-v2-for-visual-studio-2008/</a>) that does what I\r\n want to do but was wondering if this is built into the navigation framework as I'm using Prism in other aspects of my app I'd like to stick to one framework.</p>\r\n<p>Thanks</p>\r\n<p>Paul</p>\r\n",
    "PostedDate": "2011-12-23T02:59:34.457-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "716711",
    "ThreadId": "283996",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding of your scenario, you might benefit from using the <strong>IsNavigationTarget </strong>method on the <strong>INavigationAware </strong>interface provided with Prism. This way, when making a navigation request, by using the <strong>NavigationContext </strong>to retrieve the passed parameters in the navigation <strong>URI </strong>you should be able to determine whether or not an existing view can handle the navigation request. If there is a proper view in the region, this view will be shown instead of a new view. This is useful in scenarios where you are navigating to the same type of view but need to display different information.</p>\r\n<p>You can find more information about this in <a href=\"http://msdn.microsoft.com/en-us/library/gg430861(v=PandP.40).aspx\">Chapter 8: Navigation</a> of the Prism documentation at MSDN:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg430861(v=PandP.40).aspx#sec11\">Navigating to Existing Views</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg430861(v=PandP.40).aspx#sec10\">Passing Parameters During Navigation</a></li>\r\n</ul>\r\n<p>Regarding the Non-Linear Navigation used in BBQ Shaq app, as far as I know, as Karl Shifflet's mentioned in this other blog post: <a href=\"http://blogs.msdn.com/b/kashiffl/archive/2010/10/04/prism-v4-region-navigation-pipeline.aspx\">Prism v4 Region Navigation Pipeline</a>, it might not be required in Prism to implement the Non-Linear Navigation interfaces if you don't need to, as the Prism v4 Navigation API might be enough in most common navigation scenarios.</p>\r\n<p>On the other hand, I believe you could also find this other post of your interest, where you can find how to integrate Prism v4 Region Navigation with Silverlight 4 Frame Navigation, which is not supported by the Prism v4 Library out of the box and, additionally, implementing Non-Linear Navigation features:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.msdn.com/b/kashiffl/archive/2010/10/05/integrating-prism-v4-region-navigation-with-silverlight-frame-navigation.aspx\">Integrating Prism v4 Region Navigation with Silverlight Frame Navigation</a></li>\r\n</ul>\r\n<p>I hope you find this useful,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2011-12-23T10:42:37.25-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "718977",
    "ThreadId": "283996",
    "Html": "<p>Thanks Agustin</p>\r\n<p>Will have a look at the links provided</p>",
    "PostedDate": "2011-12-31T04:08:39.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]