[
  {
    "Id": "722412",
    "ThreadId": "285455",
    "Html": "\r\n<p>Hi,</p>\r\n<p>I have created the small app using Prism V4 on Silverlight 4</p>\r\n<p>I am downloading the modules on demand (By clicking on the hyperlink button). When module download is completed I am using RequestNavigate method of IRegionManager to navigate to module default page. I am not getting any errors as such and module gets loaded\r\n successfully. But I can't see the view. I am not able to get it what wrong I am doing.</p>\r\n<p>You can downoad the sample solution from this location (https://skydrive.live.com/embed?cid=E84CFB62692563C4&amp;resid=E84CFB62692563C4%21291&amp;authkey=AMnDOJwE4i1IF_o)</p>\r\n<p>Once it is downloaded use (afzal/afzal) as username and password and click on the Admin link.</p>\r\n<p>Can anyone help ?</p>\r\n<p>Thanks in advance</p>\r\n<p>&nbsp;</p>\r\n<p>Regards</p>\r\n",
    "PostedDate": "2012-01-09T05:08:29.223-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "722719",
    "ThreadId": "285455",
    "Html": "<p>Hi,</p>\n<p>We debugged your application and found that the <strong>AdminHomeView </strong>view is registered correctly in the <strong>MainContentRegion</strong>.</p>\n<p>On the other hand we found that your <strong>MainContentRegion </strong>is defined in a <strong>Grid </strong>inside a<strong> BusyIndicator</strong>, which uses the <strong> NavigationGridStyle </strong>style. The problem seems to be in this particular style which sets the <strong>Height </strong>property with a predefined value and the <strong>MainContentRegion </strong>is not being shown as the <strong>Grid </strong>is too small.</p>\n<p>To solve this you could try not setting the value of this property in the aforementioned style.</p>\n<p>Also you could try defining your <strong>MainContentRegion </strong>outside the <strong>BusyIndicator</strong>.</p>\n<p>I hope you find this helpful,</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2012-01-09T12:30:59.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]