[
  {
    "Id": "727367",
    "ThreadId": "286621",
    "Html": "<p>Hi there:</p>\n<p>Is it worth buying the Developer's Guide to Microsoft Prism, does it include step-by-step instructions also?</p>\n<p>Rafael</p>",
    "PostedDate": "2012-01-18T20:35:59.773-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "727657",
    "ThreadId": "286621",
    "Html": "<p>Hi,</p>\n<p>As you can find in the <a href=\"http://compositewpf.codeplex.com/releases/view/55580\"> Prism 4 Documentation Page</a>, the guide is provided in many formats (e.g. PDF,CHM, online version, printed version...), which format you choose will depend mostly on your personal preferences.</p>\n<p>Also, as you can find in <a href=\"http://msdn.microsoft.com/en-us/library/ff921153%28v=pandp.40%29.aspx#sec14\"> Chapter 1: Introduction, Exploring the Documentation</a>,some topics may only be available in the source code and the online version:</p>\n<p><em>...The following topics are included with the source code and online version:</em></p>\n<ul>\n<li><em><strong>Appendix D, \"Upgrading from Previous Versions.\" </strong>This appendix discusses what you need to know if you are upgrading from previous versions of Prism.</em> </li>\n<li><em><strong>Appendix E, \"Extending Prism.\" </strong>This appendix discusses how you can extend Prism modularity, behaviors, and navigation.</em> </li>\n<li><em><strong>Appendix F, \"Reference Implementations.\"</strong> This appendix describes the reference implementations included with Prism. For more information, see the section \"Exploring the Reference Implementations.\"</em> </li>\n<li><em><strong>Appendix G, \"QuickStarts.\"</strong> Prism includes the source code for several QuickStarts that demonstrate key concepts. For more information, see the next section, \"Exploring the QuickStarts.\"</em> </li>\n<li><em><strong>Appendix H, \"Prism Hands-On Labs.\" </strong>The hands-on labs demonstrate building a simple composite application, step-by-step, in WPF and Silverlight. This appendix primarily targets developers who want to understand the basic concepts of  the Prism Library. It also includes a deployment hands-on lab for publishing and updating a Prism WPF application with ClickOnce.</em> </li>\n</ul>\n<p>Therefore, if you are looking for step by step instructions, I believe you might find <a href=\"http://msdn.microsoft.com/en-us/library/gg405475%28v=pandp.40%29.aspx\">Appendix H, \"Prism Hands-On Labs</a> useful.</p>\n<p>Additionally, if you are getting started with Prism, you might find the following resources interesting:</p>\n<ul>\n<li><a href=\"http://visualstudiogallery.msdn.microsoft.com/3ab5f02f-0c54-453c-b437-8e8d57eb9942\">MVVM Training</a> </li>\n<li><a href=\"http://prismtk.codeplex.com/\">Prism Training Kit</a> </li>\n</ul>\n<p>I hope you find this handy,</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2012-01-19T08:27:53.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "728752",
    "ThreadId": "286621",
    "Html": "<p>Hi Agustin:</p>\r\n<p>Thank you for answering.</p>\r\n<p>I didn't realize there were hands-on labs in the Prism files. Good.</p>\r\n<p>Now, about the Developer's Guide for Microsoft Prism Book, is it worth buying?</p>\r\n<p>By the way, how do I make your reply as the answer as in other forums?</p>",
    "PostedDate": "2012-01-21T12:04:51.933-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "729527",
    "ThreadId": "286621",
    "Html": "<p>Hi,</p>\r\n<p>So far, I believe the only differences you might find between the book and the online version are the aforementioned ones. These additional topics may be useful to support the main contents of the guidance, that can be consumed in any of the provided formats.</p>\r\n<p>I think you will find most of the <a href=\"http://msdn.microsoft.com/en-us/library/gg430865(v=pandp.40).aspx\">Contents of the Guide</a> very valuable, if you want to know the best practices for creating composite applications. However, which format you choose, may deppend on your personal preferences. Perhaps, you could try reading a few chapters online and then decide which one is better for you.</p>\r\n<p>Regarding how to make the reply as the answer, so far this is not necessary in Codeplex forum, as this functionality is not available.</p>\r\n<p>Regards,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2012-01-23T13:17:08.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "729895",
    "ThreadId": "286621",
    "Html": "<p>Thank you for answering...</p>",
    "PostedDate": "2012-01-24T05:45:02.623-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]