[
  {
    "Id": "729562",
    "ThreadId": "287144",
    "Html": "\r\n<p>I am working on an application where there are several modules(.xap files) that need to be downloaded, i am looking at ways to speed up the download of the xap files; apart from reducing the size of the xap files is there any other technique that could help\r\n improve the xap downloading process on the client browser?</p>\r\n<p>Appreciate any type of suggestions; Thanks!</p>\r\n",
    "PostedDate": "2012-01-23T13:55:45.363-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "730071",
    "ThreadId": "287144",
    "Html": "<p>Hi,</p>\r\n<p>As far as I know the recommended approaches in the Prism guidance to achieve this are the ones mentioned in the following chapter of the Prism documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg430856(v=pandp.40).aspx#sec3\">Deploying Prism Applications Chapter, Reducing the Download Size of Your Module XAP Files</a></li>\r\n</ul>\r\n<p>There you will mainly find two suggestions:</p>\r\n<ul>\r\n<li><em>Avoiding the duplication of shared class libraries among multiple module XAP files</em></li>\r\n<li><em>Using application library caching</em></li>\r\n</ul>\r\n<p>If you are using Application Library Caching it's important that all referenced assemblies should have the right metadata files collocated with them to ensure that they are not included in the corresponding XAP file. Also take into account that this approach is meant to improve startup performance when users revisit your Web site.</p>\r\n<p>Additionally, I believe in cases where multiple modules are loaded and used at the same time, such as presenting views at the startup of the application, you could consider packaging them in a single XAP file, which might make the download slightly faster. As there is a small amount of performance overhead involved in making two downloads instead of one, even if it is the same total download size. However, this will deppend mostly on your personal preferences and the requirements of your scenario.</p>\r\n<p>Also, note that, as this is not strictly related to Prism, I believe you might find better support in the <a href=\"http://forums.silverlight.net/\">Silverlight forums</a>.</p>\r\n<p>Regards,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2012-01-24T10:46:02.37-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]