[
  {
    "Id": "732732",
    "ThreadId": "287920",
    "Html": "\r\n<p>Hi All,</p>\r\n<p>The framework is cool and I really like it.</p>\r\n<p>I have a question like: is there a way to make certain region to go fullscreen when user double click on the region title?</p>\r\n<p>let say I got three regions in my shell and each of it have it own view. One for video, one of data, and the other is for chart. I want to make it so that user is able to click on the title of Video region, that region will go fullscreen.</p>\r\n<p>This would be nice</p>\r\n<p>thank you</p>\r\n<p>Truyen</p>\r\n",
    "PostedDate": "2012-01-30T09:33:11.817-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "732814",
    "ThreadId": "287920",
    "Html": "<p>Hi,</p>\r\n<p>As far as I know, there is no official support for this scenario in Prism out of the box. Based on my understanding, you could take advantage of the capabilities provided by Silverlight to show a user control in full screen mode and show the control which contains the region in full screen.</p>\r\n<p>As a possible approach, you could add in your <strong>Shell </strong>an empty region (for example \"<strong>FullScreenContentRegion</strong>\") that could be used to show any content in full screen. Then, through a shared service, you could set your application to full screen mode , inject the content you want to show in the aforementioned region and hide the rest of the elements in the <strong>Shell</strong>.</p>\r\n<p>You can find more information about full screen mode in Silverlight in the following link:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/cc189023%28VS.95%29.aspx\">Full-Screen Support in Silverlight</a></li>\r\n</ul>\r\n<p>Also, based on my understanding, the capability of using full screen mode on Silverlight is not strictly related to Prism. Therefore, I believe you might find better support, for example, in the Silverlight forums:</p>\r\n<ul>\r\n<li><a href=\"http://forums.silverlight.net/\">Silverlight Forums</a></li>\r\n</ul>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-01-30T12:11:11.267-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "732860",
    "ThreadId": "287920",
    "Html": "<p>Thank for the reponse, I'll give it a further reseach and back to the topic.</p>",
    "PostedDate": "2012-01-30T13:59:03.117-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]