[
  {
    "Id": "96692",
    "ThreadId": "29015",
    "Html": "<p style=\"margin:0cm 0cm 0pt\"><span>We are seriously considering using Prism in our products. But we would like to implement our products on a stable (final) release version of Prism, so we don’t need to change our code every time a drop comes out.</span></p>\r\n<p style=\"margin:0cm 0cm 0pt\">Therefore it is very important to us to know when we could expect a release version.</p>\r\n<p style=\"margin:0cm 0cm 0pt\">Is there any announced road map of Prism, or anyone has a clue when a release version is expected?</p>\r\n",
    "PostedDate": "2008-06-04T03:34:27.16-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96755",
    "ThreadId": "29015",
    "Html": "Similar situation here. I'm pushing my group real hard to use Prism and it looks like we will.  But I keep getting questioned about when will there be an &quot;official&quot; release or how often will we have to merge the latest drop into our app, etc.  If <strong>gblock</strong> could provide any info that would be great.\r\n",
    "PostedDate": "2008-06-04T08:23:58.29-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96869",
    "ThreadId": "29015",
    "Html": "While I certainly feel your pain, as the guy who gets to merge the new changes in when a new drop comes out, its not so bad.&nbsp; At least the last two drops haven't been all that bad.&nbsp; Just a few tweeks which took a few minutes too fix.&nbsp; I'd say the code base seems to get more stable with each release.&nbsp; Right now I'm comfortable having my team on it.<br>\r\n",
    "PostedDate": "2008-06-04T17:15:24.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "96989",
    "ThreadId": "29015",
    "Html": "Agreed, the last couple drops have not been bad.  My comment was more about trying to get some &quot;official&quot; roadmap info I can present to my colleagues and superiors to make them more comfortable with using Prism as the basis for our product.  \r\n",
    "PostedDate": "2008-06-05T06:03:59.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97257",
    "ThreadId": "29015",
    "Html": "Same situation here. We are starting an Enterprise Desktop Application, an high level project for our customer, in WPF. We'd like to use Prism, but we need a certain grade of &quot;stability&quot; in the realeses, we cannot afford weekly modifications/updates. Prism is really an interesting develop pattern, and we won't to miss the chance.\r\n",
    "PostedDate": "2008-06-06T05:40:17.39-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "99922",
    "ThreadId": "29015",
    "Html": "<p style=\"margin:0cm 0cm 0pt\"><span>Obviously the road map of composite WPF (Prism) should be remaining unknown to us who planned to use it; otherwise you should expect to get some response from P&amp;P.</span></p>\r\n",
    "PostedDate": "2008-06-19T23:40:09.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "100090",
    "ThreadId": "29015",
    "Html": "Sorry guys. I've been out of pocket at Tech-Ed followed by vacation since before this post was first put up. Prism v1 will be shipping the end of next week. I will plan to do a post on this next week.&nbsp;The drop will include the RI, the Composite Application Library, at least 6 quickstarts, along with fairly comprehensive documentation. You won't see any signficant changes between now and next week other than critical bug fixes and some light refactoring.<br>\r\n<br>\r\nThis is just a v1, and we are looking into a v2. We are also looking into the possiblity of an official Silverlight version.<br>\r\n<br>\r\nAs far as features in V2, here are some common requests we've heard.<br>\r\n<br>\r\n1. Some kind of facility for navigating views in a composite. (we've heard this request again and gain)<br>\r\n2. Some light scaffolding to help you get going (not necessarily GAT/GAX)<br>\r\n3. Guidance for menuing and toolbars with commands proffered up from modules<br>\r\n4. More exploration down the path of using ViewModels for composition.<br>\r\n<br>\r\nWe are also looking into possibly doing some specific guidance on building Occasionally Connected Clients. This would not necessarily be a part of Prism but would certainly be guidance applicable for composites.As far as the when, that has not been finalized yet. <br>\r\n<br>\r\nWe'd love to hear your feedback on what you'd like to see. Please add workitems with your suggestions to the Issue Tracker so that others can vote.<br>\r\n<br>\r\nHope this helps clear the haze&nbsp;a little.\r\n",
    "PostedDate": "2008-06-20T20:52:35.9-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "100152",
    "ThreadId": "29015",
    "Html": "Glenn, <br>\r\n<br>\r\nYou mentioned an &quot;official Silverlight version&quot;, is there an unnofficial version or something similar for SL? <br>\r\n<br>\r\nAbout OCC, MCSF and SCSF has something on this topic. Building an external block that could be shared between SC and CompositeWPF would be a great idea. I have not use it on SCSF (just in Mobile) but the Disconnected Service Agent could be a good start and can probably be integrated with Prism, right? <br>\r\n<br>\r\nPlease let me know if you have more information about Silverlight and Composite Applications. <br>\r\n<br>\r\nThanks<br>\r\n",
    "PostedDate": "2008-06-21T11:54:46.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109555",
    "ThreadId": "29015",
    "Html": "<div class=radEditorContent id=\"ctl00_ctl00_Content_TabContentPanel_Content_PostRepeater_ctl14_BodyDiv\">Hi guys, just to let you know that we have been spiking around the migration of the Composite Application Library to Silverlight and that we have&nbsp;published&nbsp;yesterday the results. You can download the spike by getting the <a href=\"http://www.codeplex.com/CompositeWPF/SourceControl/ListDownloadableCommits.aspx\"><span style=\"color:#3e62a6\">latest change set</span></a>&nbsp;of the source control.<br>\r\nYou might find useful the following posts about the migration:<br>\r\n<br>\r\n<ul>\r\n    <li><a href=\"http://blogs.southworks.net/ejadib/2008/08/06/silverlight-composite-application-guidance-prism-spike-published/\"><span style=\"color:#3e62a6\">Silverlight &amp; Composite Application Guidance (Prism): Spike published</span></a>\r\n    <li><a href=\"http://blogs.southworks.net/jdominguez/2008/08/icommand-for-silverlight-with-attached-behaviors/\"><span style=\"color:#3e62a6\">ICommand for Silverlight with Attached Behaviors</span></a> </li>\r\n</ul>\r\n<p>Thanks in advance for your feedback. <br>\r\n<br>\r\nPlease let me know if this helps,<br>\r\n<br>\r\nEzequiel Jadib<br>\r\n<a href=\"http://blogs.southworks.net/ejadib\"><span style=\"color:#3e62a6\">http://blogs.southworks.net/ejadib</span></a></p>\r\n</div>\r\n",
    "PostedDate": "2008-08-06T20:54:50.707-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "109569",
    "ThreadId": "29015",
    "Html": "Ezequiel, <br>\r\n<br>\r\nThese are great news!!! <br>\r\nI'll give you our feedback... <br>\r\n<br>\r\nThanks&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;\r\n",
    "PostedDate": "2008-08-06T23:18:15.49-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]