[
  {
    "Id": "97519",
    "ThreadId": "29257",
    "Html": "Hi, I've been working on a prototype application that is allowing me to learn the prism framework. I'd like to be able to publish my work and hopefully help out other folk as well as get some feedback on my what I've done.<br>\r\n<br>\r\nI'm new to WPF in general and this is also the first time I've used the unity container, so I'm expecting to see a lot of positive criticism.<br>\r\n<br>\r\nIn general would anyone be interested in this at all?<br>\r\n<br>\r\nMy current prototype is a document style application with a browser on the left and an MDI tabbed browser on the right (content) area. I'm trying to avoid the region locator as much as possible and am creating controller classes to handle document management that the view can then bind to.<br>\r\n<br>\r\n-Brett<br>\r\n",
    "PostedDate": "2008-06-08T09:23:42.333-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97845",
    "ThreadId": "29257",
    "Html": "Brett,<br>\r\n<br>\r\nI for one would definetly want to see your work.<br>\r\n<br>\r\nThanks,<br>\r\n<br>\r\nKavan\r\n",
    "PostedDate": "2008-06-09T19:00:21.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97882",
    "ThreadId": "29257",
    "Html": "Okay boys and girls, I've started a google code project here at <a title=\"Composite WPF samples google code project home\" href=\"http://code.google.com/p/cwpfsamples/\">Composite WPF samples</a>. I would have created a codeplex project but for some reason codeplex keeps stalling on me (page just sits there after clicking a link). I might move to codeplex later when this issue seems to go away for me, anyone else having this same problem?<br>\r\n<br>\r\nAnyway, ther's source code up along with a binary for you to see what the project does, at the moment the actual project itself doesn't do a lot but it does give some examples on how to use Composite WPF. <a title=\"Wiki about page\" href=\"http://code.google.com/p/cwpfsamples/wiki/About\">This link</a> shows a screen shot of what the sample application looks like, I'm no designer so it's a bit rough, but that's where the design team are meant to come in right? :)<br>\r\n<br>\r\nI hope this at least helps one person, better still, I'd like comments on what I've done. If you want to contribute and open up your own little project under this umbrella just let me know, the more we get communicating ideas the better all our products will become.<br>\r\n<br>\r\n-Brett<br>\r\n",
    "PostedDate": "2008-06-10T02:10:22.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "97886",
    "ThreadId": "29257",
    "Html": "<a title=\"New samples discussion thread\" href=\"http://www.codeplex.com/CompositeWPF/Thread/View.aspx?ThreadId=29373\">New samples discussion thread</a><br>\r\n<br>\r\nI've created a new discussion relating to the samples project that I've created, please add comments there instead.<br>\r\n<br>\r\n-Brett\r\n",
    "PostedDate": "2008-06-10T02:38:49.277-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]