[
  {
    "Id": "98756",
    "ThreadId": "29617",
    "Html": "Without trawling all of the discussions here I wondered if anyone has considered the UIP 2.0 in conjunction with a WPF application.<br>\r\n<a href=\"http://msdn.microsoft.com/en-us/library/ms979217.aspx\">MSDN UIP2.0</a><br>\r\nAre there reasons, that the 2 are not really mentioned in the same post?[other than this one of course].<br>\r\n<br>\r\nIs there a flaw in considering UIP 2.0 and WPF?<br>\r\n<br>\r\nI understand that UIP2.0 is designed for winforms/ASP and is circa 2003 thinking ... but is that enough for it not to be considered?<br>\r\n<br>\r\nApologies if this is slightly off topic.<br>\r\n<br>\r\nCheers\r\n",
    "PostedDate": "2008-06-13T08:48:01.37-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "99868",
    "ThreadId": "29617",
    "Html": "Hi @cabarch<br>\r\n<br>\r\nWe've not been considering combining UIP 2.0. In general we've not been pushing forward with future UIP development as we've not heard alot of customers request it.If you think it is something we should consider, please add it to the Issue Tracker.<br>\r\n<br>\r\nOut of curiosity, what specific aspects of UIP do you think would be beneficial to have in WPF i.e. what specific challenges it is addressing that you think we need guidance on in WPF?<br>\r\n<br>\r\nThanks<br>\r\nGlenn\r\n",
    "PostedDate": "2008-06-19T17:07:09.793-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "99882",
    "ThreadId": "29617",
    "Html": "Glenn,<br>\r\nThanks for the response.<br>\r\n<br>\r\nOn our project we were being pressed to make some decisions before the &quot;prism&quot; work really got going.<br>\r\nThe UIP piece was chosen [against my gut instinct I might say, but I'm not on the right payscale] in order to help with managing navigation between windows, via app.config holding a navigation map etc...<br>\r\n<br>\r\nI don't think we were strongly FOR any of the task management and certainly not any of the wizard aspects in UIP. <br>\r\n<br>\r\nAnyway, the UIP nav piece was doctored to fit with WPF Windows instead of Winforms, and we haven't really found a good reason to take it out.<br>\r\nThat doesn't mean to say I feel any better about it but it is still hanging around and this [prism] team has made a number of big steps but not any in this direction [managing window nav]. <br>\r\n<br>\r\nIf you guys were motivated towards a UIP style of approach I may feel less uncomfortable, alternatively if there is just a better way (since 2003) then I'd like to run with that argument with our team.<br>\r\n<br>\r\nSo picking you brains I guess.<br>\r\n<br>\r\nCheers<br>\r\nDerek\r\n",
    "PostedDate": "2008-06-19T18:43:48.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]