[
  {
    "Id": "104236",
    "ThreadId": "31356",
    "Html": "<p>I'm brand new to CAB Guidance for WPF. I'm also brand new to Infragistics WPF controls. Has anyone tried using them as regions? I'm doing a POC and I'm running into some trouble and need some help.</p>\r\n<p>Specifically, I want to create a set of views and host each one in a ContentPane within a TabGroupPane. I think I need to define&nbsp;the TabGroupPane as a region, but I'm having some trouble creating the region adapter and having it actually work -- throws a runtime exception. That might be too specific. Generally, I'm not sure if I'm going in the right direction. TabGroupPane is an Selector/ItemsControl but doesn't use ItemsSource.</p>\r\n<p>Any help anyone can provide would be very appreciated. I also posted to their forum.</p>\r\n",
    "PostedDate": "2008-07-11T12:39:22.067-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "104667",
    "ThreadId": "31356",
    "Html": "In case anyone's interested:<br>\r\n<p>I haven't completely worked this out, but I've been able to bind a collection of views to the TabGroupPane by implementing a custom region adapter <em>and region</em> for the TabGroupPane ItemsControl. I got the message below until I modified the add methods in the custom region to wrap the content in a ContentPane if the input wasn't already one. I also didn't get selection changed functionality working at first because I was setting the tab group pane's ItemsSource property to the regions views collection. Apparently this isn't supported by this extension to the ItemsControl.</p>\r\n<p>I don't like that the TabGroupPane is an ItemsControl, but doesn't support ItemsSource. I had to jump through some hoops to handle when the collection changes instead of just letting it do its thing. This might still come back to bite me. I'm not sure why Infragistics likes to do this sort of thing, but it makes it more difficult to use their controls&nbsp;(ie: InitializeRow instead of ItemDataBound).</p>\r\n<p>I'm not sure if what I've done will work in every case, or even if it works completely for my needs, but I've been able to move forward. If you'd like I could send you what I've got. If it doesn't meet your needs you can modify and share back.</p>\r\n",
    "PostedDate": "2008-07-14T17:27:38.217-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]