[
  {
    "Id": "768166",
    "ThreadId": "316879",
    "Html": "\r\n<p>Hi everyone</p>\r\n<p>I have Shell window with a tabcontrol as a main region. But I need to be able to detach the tabs an make them another window, containing the TabItem in the new window.</p>\r\n<p>For practicity, all my TabItems are simple UserControl with a property named ViewName (which is used as a tab header).</p>\r\n<p>&nbsp;</p>\r\n<p>Or rethinking the question:</p>\r\n<p>&nbsp;</p>\r\n<p>How can I create a new window and move my UserControl to that window (respecting PRISM and MVVM)?</p>\r\n<p>&nbsp;</p>\r\n<p>Hope anybody could help me with this</p>\r\n",
    "PostedDate": "2012-02-15T12:16:50.927-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "769826",
    "ThreadId": "316879",
    "Html": "<p>I think I figured it out.</p>\r\n<p>&nbsp;</p>\r\n<p>Using the PopupwindowBehavior and the drag event on the tab item.</p>\r\n<p>&nbsp;</p>\r\n<p>But if somebody have a better way to do it, be my guest</p>",
    "PostedDate": "2012-02-16T08:22:55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "774472",
    "ThreadId": "316879",
    "Html": "<p>Hi,</p>\n<p>Based on my understanding of your scenario,I agree a PopupwindowBehavior like&nbsp; the <strong>RegionPopupBehaviors </strong>in the <a href=\"http://msdn.microsoft.com/en-us/library/ff921074%28v=pandp.40%29.aspx\"> StockTrader Reference Implementation</a> seems to be a suitable way to achieve this. You can find there is an implementation of <strong>RegionPopUpBehavior </strong>(one for Silverligth and other for WPF). The main difference between these two implementations is the control that they are displaying.</p>\n<p>Regards,</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-02-17T04:19:09.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "775514",
    "ThreadId": "316879",
    "Html": "<p>Tnx for the suggest. That's what Im trying to achieve.</p>\r\n<p>But Im facing a problem right now:</p>\r\n<p>&nbsp;</p>\r\n<p>Another of my&nbsp;requirements&nbsp;is to implement a sort of modal window on top of the shell. (you know, the ones that dim the background).</p>\r\n<p>Im trying to implement a new ModalPopupDialogActivation and a new ModalPopupWrapper.</p>\r\n<p>&nbsp;</p>\r\n<p>Inside this one, Im trying to use the WPFToolkit Extended's Child Window, but for no reason Im able to make it work.</p>\r\n<p>&nbsp;</p>\r\n<p>IS there another fancy-pants way to achieve this?</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2012-02-17T08:49:58.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "775534",
    "ThreadId": "316879",
    "Html": "<p>I think I figured it out... The visual tree... need to add the childwindow into it....</p>",
    "PostedDate": "2012-02-17T08:54:29.82-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]