[
  {
    "Id": "106976",
    "ThreadId": "32258",
    "Html": "Hi All,<br>\r\n<br>\r\nI have been working with CAB/SCSF for the last 6 months and I have started working on CAB/SCSF with WPF Extension.<br>\r\n<br>\r\nI heard that Microsoft Prism (Composite WPF) is better option to start developing composite applications in WPF.<br>\r\n<br>\r\n&quot;Can somebody plz. let me know why should I go for Prism rather than CAB/SCSF for WPF applications?&quot; I have also read that when we use CAB/SCSF for WPF; we are not able to utilize all WPF features in application. &quot;what are the features of WPF not supported while developing application using CAB/SCSF in WPF?&quot;<br>\r\n<br>\r\n-h<br>\r\n",
    "PostedDate": "2008-07-24T22:16:46.68-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107016",
    "ThreadId": "32258",
    "Html": "CompositeWPF is specifically designed for WPF applications while SCSF is not. One of the things that SCSF and CAB rely on is a rich drag-and-drop windows forms designer. WPF doesn't have this kind of support and relies mostly on XAML and codebehind. Also it's important to note that Microsoft has learned a lot from the previous implementations done in SCSF and CAB and CompositeWPF contains a lot of improvements compared to the other frameworks.<br>\r\n<br>\r\nIf you plan on migrating I can recommend looking at the WPF extensions of CAB/SCSF. If you are starting from scratch and want to use WPF I can recommend using CompositeWPF. Migrating from CAB/SCSF to CompositeWPF is doable, but can take more time.<br>\r\n",
    "PostedDate": "2008-07-25T03:00:22.213-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "107025",
    "ThreadId": "32258",
    "Html": "Hi WMeints,<br>\r\n<br>\r\nThanks for your reply but I would like to know about the features, not supported while developing WPF composite application using CAB/SCSF.<br>\r\n<br>\r\n-H<br>\r\n",
    "PostedDate": "2008-07-25T03:41:41.693-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]