[
  {
    "Id": "775475",
    "ThreadId": "323427",
    "Html": "<p>I am attempting to zero in on an issue I am certain is mine, but can't figure it out.&nbsp; The issue happens when I am removing items that are in regions.&nbsp; Its a complex scenario so rather than get into the steps all I know is that prior to my issue I can execute this</p>\n<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; <em><strong>myRegionManager.Regions.ContainsRegionWithName(<span style=\"font-family: Consolas; color: #a31515; font-size: x-small;\"><span style=\"font-family: Consolas; color: #a31515; font-size: x-small;\"><span style=\"font-family: Consolas; color: #a31515; font-size: x-small;\">\"DockingControl_Home_Center_DockViewsRegion\"&nbsp;</span></span></span><span style=\"font-family: Consolas; font-size: x-small;\"><span style=\"font-family: Consolas; font-size: x-small;\">);</span></span></strong></em></p>\n<p>&nbsp;... which I use as my test.&nbsp;</p>\n<p>As a test I sprinkle this line throughout my code until it throws an exception.&nbsp;&nbsp; The exception is an UpdateRegion Exception and I can see that it likely surfaces from PRISM Region manager's ContainsRegionWithName method within the call to UpdateRegions ... As I said, it is more than likely something that I am doing to cause this so I thought, why not add the PRISM project to my SilverLight project and attempt to debug through PRISM to trace through the&nbsp;issue. As you will read, I can't seem to add the necessary&nbsp;PRISM source&nbsp;projects to my solution that&nbsp;would allow me to debug through this scenario.&nbsp;</p>\n<p>To further understand my root-issue, the exception I am receiving relates to adding a Region, however at this point in my code, I am only removing a view from an existing region.&nbsp; The test I added was because later on in my logic, I remove that same region and I was getting this same PRISM exception, again elluding to an error adding a region, when in fact I was removing a region.&nbsp; I looked at the PRISM source and notice that both Remove() and ContainsRegionWithName both call UpdateRegions() which is why I decided to use the line \"ContainsRegionWithName ...\" as a test to see if I could narrow that scope down.&nbsp; I am not exactly sure what is causing my exception and so I am wanting to debug through PRISM to see.</p>\n<p>The actual PRISM exception message is</p>\n<p>&nbsp;<em><strong>Region with the given name is already registered:</strong></em></p>\n<p>﻿Which seems to orginate from RegionManager.Add. Just prior to removing the view, I was able to excute my test line (i.e. call into RegionManager and test for whether or not ContainsRegionWithName returns true, which it always does, as that region is there). I see it under debug watch. Also in the past when I have a situation such as this, I normally see an exception within Debug Watch but I do not see that here, all appears to be very normal. Again, I am certain this me but find it very odd that prior to removing a view, that I do not receive any exception through this test, but only after a remove the view do I get it.&nbsp;</p>\n<p>Further, why is UpdateRegions() calling through RegionManager.Add as a result of me sucessfully removing a view from a known region?&nbsp;</p>\n<p>This seems a bit weird which is why I&nbsp;am keen to debug through the PRISM libraries to see what is causing the call to Add..</p>\n<p>Unfortunately when I add the PRISM.SilverLight project to my solution I can sucessfully compile it&nbsp;and reference through my existing projects however when I attempt to compile my SilverLight applications&nbsp;I receive the following compile time error.</p>\n<p><em><strong>'Microsoft.Practices.Prism.Bootstrapper' is defined in an assembly that is not referenced</strong></em></p>\n<p>Many times in the past year&nbsp;I wanted to do the same, but always I hit this same issue, so I end up spending many hours/days debuging around PRISM when I know I'd get quickly to my error if I could debug through the PRISM assemblies.</p>\n<p><span style=\"color: #800080;\"><strong>Is there any guidance out there that illustrates what bits to include in my solution to allow me to debug the PRISM libraries?</strong></span></p>\n<p>I thank you in advance.</p>\n<p>Cheers&nbsp;</p>",
    "PostedDate": "2012-02-17T08:40:47.057-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "775793",
    "ThreadId": "323427",
    "Html": "<p>Hi,</p>\n<p>As mentioned in this <a href=\"http://compositewpf.codeplex.com/discussions/239176\"> thread</a>, the error you are getting might be caused because you're adding some references to compiled assemblies, and some to the projects. in order to avoid these errors, you could try removing all the references in your target solution, and then adding  the references to the projects from the Prism Library (not the compiled DLLs).</p>\n<p>Additionally, you can find more information in the Prism documentation at MSDN:</p>\n<ul>\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg405471%28v=PandP.40%29.aspx#sec24\">Adding Prism Library Source Projects to Solutions</a> </li>\n</ul>\n<p>I hope you find this handy,</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>\n<ul>\n</ul>",
    "PostedDate": "2012-02-17T09:57:50.477-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "776037",
    "ThreadId": "323427",
    "Html": "<p>Thank you Agustin however I am still unable to debug through the PRISM libraries although I no longer get the error message</p>\r\n<p><em><strong>'Microsoft.Practices.Prism.Bootstrapper' is defined in an assembly that is not referenced</strong></em></p>\r\n<p>Note: I followed the instructions which state to remove the build option from Configuration Manager for all PRISM projects I include (which is the Interactivity, MEF and Silverlight PRISM projects).&nbsp; I then changed the reference of each of my projects within my solution to point to these projects as reference and when I attempted to compile my project(s) I received an error stating that the compilier could not find the assemblies for PRISM. So knowning that I can't compile the 3 included PRISM projects&nbsp;I instead copied over the contents of the PRISM\\Bin folder into each of the debug\\bin folders for each PRISM library.&nbsp; At that point,&nbsp;my compile error went away however&nbsp;even though the applicaiton boots up, it is not allowing me to step through and into the PRISM&nbsp;code.</p>\r\n<p>I was thinking, that the PRISM binaries that I copied over from the PRISM Bin folder to each of the PRISM debug\\bin folders would most likely be release versions (even though they contained PDB files) so how or where does one get a set of Debug assemblies that are strongly named?&nbsp; I suspect that is my current issue.</p>\r\n<p>Any thoughts on what I can try next?&nbsp;</p>",
    "PostedDate": "2012-02-17T10:57:32.213-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "796191",
    "ThreadId": "323427",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding, as you copied the compiled Prism assemblies in the debug\\bin folder of each project, your application seems to be using those assemblies instead of the Prism projects.</p>\r\n<p>As far as I know, you should be able to replace the compiled Prism assemblies with their corresponding projects without problems. It would be helpful if you could provide us with more information regarding the error you are experiencing when trying to compile the Prism projects (for example, the classes or assemblies that are missing, the references of each project, etc).</p>\r\n<p>Also, as a possible approach, you could try to replace the Prism assemblies with their corresponding projects in one of the several Quickstarts provided with Prism. If, after doing so, you cannot compile the Prism projects in the Quickstart, it would be helpful if you could provide us with the modified Quickstart in order to help you understanding what is preventing the Prism projects from being compiled.</p>\r\n<p>Regards,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-02-22T13:03:08.707-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]