[
  {
    "Id": "110221",
    "ThreadId": "33259",
    "Html": "I am looking for a Visual Studio like shell for the Composit WPF. Is there any work being done regarding the shell simulating the Visual Studio layout?&nbsp;\r\n",
    "PostedDate": "2008-08-10T12:58:36.047-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "110584",
    "ThreadId": "33259",
    "Html": "Hi romanr, have you seen the Contrib project?&nbsp; <a href=\"http://www.codeplex.com/CompositeWPFContrib\">http://www.codeplex.com/CompositeWPFContrib</a>&nbsp; <br>\r\n<br>\r\nHavn't seen anything in regards to a Visual Studio like shell but they're doing some interesting stuff in the Contrib project :)<br>\r\n<br>\r\n",
    "PostedDate": "2008-08-12T07:29:04.887-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111295",
    "ThreadId": "33259",
    "Html": "Hi romanr,<br>\r\n<br>\r\nI like the idea to have some generic shells available for developers as a startingpoint for their new composite WPF application.<br>\r\nA visual studio like shell sure is one that fits into this category.<br>\r\n<br>\r\nAt the moment we have a region adapter for the <span id=\"ctl00_ctl00_Content_TabContentPanel_Content_wikiSourceLabel\"> Infragistics TabGroupPane control, which makes it possible to create a shell<br>\r\nthat has the same docking features as visual studio. I can recommend that you check out the composite WPF contrib project and try that control out.<br>\r\n</span>\r\n",
    "PostedDate": "2008-08-15T00:50:26.747-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "111960",
    "ThreadId": "33259",
    "Html": "Chapter 6 of WPF Unleashed (pg 179), by Adam Nathan, provides the code and explanation for &quot;Creating a Visual Studio Like Collapsible, Dockable, Resizable Pane&quot;.&nbsp;&nbsp; Very impressive usage of XAML with little code-behind.&nbsp; I trust this book coupled with the Contrib project will get you what your looking for.&nbsp;&nbsp; This is an EXCELLENT book by the way.\r\n",
    "PostedDate": "2008-08-18T21:20:32.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112146",
    "ThreadId": "33259",
    "Html": "Composite WPF itself has nothing to do with the VS layout style. I would recommend to buy a serious library that supports docking and tabbed mdi and adapt it.&nbsp;For now it is:&nbsp;Infragistics, Syncfusion, Actipro. I believe in a few monthes all of the control library vendors will come up with VS style support in WPF.\r\n",
    "PostedDate": "2008-08-19T12:48:54.043-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "112171",
    "ThreadId": "33259",
    "Html": "I would add &quot;buyer beware&quot;, whatever product you are going to purchase google it for a minimum of &quot;memory leak&quot;.&nbsp;&nbsp;Be particularly aware of the support sections responses to the average joe's questions (as it could be you next).&nbsp; I learned the hard way that not everything that shines works as it should (like we don't already have enough on our plates); fortunately WPF is going to give us enough power to do it ourselves.\r\n",
    "PostedDate": "2008-08-19T14:14:30.6-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]