[
  {
    "Id": "811858",
    "ThreadId": "349003",
    "Html": "\r\n<p>Is it possible to make it work and how?</p>\r\n<p>I want to allow OOB install just for convenience while letting people use my SL5 application in-browser. I'm using MEF to load modules (XAP files) on a fly and it works great. However, when I install OOB - modules don't get loaded. Where should I look and\r\n what should I do to make it work?</p>\r\n<p>&nbsp;</p>\r\n<p>SL5 &#43; PRISM 4.1</p>\r\n",
    "PostedDate": "2012-03-17T08:36:29.637-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "812710",
    "ThreadId": "349003",
    "Html": "<p>Hi,<br /> <br /> As mentioned in the documentation if you plan to run your <strong>Silverlight </strong> application Out-Of-Browser (<strong>OOB</strong>), the user will first need to access the application with the browser via its hosting page; after that, the user can then optionally install the application for <strong>OOB </strong>use. As a result, the deployment of a <strong>Silverlight </strong> Prism application is mostly a matter of getting your <strong>XAP </strong>files in the right place on a web server so the hosting page can download and run them.</p>\n<p>One thing to take into account, to avoid cross-domain call issues,is that the remote modules' <strong>XAP </strong>files should be located on the same domain as the main application; when deployed like this, the <strong>Ref </strong>property on the <strong>ModuleCatalog </strong>should be a Uniform Resource Identifier (<strong>URI</strong>) relative to the main <strong>XAP </strong>file location on the web server.</p>\n<p>More information about this can be found in <a href=\"http://msdn.microsoft.com/en-us/library/gg430856%28v=pandp.40%29.aspx\"> Chapter 11: Deploying Prism Applications</a>, of the Prism documentation</p>\n<p>Based on this, I tested the <a href=\"http://msdn.microsoft.com/en-us/library/ff921163%28v=pandp.40%29.aspx\"> Modularity Quickstart</a> with <strong>MEF</strong>, <strong>Prism 4.1</strong> and <strong>Silverlight 5 OOB </strong>and didn't find any problem.</p>\n<p>The only scenario where I found modules in different <strong>XAP </strong>files were not loaded was if running the <strong>OOB </strong>application offline, since the application cannot obtain the <strong>XAP </strong>files from the web server and any <strong>XAP </strong>that don&rsquo;t appear in the main application isn&rsquo;t added to the out-of-browser cache.</p>\n<p>Possible approaches to workaround this could be:</p>\n<ul>\n<li>Creating a custom <strong>XapModuleTypeLoader </strong>that will download to Isolated Storage and check there first for .xap files. After the files are cached the <strong>OOB</strong> application should be able to load the modules </li>\n<li>Include modules in the main .xap </li>\n</ul>\n<p>You might find an example of this, but using <strong>Unity </strong>in the following blog post:</p>\n<ul>\n<li><a href=\"http://blogs.southworks.net/dschenkelman/2011/01/10/how-to-load-prism-modules-packaged-in-a-%20%20separate-xap-file-in-an-oob-application/\">How to: Load Prism modules packaged in a separate XAP file in an OOB application</a> </li>\n</ul>\n<p>On the other hand, another possible reason that could be causing your problem could be a reported issue when running <strong>Silverlight </strong>applications from out of browser, you could find more information in the following thread:</p>\n<ul>\n<li><a href=\"http://compositewpf.codeplex.com/discussions/242463\">Intermittent NotFound error with Prism Modules +MEF when running Silverlight out of browser</a> </li>\n</ul>\n<p>I hope you find this helpful,</p>\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2012-03-19T14:34:05.167-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "812717",
    "ThreadId": "349003",
    "Html": "<p>I wonder if it has to do with the fact that I run my app over SSL? The way&nbsp;I have my app setup - I have main module in separate XAP. So, shell itself doesn't do much. It loads System module which does authentication and proceeds with loading other modules.</p>\n<p>I have all XAPs in a same ClientBin folder.</p>",
    "PostedDate": "2012-03-19T14:53:22.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "813210",
    "ThreadId": "349003",
    "Html": "<p>Hi,</p>\r\n<p>In my opinion, as a start point, you could try using a tool like <a href=\"http://www.fiddler2.com/fiddler2/\">fiddler</a> or a similar one that will help you obtain more information about the failing request which might be useful for finding the cause of this problem. More information about this and other similar tools can be found in the following blog:</p>\r\n<ul>\r\n<li><a href=\"http://timheuer.com/blog/archive/2008/06/10/silverlight-services-cross-domain-404-not-found.aspx\">Silverlight cross domain services and a helpful tool </a></li>\r\n</ul>\r\n<p>So far, with the information you provided, we believe this could be caused by a <strong>Cross</strong>-<strong>domain </strong>issue or a <strong>Cross</strong>-<strong>scheme </strong>issue if you request the page via <strong>http</strong>, but your page will try to access via <strong>https</strong>.</p>\r\n<p>Regarding this, you could find useful information about security policies that can restrict network communications in your <strong>Silverlight </strong>application and additional restrictions that are in place when accessing <strong>URL </strong>resources in the following links:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/cc645032%28v=vs.95%29.aspx\">Network Security Access Restrictions in Silverlight</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/cc189008%28v=vs.95%29.aspx\">URL Access Restrictions in Silverlight</a></li>\r\n</ul>\r\n<p>Regards,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a>﻿</p>",
    "PostedDate": "2012-03-20T13:44:50.1-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]