[
  {
    "Id": "814129",
    "ThreadId": "349640",
    "Html": "\r\n<p>This is a fairly high-level exploratory question to help me frame the direction I'm researching, looking for Prism-like architectural patterns for HTML5/js type websites/applications.</p>\r\n<p>I'm a big fan of Prism/MVVM when it comes to WPF/SL due to the use of strong design patterns such as:<br>\r\n- Modularity<br>\r\n- IOC/DI<br>\r\n- Event Driven<br>\r\n- View Separation&nbsp;</p>\r\n<p>That, plus other design patterns allow for a very strong underlying architecture for maintainable large scale applications.</p>\r\n<p>I'm looking for guidance to accomplish the same architectural approach but using typical web technologies.</p>\r\n<p>MVC is great. &nbsp;The new single page application (SPA) using js libraries for MVVM and offline storage are also great. &nbsp;There are many other great technologies for the web to choose from. &nbsp;Add it all up including HTML5/js and it should be &quot;close\r\n enough&quot; for a desktop experience on the web.</p>\r\n<p>The biggest pattern I have a problem with right now is modularity. &nbsp;With Prism/WPF modules are easily identified and separated. &nbsp;The only reference to the outside world is through interfaces shared in a central framework.</p>\r\n<p>How does one accomplish the same design for a website?</p>\r\n<p>I'll end by saying another huge benefit to me using Prism was the consolidated and proven nature of the guidance. &nbsp;It wasn't a mixed collection of technologies and patterns from all over the place where you have to make up the glue in between. &nbsp;That\r\n hard work was already done by the PnP team, thank you by the way.</p>\r\n<p>I'm hoping to not have to figure out all the in between bits, hoping that someone (like the PnP team) has already done that :)</p>\r\n<p>Cheers</p>\r\n",
    "PostedDate": "2012-03-22T09:12:39.307-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "814233",
    "ThreadId": "349640",
    "Html": "<p>Hi,</p>\r\n<p>Prism does not provide guidance for building websites and architectures implemented in HTML / JavaScript. However, I believe you will find one of the latest Pattern &amp; Practices projects very valuable for this kind of scenario: <a href=\"http://silk.codeplex.com/\">Project Silk</a>.</p>\r\n<p>As far as I know, Project Silk provides guidance based on HTML5, jQuery and ASP.NET MVC 3 which covers several topics like modularity, loosely coupled communication and dependency injection among many others. Based on this, I believe you will find the patterns proposed by this guidance very useful.</p>\r\n<p>You can find the official MSDN documentation of project Silk in the following link:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/hh396380.aspx\">Project Silk: Client-Side Web Development for Modern Browsers</a></li>\r\n</ul>\r\n<p>Regards,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-03-22T12:05:37.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]