[
  {
    "Id": "849034",
    "ThreadId": "359619",
    "Html": "\r\n<p>Hello,</p>\r\n<p>&nbsp;</p>\r\n<p>In my application structure, Modularization is used with Prism. General infrastructure has multiple modules and one of them is used as master application which downloads other modules. In addition to modularization, redusing xap size is also used with and\r\n creation of zip file are successfully done.</p>\r\n<p>&nbsp;</p>\r\n<p>The problem is if master module does not have reference to a zipped assembly, other modules cannot be loaded because their different reference assemblies(which are also zipped successfully by related module) are not downloaded. Is there any fix or workaround\r\n that can force these assemblies to be loaded if they are not downloaded yet ?&nbsp;</p>\r\n<p>Thanks</p>\r\n",
    "PostedDate": "2012-06-14T08:07:42.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "849173",
    "ThreadId": "359619",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Based on my understanding of your scenario, this problem seems to be related to a known issue in\r\n<strong>Prism </strong>where if you choose to <strong>reduce XAP size by using application library caching</strong> and your shell application does not references the &quot;cached&quot; libraries, those libraries are not loaded.</p>\r\n<p>You can find this issue reported in the following work item:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/workitem/4730\">SL3 caching not working with Modules</a>\r\n</li></ul>\r\n<p>As a possible approach to use application library caching, you can find a proposed workaround in the following blog post that might be helpful:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.southworks.net/gmaliandi/2012/01/how-to-use-application-library-caching-in-prism-modules/\">How to: Use Application Library Caching in Prism modules</a>\r\n</li></ul>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br>\r\n<a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>\r\n",
    "PostedDate": "2012-06-14T11:08:57.25-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "849366",
    "ThreadId": "359619",
    "Html": "<p>Thanks Damian, this is working with your workaround. Actually this bug is against the main purpose of Prism modularization.</p>\r\n<p>Regards,</p>\r\n<p>Şerif</p>",
    "PostedDate": "2012-06-14T23:54:19.273-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]