[
  {
    "Id": "857426",
    "ThreadId": "361968",
    "Html": "\r\n<p>Basically I'm making my own version of the UICompositionQuickStart, but with some changes to match my own projects needs: RIA Services, etc..</p>\r\n<p>The best way to master new technology approaches is to make my own examples.</p>\r\n<p>When I try to run the project I get this XamlParseException:&nbsp;</p>\r\n<p><img src=\"http://i49.tinypic.com/2wqbqkw.jpg\" alt=\"\" width=\"512\" height=\"544\"></p>\r\n<p>&nbsp;Which translated into english means something like:</p>\r\n<p><strong>&quot;The invocation of the constructor of type 'ModuleEmployees.ViewModels.EmployeeListViewModel' that matches the specified link restrictions throwed an exception. [Line 12 Position 42]&quot;</strong></p>\r\n<p>Here's the corresponding View:</p>\r\n<p><img src=\"http://i45.tinypic.com/2ywy1xg.jpg\" alt=\"\" width=\"775\" height=\"232\"></p>\r\n<p>Here's my project structure:</p>\r\n<p><img src=\"http://i47.tinypic.com/8yu893.jpg\" alt=\"\" width=\"257\" height=\"601\"></p>\r\n<p>Do you need some more information to know what the problem is?</p>\r\n<p>I'm trying to program the Views/ViewModels without having the ViewModels as a parameter. I know that from the View Injection point of view the types are better resolved when the ViewModel comes as a parameter to the view, but I have Silverlight view that\r\n have to load the ViewModels from xaml.</p>\r\n",
    "PostedDate": "2012-07-04T08:20:21.443-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "857480",
    "ThreadId": "361968",
    "Html": "<p>Hi again!</p>\r\n<p>Based on my understanding, this problem doesn't seem to be related to the view or to your project structure: following the description of the <strong>XamlParseException</strong>, it seems that an exception was thrown inside the <strong>constructor </strong>of your view model. As a possible approach to check this you could set a <strong>break point</strong> inside the aforementioned constructor and debug it to find the sentence that is throwing the \"real\" exception.</p>\r\n<p>Also, by looking at the <strong>inner exceptions</strong> shown in first screenshot you posted, it seems that the exception is related to the use of a non-initialized variable (which is probably throwing a <strong>NullReferenceException</strong>.)</p>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-07-04T10:12:57.237-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "857596",
    "ThreadId": "361968",
    "Html": "<p>Thank you Damian for answering. You were right.</p>\r\n<p>The error message was so unfamiliar to me that I didn't know what to think of it.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2012-07-04T19:31:31.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]