[
  {
    "Id": "859052",
    "ThreadId": "362502",
    "Html": "\r\n<p>I'm new to WPF, C#, .NET, Prism, and MVVM.</p>\r\n<p>My company is&nbsp;planning to use the above technologies to build a Client/Server solution for&nbsp;it's new product range.</p>\r\n<p>I have started looking at Prism as a possible framework for the new project. However I'm unclear how the Prism framework would be implemented in a Client/Server architecture.</p>\r\n<p>Based on the MVVM pattern, we envisage that the Client would contain the Views, and View&nbsp; Models, while the Server would contain the Models and Business logic.</p>\r\n<p>When it comes to a Client/Server architecture like the one described above, is Prism a Client side framework only? Or can the Prism framework also be used on the Server side?</p>\r\n<p>Any help on this topic would be very welcome. Thanks.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-07-09T02:05:57.033-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "859324",
    "ThreadId": "362502",
    "Html": "<p>Hi Paul, if the applications you are creating have a database back-end, Prism and MVVM are ideal for that scenario. I would suggest also taking a look at RIA Services (<a href=\"http://www.silverlight.net/learn/advanced-techniques/wcf-ria-services/get-started-with-wcf-ria-services\">http://www.silverlight.net/learn/advanced-techniques/wcf-ria-services/get-started-with-wcf-ria-services</a>)&nbsp;to get you started creating a service layer that is hosted on the server but available on the client. You don't have to use Prism for this, but if you application needs to be split into modules, then I would use Prism, MVVM and RIA Services.</p>",
    "PostedDate": "2012-07-09T12:36:16.96-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "859930",
    "ThreadId": "362502",
    "Html": "\r\n<p>Hi Paul,</p>\r\n<p>As far as I know, <strong>Prism </strong>only provides guidance about Client side application development. Hence, you could say that\r\n<strong>Prism </strong>is a &quot;Client side framework&quot; only. However, I believe you should be able to use\r\n<strong>Prism </strong>in your client application without problems, as <strong>Prism\r\n</strong>is usually agnostic to the Client-Server communication and business logic of the application.</p>\r\n<p>As a starting point, I believe you could find Pedro's recommendations in the previous response useful.</p>\r\n<p>Regards,</p>\r\n<p>Damian Cherubini<br>\r\n<a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>\r\n",
    "PostedDate": "2012-07-10T13:12:11.903-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]