[
  {
    "Id": "859978",
    "ThreadId": "362737",
    "Html": "\r\n<p>Hello,</p>\r\n<p>I am able to create a transitioning content control for my MVVM/WPF/PRISM application.&nbsp; I would like to use the AnimatedControlTab style (or at least the animation part of it) but I am struggling moving that style to content control.&nbsp;</p>\r\n<p>Any help you can provide will be greatly appreciated.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-07-10T14:52:04.827-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "860019",
    "ThreadId": "362737",
    "Html": "<p>Let me add little bit of information to help clarify the issue I am running into.&nbsp; I am able to basically refactor code from TransitioningContentControl (TCC) from Silverlight tool kit and it works with the default 2 animations that comes with the TCC.</p>\r\n<p>Instead of standard animation, I would like to use the animation on the AnimatedTabControl from StockTrader RI and use it in my TCC.&nbsp; I have not been successful in doing that.&nbsp;&nbsp;&nbsp;This link&nbsp; <a href=\"http://sdrv.ms/POqu5h\">http://sdrv.ms/POqu5h</a>&nbsp;should point to a simple example that shows the TCC working but I can not get the same transition from StockTrader to work.</p>\r\n<p>Can you help please?</p>",
    "PostedDate": "2012-07-10T16:21:09.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "860526",
    "ThreadId": "362737",
    "Html": "<p>Hi BishMan,</p>\r\n<p>I have checked your sample-application and it seems that the animation does not work in your custom control because it uses some specific components defined in its original control template (that is, the template of the <strong>AnimatedTabControl</strong>) that were not included in your template.</p>\r\n<p>I have modified your sample-application to include the transition used in the <strong>AnimatedTabControl</strong>:</p>\r\n<ul>\r\n<li><a href=\"https://skydrive.live.com/redir?resid=99307B6105BC060D!120&amp;authkey=!ACvV8VQr5BNNBDM\">AnimatedContentControl v2</a></li>\r\n</ul>\r\n<p>You can use it as a starting point and customize the animation according to your preferences.</p>\r\n<p>Also, as this is not strictly related to Prism, I believe you might find better support regarding this in the <strong>WPF Forums</strong>:</p>\r\n<ul>\r\n<li><a href=\"http://social.msdn.microsoft.com/forums/en-US/wpf/threads/\">Windows Presentation Foundation Forums on MSDN</a></li>\r\n</ul>\r\n<p>I hope you find this useful,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-07-11T13:32:44.75-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]