[
  {
    "Id": "873806",
    "ThreadId": "373872",
    "Html": "\r\n<p>Here is a question posed in Stack overflow. I have the exact same problem. Custom region adapter, custom region NOT showing up in the region manager. If I registerviewiwthregion it works (though the region is still not attached to the regionmanager) otherwise\r\n I get errors that my region doesn't exist. Here is the link to the stack overflow question that has code, etc.</p>\r\n<p>&nbsp;</p>\r\n<p>http://stackoverflow.com/q/6017868/1367800</p>\r\n<p>&nbsp;</p>\r\n<p>Any help would be greatly appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>Prism 4.1 with silverlight 5 (vs 2012 RC)</p>\r\n",
    "PostedDate": "2012-07-18T08:30:18.2-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "874566",
    "ThreadId": "373872",
    "Html": "<p>Hi,</p>\r\n<p>I believe, that your problem could be related to the one described in the following <strong>DevExpress </strong>ticket, where an issue regarding Regions and <strong>DevExpress </strong>controls is reported:</p>\r\n<ul>\r\n<li><a href=\"http://www.devexpress.com/Support/Center/p/Q350752.aspx\">DockWindowManager and Prism regions support</a></li>\r\n</ul>\r\n<p>There is explained that a possible cause of this problem is that <strong>Prism </strong>finds <strong>RegionManager </strong>for any region using the <strong>FrameworkElement</strong>.<strong>Parent </strong>property. Also, there you can find a sample application containing a custom implementation of the <strong>RegionManagerRegistrationBehavior </strong>created by the <strong>DevExpress </strong>Team proposed as a workaround for this behavior.</p>\r\n<p>Additionally, I believe you could check this <a href=\"http://www.devexpress.com/Support/Center/p/B209431.aspx\">other ticket</a> from the <strong>DevExpress </strong>forums where a sample that portrays the scenario of using a <strong>DocumentGroup </strong>as a <strong>Prism </strong>region is provided (although this sample is for <strong>WPF </strong>applications, perhaps you could find it interesting).</p>\r\n<p>I hope you find this handy,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-07-18T13:47:18.697-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]