[
  {
    "Id": "127017",
    "ThreadId": "38293",
    "Html": "Hi,<br>\r\n<br>\r\nI am getting&nbsp; really wierd multiple selections in a listbox bound to an observable collection that is added to on receipt of an event.. selecting one item in the listbox can cause numerous (seemingly random) other entries to be selected even though the listbox is set to single selection mode.<br>\r\n<br>\r\nI have a Presentation Model that contains an observable collection that is bound to by a list box. <br>\r\n<br>\r\nprivate observable collection:<br>\r\n&nbsp;&nbsp;&nbsp; <em>private readonly ObservableCollection&lt;string&gt; _importEvents = new ObservableCollection&lt;string&gt;();</em><br>\r\n<br>\r\npublic property bound to by xaml<br>\r\n<em>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; public ObservableCollection&lt;string&gt; ImportEvents<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; {<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; get { return _importEvents; }<br>\r\n&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; }</em><br>\r\n<br>\r\nIn the constructor for my Presentation model I subscribe to an event, on receipt of event I add to the observable collection (on the UI thread)<br>\r\n<br>\r\n<em>_eventAggregator.GetEvent&lt;FileImportEvent&gt;().Subscribe(EventText =&gt; _importEvents.Add(EventText), ThreadOption.UIThread);<br>\r\n</em><br>\r\nIs there something fundamentaly wrong that I am doing?<br>\r\n<br>\r\nI have tried filling the collection with static data on construction and this all selects fine, it is only when I select the dynamically added entries that things go all Xfiles on me :-)<br>\r\n<br>\r\nMy presentation model on receiving a call from a button click event handler is calling via interface to code which<br>\r\n1) first publishes a '<em>FileImportEvent'</em>&nbsp; via the aggregator to say it has been invoked, <br>\r\n2) it then kicks off a seperate process and waits for process completion or timeout <br>\r\n3) then publishes further events to describe process completion results <br>\r\n4) returns to the caller.&nbsp; <br>\r\n<br>\r\nI was originaly running the seperate process asynchronously and publishing the '<em>FileImportEvent' </em>on Process.Exited, when I came across this issue I though it was due to the multiple threads publishing the events.. (although I thought the event agregator must marshal events when the subscriber requests them on the UIThread?)<br>\r\n<br>\r\nI have looked at the collection in the debugger and that seems fine, I have visualized the UI using mole and the listbox simply shows multple entries showing selected = true.. I can work round this by dropping the listbox (listview does the same thing so it would have to be a text box).. or switching to feeding back via an interface, I am just extremely curious to know what I have missunderstood..<br>\r\n<br>\r\nany input welcome.<br>\r\n<br>\r\nTrevor<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-10-22T12:49:44.437-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]