[
  {
    "Id": "897642",
    "ThreadId": "390894",
    "Html": "\r\n<p>I am just getting started using Prism and Unity to develop a modular application. I am trying to figure out how I can have user settings accessed/set from various modules to a central repository of some sort.</p>\r\n<p>I have my 'core' application and then various modules added to that. What I could like to do is pass the user settings from the app.config from my core app to the various modules if they need it.</p>\r\n<p>Any help would be greatly appreciated.</p>\r\n",
    "PostedDate": "2012-08-09T09:33:24.17-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "897718",
    "ThreadId": "390894",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding of your scenario, I believe you could use a<strong> Shared Service</strong> to expose information that needs to be shared across your different modules. As you may find, a <strong>Shared Service</strong> is a class registered in the container that can be accessed through a  common interface. This way, in your service you could define the logic  to access and store the information according to your needs.</p>\r\n<p>You could find more information about shared services in the following chapter of the <strong>Prism </strong>documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921122%28v=pandp.40%29\">Chapter 9: Communicating Between Loosely Coupled Components</a></li>\r\n</ul>\r\n<p>Also, for a example that implements a <strong>Shared Service</strong>, you could check the <strong>OrdersRepository.cs</strong> in the <a href=\"http://msdn.microsoft.com/en-us/library/ff921082%28v=pandp.40%29\">Commanding Quickstart</a> provided with <strong>Prism</strong>.</p>\r\n<p>Additionally, I believe you could also check the <strong>Dependency Injection Lab</strong> of the <a href=\"http://prismtk.codeplex.com/\">Prism Training Kit</a>, which explains step by step how to register and consume shared services using the <strong>Unity</strong> container. Although the samples in this Lab use <strong>Silverlight</strong>, I believe the concepts explained will still be useful.</p>\r\n<p>I hope you find this helpful,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-08-09T11:48:17.197-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "898232",
    "ThreadId": "390894",
    "Html": "<p>Thank you, those resources were useful.</p>",
    "PostedDate": "2012-08-10T13:21:52.147-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]