[
  {
    "Id": "902694",
    "ThreadId": "392663",
    "Html": "\r\n<p>Hi ,</p>\r\n<p>I have question , about publish and subscribe,</p>\r\n<p>i have one page where my tabs , from this page i want to open different module,</p>\r\n<p>by tab i know which module i need to open,</p>\r\n<p>but if i pusblish my main page to other module my all module get subscribe, dont know how to do it?</p>\r\n<p>any one know.</p>\r\n<p>i dont want to created same event Type on many pages .</p>\r\n<p>Thanks</p>\r\n<p>A-</p>\r\n",
    "PostedDate": "2012-08-22T13:36:06.713-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "903010",
    "ThreadId": "392663",
    "Html": "<p>Hi,</p>\r\n<p>I'm not sure if I understood your scenario correctly, but I believe you could benefit from using <strong>Subscription Filtering</strong> with your events, which lets you pass a filter parameter, to avoid that all subscribers handle every instance of the published event. This way you could create one event type defined in a <strong>common </strong>project that will be referenced by the modules that will consume it, and based on the payload passed when publishing to the event you will define which module will handle the event.</p>\r\n<p>You could find more information about this in the following section of the <strong>Prism </strong>documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921122%28v=pandp.40%29#sec8\">Chapter 9: Communicating Between Loosely Coupled Components, Event Aggregation </a></li>\r\n</ul>\r\n<p>Also, for an example that uses a custom payload and subscribes using a a filter expression you could check the <a href=\"http://msdn.microsoft.com/en-us/library/ff921173%28v=pandp.40%29\">Event Aggregation QuickStart.</a></p>\r\n<p>Please let me know if I have misunderstood your scenario,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-08-23T05:57:16.643-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "903128",
    "ThreadId": "392663",
    "Html": "<p>Thanks Agustin,</p>\r\n<p>below my scenario,</p>\r\n<p>I have menu like ribbon Control.</p>\r\n<p>and when i clcik Tab 1 then Tab1 user controls should open , and Tab 2 and other page should open and subscribe how i can do.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks</p>\r\n<p>A-</p>",
    "PostedDate": "2012-08-23T10:48:08.913-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]