[
  {
    "Id": "903173",
    "ThreadId": "392851",
    "Html": "\r\n<p>Hi Every one,</p>\r\n<p>I am using WPF but i am newbie in prism,</p>\r\n<p>I am using WPF Tool kit for Ribbon control, i would like to use Prism.</p>\r\n<p>when ever i tried i am not able to succed, do u know any where i can get Example.</p>\r\n<p>below is my requirement.</p>\r\n<p>I have ribbon Control and When i click any Tab i would like to see that page into my Avalon Dock panel.</p>\r\n<p>looking forward to hearing from you.</p>\r\n<p>Thanks</p>\r\n<p>A-</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-08-23T12:36:34.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "903197",
    "ThreadId": "392851",
    "Html": "<p>Hi,</p>\r\n<p>As far as I know, there is no official samples regarding the use of <strong>Prism </strong>and <strong>Ribbon </strong>controls. However, in the web you can find several samples portraying this kind of scenario.</p>\r\n<p>For example, in the following thread you can find a link to a blog post which portrays a <strong>WPF + Prism + Ribbon</strong> sample application:</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/discussions/352708\">A Prism 4 Application Checklist</a></li>\r\n</ul>\r\n<p>Also, I believe you could find the sample application included in the following blog post useful. Although the post is in German, you can download the sample and analyze it to find how it's implemented (the download link is at the end of the post):</p>\r\n<ul>\r\n<li><a href=\"http://blogs.msdn.com/b/mtcmuc/archive/2010/12/01/how-to-prism-ribbon-regionadapter.aspx\">How to: PRISM Ribbon RegionAdapter</a></li>\r\n</ul>\r\n<p>Take into account that <strong>Prism </strong>does not provide a <strong>RegionAdapter </strong>for <strong>Ribbon </strong>controls as out of the box. This means that you cannot define a <strong>Ribbon </strong>control as a region unless you implement a <strong>RegionAdapter </strong>for it. The two sample applications mentioned above also address this scenario by implementing their custom <strong>Ribbon RegionAdapters</strong>.</p>\r\n<p>I hope this helps,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-08-23T13:26:49.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "911792",
    "ThreadId": "392851",
    "Html": "<p>&nbsp;</p>\r\n<p>Thanks for reply,</p>\r\n<p>i got few thing which is working, but i have one problem which stucking me to proceed.</p>\r\n<p>i have few moduleA and Module B, i open Module A from Ribbon Control so Control placed inside Avalon Dock, i have button on this page i want to open Module B (page2) by clicking on this button how i can do?</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2012-09-12T12:56:14.15-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "912284",
    "ThreadId": "392851",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding of your scenario, you should be able to bind the button to a command, and in this command perform the required logic to display the new page (e.g. initialize the Module B if not already initialized, which could register the new view in an specific region, or if the module is already loaded you could add this view to a region of your choice by using any of the <strong>UI Composition </strong>approaches).</p>\r\n<p>In case you want to use the <strong>AvalonDock </strong>as the container of your views, by defining a region in it, you should have to define a custom region adapter for this type of control, as this is not supported by <strong>Prism </strong>as out of the box. I have seen a couple of samples of how to implement this kind of adapters that could be used as a reference, for example you could check the following resources:</p>\r\n<ul>\r\n<li><a href=\"http://avalondock.codeplex.com/releases/view/92210\">PRISM Integration Sample</a></li>\r\n<li><a href=\"http://www.codeplex.com/CompositeWPFContrib\">Composite WPF Contrib site</a></li>\r\n</ul>\r\n<p>I hope you find this handy,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-09-13T09:54:47.837-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]