[
  {
    "Id": "915986",
    "ThreadId": "396482",
    "Html": "\r\n<p>Hi to all friends out there.</p>\r\n<p>I am not able to figure out how i can implement form base authentication by using prism so that i can maintain throughout out my application.I have modular application in which i have one module which is for user authentication .i want that i authenticate\r\n user here and authentication token i make available to all&nbsp; module.</p>\r\n<p>So please tell me how i can achieve that .I have RIA service in my web solution.</p>\r\n<p>Thanks in advance.</p>\r\n",
    "PostedDate": "2012-09-21T19:03:01.81-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "917353",
    "ThreadId": "396482",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding you should be able to expose your authentication functionality for example by using <strong>shared services</strong>, which basically are classes that can be accessed from the container through a common interface, allowing you to have&nbsp; system-wide services, such as authentication. This way you should be able to share your authentication token across your different modules.</p>\r\n<p>For more information about <strong>Shared Services </strong>you could check the following chapter of the <strong>Prism </strong>documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921122(v=pandp.40).aspx\">Chapter 9: Communicating Between Loosely Coupled Components</a></li>\r\n</ul>\r\n<p>Also, I believe you could find the following blog post interesting:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.southworks.net/gmaliandi/2011/10/using-wcf-services-in-prism-silverlight-applications/\">Using WCF services in Prism Silverlight applications</a></li>\r\n</ul>\r\n<p>There you could find a sample and information on how to wrap a ria service in a shared service, which is registered in the container through a common interface mapping, defined in a common project. This way you could consume this service using this interface in all your modules.</p>\r\n<p>I hope you find this handy,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-09-25T09:50:40.143-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]