[
  {
    "Id": "132062",
    "ThreadId": "39790",
    "Html": "Hi,<br>\r\nWhile ago I began to look into Composite WPF, and I wanted to learn this concept, which I want to use in some applications. One of my first problem was how to implement a Composite application that is TabControl based and the Shell should create the tab items dynamically, without allocating any pre-defined item controls. I have to say it took some time until I figure it out. I should mention that the answer was hidden inside all the Quick Starts specially in UIComposition. Anyway I thought I send an example to community, for those who want to do this and maybe not to spend the same time that I did. The example has a TabRegion, which will be used to dynamically load tab itmes inside this region. The template of the tab item will accecpt a text and an image for header. Each modules will set these properties. Shell application will check of initiated module if the module is presented in Modules folder it will be loaded, othewise the tabitem ignors. The Style.xaml file is the same as UIComposition. I added the Itemtab template inside the shell xaml file. This is becasue of 2 reason, first I wanted to show only the part has been modified and second, when I used the <span style=\"font-size:13px;color:#ff0000\"><span style=\"font-size:13px;color:#ff0000\">\r\n<p>BasedOn</p>\r\n</span>\r\n<p>&nbsp;</p>\r\n</span>\r\n<p><span style=\"font-size:13px;color:#0000ff\">=&quot;{</span><span style=\"font-size:13px;color:#a31515\">StaticResource</span><span style=\"font-size:13px;color:#ff0000\"> SimpleTabItem</span><span style=\"font-size:13px;color:#0000ff\">}&quot;\r\n<p>&nbsp;</p>\r\n</span></p>\r\nin Shell.xaml, I got the runtime error that SimpleTabItem cannot be found. <br>\r\n<br>\r\nI appriciate any comments and pointers, if you feel for it. The example can be downloaded at <a href=\"http://hem.bredband.net/morteza_ar/TabModules.rar\">http://hem.bredband.net/morteza_ar/TabModules.rar</a><br>\r\n<br>\r\nThanks<br>\r\nMorteza\r\n",
    "PostedDate": "2008-11-12T10:17:29.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]