[
  {
    "Id": "923407",
    "ThreadId": "398470",
    "Html": "\r\n<p>Hi All,</p>\r\n<p>I have one shell window.</p>\r\n<p>This shell window have the four tabs views.</p>\r\n<p>I have created a region for each tab view , means 4 tabs views has the 4 regions.</p>\r\n<p>I can switch a from one tab to another tab.</p>\r\n<p>My question is how much region will take a memory in order to display tab view. Is it depends on a view?</p>\r\n<p>Another thing is i could have been managed these four tabs into one region, not necessary to create other 3 regions.</p>\r\n<p>If i created so, these all 4 regions will take a more memory or its the same as 1 region???</p>\r\n<p>Any help highly appreciated.</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-10-08T06:16:18.023-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "924267",
    "ThreadId": "398470",
    "Html": "<p>Hi,</p>\r\n<p>As far as I know, each region consume memory for the <strong>region object</strong> itself, its <strong>attached region behaviors</strong> and the <strong>views</strong> that the region contains (active and deactivated ones.) Based on my understanding, most of the memory usage from a region will come from the views it contains. Hence, much of how memory a region might consume will depend mostly of the amount of views it contains and the size of each view.</p>\r\n<p>Based on this, four regions will consume more memory than one. On the other hand, the \"correct\" amount of regions for you application will depend mostly of the requirements of your scenario and your personal preferences. You should take into account if the benefits of structuring your UI with several regions instead of one are greater that the memory consumption of such regions (which I believe is minimal.)</p>\r\n<p>Regards,</p>\r\n<p>Damian Cherubini<br /> <a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>",
    "PostedDate": "2012-10-09T13:29:20.057-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "924493",
    "ThreadId": "398470",
    "Html": "<p>Thank you so much Damian!!</p>",
    "PostedDate": "2012-10-09T23:15:00.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]