[
  {
    "Id": "934194",
    "ThreadId": "401242",
    "Html": "\r\n<p>I am currently working on a project that is using PRISM 4 &#43; MVVM&nbsp;in a WPF 4 application.&nbsp; I have been reading up on InteractionRequest and there seems to be little information on how to implement it so that the dialog is a stylable user control\r\n and has textbox and other controls in it.&nbsp;</p>\r\n<p>What I am looking to do is have a listview that when a user selects an item it opens a dialog box where they can edit the details and either save or cancel.</p>\r\n<p>Is this the correct approach with WPF?&nbsp; Should I be doing something other than InteractionRequest?&nbsp; I generally do web applications so WPF is a bit new to me.</p>\r\n<p>Any assistance would be greatly appreciated.</p>\r\n<p>Thanks!</p>\r\n",
    "PostedDate": "2012-10-30T06:21:01.377-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "934255",
    "ThreadId": "401242",
    "Html": "<p>Hi,</p>\r\n<p>Based on my understanding using <strong>Interaction Requests </strong>would be a recommended approach to interact with users in an <strong>MVVM </strong>based application, as it will allow you to preserve a clean separation of concerns, which might be difficult with other approaches. This is mainly because, when using <strong>Interaction Requests</strong> you can encapsulate the application's presentation logic in your view model while allowing the view to encapsulate the visual aspects of the interaction.</p>\r\n<p>You can find more information about this in the following section of the documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/gg405494%28v=pandp.40%29.aspx#sec12\">Chapter 6: Advanced MVVM Scenarios,Using Interaction Request Objects</a></li>\r\n</ul>\r\n<p>Also, as mentioned in this chapter, if you want to support custom interaction mechanisms you can defined you own custom triggers and actions. By default <strong>Prism</strong> only provides the <strong>InteractionRequestTrigger </strong>and <strong>PopupChildWindowAction </strong>implementations that can be used as a basis for the development of your own triggers and actions, this way you could create your own implementation in order to show custom popup views.</p>\r\n<p>Additionally, for more information about using <strong>Interaction Requests </strong>and examples using custom implementations of this approach, I recommend you to check the following resources:</p>\r\n<ul>\r\n<li><a href=\"http://karlshifflett.wordpress.com/2010/11/07/in-the-box-ndash-mvvm-training/\">In the Box - MVVM Training (MVVM Scenarios section)</a></li>\r\n</ul>\r\n<ul>\r\n<li><a href=\"http://blogs.southworks.net/dcherubini/2012/05/24/popupwindowaction-using-custom-views-instead-of-windows-in-wpf-and-prism/\">PopupWindowAction: using custom views instead of windows in WPF and Prism</a></li>\r\n</ul>\r\n<p>I hope you find this handy,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br /> http://blogs.southworks.net/aadami</a></p>",
    "PostedDate": "2012-10-30T07:59:33.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]