[
  {
    "Id": "943086",
    "ThreadId": "403563",
    "Html": "\r\n<p>Is there any one out there that can tell me why I cannot isntall Prism? The installation gets to the point where a dialog box comes up and says that the installer has finished unpacking the files, I click OK, and nothing else happens. I have searched my\r\n entire hard drive and there is nothing that includes the word &quot;Prism&quot;. There is no info in the control panel either.</p>\r\n<p>What's wrong?</p>\r\n<p>Using Windows 7</p>\r\n<p>VS 2010</p>\r\n<p>.NET 4.0</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-11-16T17:30:42.293-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "943264",
    "ThreadId": "403563",
    "Html": "\r\n<p>When unpacking the files, where did you specify as the folder to unpack to?</p>\r\n<p>The unpacking process simply unpacks the files to the target location, I don't think there&nbsp;will&nbsp;be anything in Control Panel. It also won't automatically install anything to the Visual Studio IDE.</p>\r\n<p>When I unpack the files I specify c:\\program files\\prism41 as the target folder (but you can use whatever you like). You can then optionally run the registerprismbinraries.bat file to register the assemblies, or you can manually add the references to your\r\n project in Visual Studio. If you use the .bat file, I had to modify this for Silverlight 5 (I replaced the references to Silverlight 4.0 with Silverlight 5.0).</p>\r\n",
    "PostedDate": "2012-11-17T08:10:37.947-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "943948",
    "ThreadId": "403563",
    "Html": "\r\n<p>I never get a prompt to select where to place the files. I get a license dialog and then the dialog discribed above and that's all.</p>\r\n<p>&nbsp;</p>\r\n",
    "PostedDate": "2012-11-19T06:04:19.073-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "944156",
    "ThreadId": "403563",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Have you tried running the<strong> Source.Exe</strong> file as an <strong>administrator</strong>? (right click on the file,\r\n<em>Run as administrator</em> option) , perhaps this could be related to your problem.</p>\r\n<p>Regards,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br>\r\nhttp://blogs.southworks.net/aadami</a></p>\r\n",
    "PostedDate": "2012-11-19T11:24:20.907-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "947214",
    "ThreadId": "403563",
    "Html": "\r\n<p>Check out this thread.</p>\r\n<p><a href=\"http://compositewpf.codeplex.com/discussions/76453?ProjectName=compositewpf\">http://compositewpf.codeplex.com/discussions/76453?ProjectName=compositewpf</a></p>\r\n<p>There are some enterprises that don't allow the running of the VBS script.&nbsp;&nbsp; If that is the case, unzip the package, and run the source.exe file.&nbsp; Or run the install to the point where it says it is going to unpack the files.&nbsp; Stop there, go to a File Explorer\r\n window and look in your temp directory.&nbsp; There should be a new directory there that is being used by the install.&nbsp; Take the source.exe from there and copy it to another directory.&nbsp; Then unzip it to where you want.</p>\r\n<p>pmont</p>\r\n",
    "PostedDate": "2012-11-26T12:11:42.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "948767",
    "ThreadId": "403563",
    "Html": "\r\n<p>Use the nuget package for the dll's.</p>\r\n",
    "PostedDate": "2012-11-28T23:08:35.367-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]