[
  {
    "Id": "956282",
    "ThreadId": "406825",
    "Html": "\r\n<p>WindowRegionAdapter has been around for sometime now. I used it and liked it. What's your&nbsp;favorite&nbsp;way of creating Popup windows (modal and modaless). Any comments are very much appreciated.</p>\r\n",
    "PostedDate": "2012-12-14T13:05:05.743-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "957192",
    "ThreadId": "406825",
    "Html": "\r\n<p>Hi,</p>\r\n<p>I believe that the approach to be used to show a popup window will depend on the preferences of each developer and the requirements of each scenario.</p>\r\n<p>In my case, when I need to show a popup window that is related to an specific view and it's not required to reuse that popup in other parts of the application, I tend to use a\r\n<strong>PopupChildWindowAction </strong>for <strong>Silverlight</strong>. For <strong>\r\nWPF</strong>, I use a custom <strong>PopupWindowAction </strong>(which you can find in one of my\r\n<a href=\"http://blogs.southworks.net/dcherubini/2012/05/24/popupwindowaction-using-custom-views-instead-of-windows-in-wpf-and-prism/\">\r\nblog posts</a>) which provides similar capabilities for <strong>WPF</strong>.</p>\r\n<p>On the other hand, if a want to show in a popup a view that could be reused by several parts of my application, or just navigated to from several locations, I tend to use the\r\n<strong>PopupDialogActivationBehavior </strong>(for <strong>Silverlight</strong>) or the\r\n<strong>WindowDialogActivationBehavior </strong>(for <strong>WPF</strong>) defined in the\r\n<strong>Stock Trader RI</strong>, as they allows you to define a <strong>Region </strong>\r\nthat will show its view in a popup.</p>\r\n<p>Again, there isn't a better approach. Which one you should use would depend mostly of what you want to do and your personal preferences. Hence, these are not recommendations, but more like my personal preferences on the subject.</p>\r\n<p>Regards,</p>\r\n<p>Damian Cherubini<br>\r\n<a href=\"http://blogs.southworks.net/dcherubini\">http://blogs.southworks.net/dcherubini</a></p>\r\n",
    "PostedDate": "2012-12-17T12:31:04.58-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]