[
  {
    "Id": "136194",
    "ThreadId": "41066",
    "Html": "<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">If you have a “hosting control” and multiple modules that share the region/hosting control, and you need to have only one module or its collection of module views  active at the time how would you proceed? </span></p>\r\n<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">In past with smart client factories, I ran into the challenge of requirements between marketing departments visual standards and legacy interfaces.  I ended up to separating the views into multiple modules and regions, which control dependencies between the views I merge by controller. This separation did not make a sense in UI logic, but it was compliant with the requirements that were important in solution acceptance. <br>\r\n<br>\r\n</span><span style=\"font-family:calibri\">Anyhow, based on the inspiration of RegionActiveAwereBehaviour I was wondering what would be the best way to address above issue without over coding the controller, and would it be worth to extend a  RegionBehaviours concept a bit more to cover cases like this.</span></p>\r\n<p style=\"margin:0in 0in 10pt\"><span><span style=\"font-family:calibri\">For background see </span><a href=\"http://blogs.msdn.com/erwinvandervalk/default.aspx\"><span style=\"font-family:calibri;color:windowtext;text-decoration:none;text-underline:none\">Erwin van der Valk's blog</span></a><span style=\"font-family:calibri\"> of RegionBehaviours at </span><a href=\"http://blogs.msdn.com/erwinvandervalk/default.aspx\"><span style=\"font-family:calibri\">http://blogs.msdn.com/erwinvandervalk/default.aspx</span></a> </span></p>\r\n<span style=\"font-family:calibri\">\r\n<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">Also I was wondering if SyncRegionContextWithHostBehaviour is intent to cover this, and if so any explanation when and how to use this behaviour would be highly appreciated. <br>\r\n<br>\r\nAny thoughts? <br>\r\n<br>\r\n<p><span style=\"font-family:calibri\"><strong>Late Saturday Note</strong>: after some deep look of test cases and current code in CD6 I realized that probably only way onward would be to create an adapter like TabControlRegionAdapter, but adapt between the modules and regions or create something like ModuleRegionsAdapter.  </span></p>\r\n<p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">To simplify the initial question, consider following requirements:</span><span style=\"font-family:calibri\">\r\n<ul>\r\n    <li>Solution contains several modules. </li>\r\n    <li><span style=\"font-family:calibri\">Each module contains an x-number of views that are mapped to available shell regions.\r\n    <li><span style=\"font-family:calibri\">When view of module x0 is become active, corresponding region views of module should be activated and presenter should be notified for futher action. </span></li>\r\n    <ul></ul>\r\n        <p>&nbsp;</p>\r\n        </span></li>\r\n    </ul>\r\n    <p><span style=\"font-family:calibri\">Just for my own sanity, am I right way on this or is there more straightforward or out-of-box solution when you want to simply the controller logic and number of interactions between controller/view/presenter?</span></p>\r\n    <p>&nbsp;</p>\r\n    </span></p>\r\n    <p>&nbsp;</p>\r\n    </span></p>\r\n    <p><strong>Late Sunday Update:</strong> <br>\r\n    <span style=\"font-family:calibri\">I think the problem here is that, Region is conceptually proposed to be highest grouping of views. Maybe I did not understand the adapter mapping and behavior concept correctly but if highest point is Region.  This will increase the complexity of controller(s) when regions are shared by multiple modules. Why would I share the regions? </span></p>\r\n    <p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">Consider following, if you requirements of visual compositions or regions are proposed by different interests groups of your client. For example, you visual compositions are proposed by marketing or advertisement company of current established visual standard of public corporate outlook, whereas your modules and views are often build on business or interfacing requirements of business domains, services and existing legacy interfaces. </span></p>\r\n    <p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">I made a one conceptual diagram in order to see with couple of modules how the complexity increases in module transitions. I believe this can be simplify if there would be a Group which region can be added, and group can have a behavior like currently proposed on Regions and views hierarchy.</span></p>\r\n    <p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">I could not add this diagram here directly so the link to this JPG diagram is in below URL. </span><a href=\"http://www.xentree.com/SL2WithPrism/View_Transitions_Diagram.JPG\"><span style=\"font-family:calibri\">http://www.xentree.com/SL2WithPrism/View_Transitions_Diagram.JPG</span></a> </p>\r\n    <p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">This has been a long monolog so far, any thoughts here would be great. </span></p>\r\n    <p style=\"margin:0in 0in 10pt\"><span style=\"font-family:calibri\">Regards,<br>\r\n    </span><span style=\"font-family:calibri\">Alexander</span></p>\r\n    </span>\r\n",
    "PostedDate": "2008-11-28T18:32:42.77-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]