[
  {
    "Id": "138384",
    "ThreadId": "41687",
    "Html": "Hi all,<br>\r\n<br>\r\nI'm currently evaluating the Composite WPF guide for a new app and I don't have any experience with it beside playing around the quickstarts.<br>\r\n<br>\r\nOne thing I'm struggling with is figuring out a way to implementing navigation. I'd like to enable the user to get back to where he came from in the application. Depending on the action/button clicked, I would create a new entry in a navigation list to be able to get back to where the initial action occured (a kind of restore point). Just being able to go backward is required. I don't thing going forward would make sense in the context of that application.<br>\r\n<br>\r\nIs it possible to implement this by pushing the the entire state of a region and pop it back ?<br>\r\n<br>\r\nOr maybe navigating by firing a command and keeping a list of commands that causes the app to navigate and replaying those commands ?<br>\r\n<br>\r\nWhat are your toughts ?<br>\r\n<br>\r\nSimon<br>\r\n<br>\r\n<br>\r\n",
    "PostedDate": "2008-12-07T06:51:24.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "138813",
    "ThreadId": "41687",
    "Html": "Hi Simon,<br>\r\n<br>\r\nNavigation can be quite the topic, so much that it takes a section in the <strong>Windows Presentation Foundation Unleashed</strong> book by Adam Nathan (I strongly recommend this book).  On page 206 he talks about Navigation-based Windows Applications.  In a subsection &quot;Navigating from Page to Page&quot; he notes the following:<br>\r\n<br>\r\nYou can perform navigation in three main ways:<br>\r\n<br>\r\n* Calling the Navigate Method<br>\r\n* Using Hyperlinks<br>\r\n* Using the Journal<br>\r\n<br>\r\nYou may want to google &quot;NavigationWindow WPF&quot; and the &quot;NavigationService class WPF&quot; in the absence of the book.    <br>\r\n",
    "PostedDate": "2008-12-08T17:40:00.157-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]