[
  {
    "Id": "140356",
    "ThreadId": "42255",
    "Html": "Hi,<br>\r\n<br>\r\nIs it possible to share resource dictionary with styles and skins between modules? Will it work with ondemand loading?<br>\r\n<br>\r\nThanks,<br>\r\nAlexey Zakharov<br>\r\n",
    "PostedDate": "2008-12-14T01:07:31.72-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140359",
    "ThreadId": "42255",
    "Html": "Hello,<br>\r\n<br>\r\nAre you talking about share the resources between WPF Modules? Or WPF Modules and Silverlight Modules? <br>\r\n<br>\r\nIf you are talking about share the resouces between WPF Modules, it's possible to do that. <br>\r\n<br>\r\n&gt;&gt;Will it work with ondemand loading?<br>\r\n<br>\r\nI haven't tried it yet but it should work. \r\n",
    "PostedDate": "2008-12-14T01:18:00.1-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140360",
    "ThreadId": "42255",
    "Html": "I'm talking about silverlight =)<br>\r\n",
    "PostedDate": "2008-12-14T01:53:16.07-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140380",
    "ThreadId": "42255",
    "Html": "Yes. You can share the resources between Silverlight Modules if you are using Silverlight Toolkit. But there are a lot of problems.. You can't switch the style on the fly os you have to reload the application from code. If you do that, your browser will be crashed some time..&nbsp; You won't be able to apply the style to the nested controls. you will need to apply it explicitly. I understand that you are not asking about those problems. So, I would say &quot;Yes! you can share the style and skin between Silverlight Modules&quot;. :) <br>\r\n",
    "PostedDate": "2008-12-14T07:11:04.017-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "140417",
    "ThreadId": "42255",
    "Html": "It would be nice if u will write about it in your blog =)<br>\r\n<br>\r\nI think that sharing of resources between modules should be build-in feature of prism. Also there is no app.xaml, so the standart way to add styles and skins inside of module is to make them resource of some control?<br>\r\n",
    "PostedDate": "2008-12-14T11:17:20.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]