[
  {
    "Id": "141578",
    "ThreadId": "42589",
    "Html": "I have a hard time using Region....<br>\r\nIn my Shell application I'm using DevComponent's Ribbon and DockPanel (<a href=\"http://www.devcomponents.com/dotnetbar-wpf\">http://www.devcomponents.com/dotnetbar-wpf</a>).<br>\r\nI want to define some part of the app menu, docking area, ribbon as regions.<br>\r\n<br>\r\nIt look to me like an overtly complicated process....<br>\r\n<br>\r\nI'm thinking to give up and just write a Shell Service that can load views (don't need to unload them).<br>\r\n<br>\r\nI was wondering what you guy think about that?<br>\r\n<br>\r\n(Maybe this is due to DockWindowGroup being bad ItemsController as in they only accept DockWindow as item.. nonetheless.. I have a problem where Region are more of liability than an advantage... and a UI Service will solve the problem nicely...)\r\n",
    "PostedDate": "2008-12-18T06:03:50.843-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "141752",
    "ThreadId": "42589",
    "Html": "Hi Superlloyd,<br>\r\n<br>\r\nRegions actually simplify what could become complicated processes.  I provide a blog, video demo and source code <a href=\"http://www.global-webnet.net/blogengine/post/2008/12/18/Silverlight-CompositeWPF-Prism-regions.aspx\">HERE</a><br>\r\n<br>\r\nI'd be interested in knowing if the above mentioned controls take a simple process and make it more complicated - would be a nice to know before making the investment (my current contract has budgeted for a control library in the new year).<br>\r\n<br>\r\nBill<br>\r\n",
    "PostedDate": "2008-12-18T20:22:49.51-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144959",
    "ThreadId": "42589",
    "Html": "Hi Billkrat!<br>\r\n<br>\r\nSorry for my late answer, I was taken by the holiday! :-)<br>\r\n<br>\r\nAnyway, I dropped the RegionManager. From the vantage of my limited knowledge it seems to be too complicated to use for what I intend.<br>\r\nInstead I create a new UI service specific to my application. Works quite well save that I can't remove thing...<br>\r\nIt tooks me about 50 line to have code to be able to add whatever I like dynamically, whereas it would have been a lot of custom RegionAdapter developement work with IRegionManager.... plus I'm still not clear on all its intricacy...\r\n",
    "PostedDate": "2009-01-06T21:37:21.233-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "144961",
    "ThreadId": "42589",
    "Html": "No worries - I know how it is :)  Glad you got it worked out - thats what is important!<br>\r\nBill\r\n",
    "PostedDate": "2009-01-06T21:46:57.413-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]