[
  {
    "Id": "141998",
    "ThreadId": "42733",
    "Html": "<div id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl00_BodyDiv\">Curious if anyone had implemented Popups using CWPF and, if so, what your experiences were.  I have a design that calls for &quot;popping&quot; up a listbox of values related to an option selected within a control/view with multiple toggle-buttons in a region.  The reason I'm interested in a pop-up is because the designer wants the list box to be visibly anchored to and positioned relative to the selected toggle button - and the selection region/control/view shouldn't move because of inserting the listbox into or near the selection view.  <br>\r\n<br>\r\nI think pop-up is the way to go because it allows me to float the box relative to the selected element, sometimes overlapping it, without having to either &quot;reserve&quot; other regions around the main selection control or insert them into the same region -- which would tend to cause a layout change that isn't desirable.  I'm trying to use the MVC pattern with a controller that receives a selection event from the togglebutton in the &quot;selection&quot; view and then calls into a presenter for the pop-up (using container resolution).  <br>\r\n<br>\r\nI know this is a big &quot;what if&quot; but curious if view/presenter/controller is needed in this sort of scenario or if it would be better to just create a model for the data (coming from an ADO.Net data service) and then generate the pop-up in code from the selection view's presenter and then just bind the model data to a data-template. Am I abusing the framework?  Would this is also work with a legitimate region and view and I'm just not seeing it? (Composite WPF is giving me brain freeze...)<br>\r\n<br>\r\nI have something that &quot;sort-of&quot; works but seems inelegant.  Again, just curious if anyone else had encountered anything like this and what you might suggest. </div>\r\n",
    "PostedDate": "2008-12-19T23:32:13.55-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "142342",
    "ThreadId": "42733",
    "Html": "<p style=\"margin:0cm 0cm 0pt\"><span style=\"font-family:calibri\">Hi,<br>\r\n<br>\r\nThis thread is duplicated. You can find the answer <a href=\"http://www.codeplex.com/CompositeWPF/Thread/View.aspx?ThreadId=42734\">here</a>.<br>\r\n</span></p>\r\n<span style=\"font-size:11pt;font-family:'calibri','sans-serif'\"><br>\r\n<p style=\"margin:0cm 0cm 0pt -0.6pt\"><span style=\"font-family:calibri\">Damian Schenkelman</span></p>\r\n<span style=\"font-size:11pt;font-family:'calibri','sans-serif'\"><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></span><a href=\"http://blogs.southworks.net/dschenkelman\"></a></span>\r\n",
    "PostedDate": "2008-12-22T06:05:35.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]