[
  {
    "Id": "990150",
    "ThreadId": "430385",
    "Html": "\r\n<p>I don't know if this is possible or not: i have a Navigation Region that is populated with View_A (via ViewExport) @ program Start up from which i can select an item so its details will be displayed in main region. But now i want to put TabControl in the\r\n Navigation region with many TabItems each tab will caontain diffrent View: View_A, View_B, .... so i can use multiple control panels. So can i programmatically assign View_A to Tab_A and View_B to Tab_B ... so i can switch navigation panels. Thanks in advance</p>\r\n<p>Note: each view has its view model imported in the code behind</p>\r\n",
    "PostedDate": "2013-01-22T00:55:06.61-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "990417",
    "ThreadId": "430385",
    "Html": "\r\n<p>Hi,</p>\r\n<p>Based on my understanding of your scenario, If you are adding a <strong>TabControl\r\n</strong>with several Tab Items to your <em>Navigation Region</em>, I believe you could try defining a different region in each of your Tab Items, this way you could registered each\r\n<strong>View </strong>to its corresponding region in one of these Tab Items for example using the\r\n<strong>ViewExport </strong>attribute approach.</p>\r\n<p>On the other hand, if you are defining the region in your <strong>TabControl </strong>\r\nand you need to specify the order on how the views will appear in this region, I believe you could benefit of the\r\n<strong>ViewSortHint </strong>attribute provided with <strong>Prism</strong>, which could also be used with the\r\n<strong>ViewExport </strong>attribute. For more information about this you could check the following section of the documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/ff921098(v=pandp.40).aspx#sec40\">Ordering Views in a Region</a>\r\n</li></ul>\r\n<p>I hope you find this handy,</p>\r\n<p>Agustin Adami<a href=\"http://blogs.southworks.net/aadami\"><br>\r\nhttp://blogs.southworks.net/aadami</a></p>\r\n",
    "PostedDate": "2013-01-22T09:29:04.8-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "990504",
    "ThreadId": "430385",
    "Html": "\r\n<p>Hi aadami,</p>\r\n<p>Thank you very much, you understand the problem and give easy solution. now i know where to ask my question if i need right and&nbsp;easy answer.</p>\r\n<p>thanks and i hope you will be always around.</p>\r\n",
    "PostedDate": "2013-01-22T12:17:55.397-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]