[
  {
    "Id": "1006775",
    "ThreadId": "434505",
    "Html": "Hi\r<br />\nI have a strange problem, that i can't figure it out..\r<br />\nI am building a composite WPF application using prism. for that i am using UnityBootstrapper for using the UnityContainer, and using Region Manager that passed threw all modules to render the UI parts to the main shell.\r<br />\neverything is working good.\r<br />\n<br />\nBut, when i'm replacing all my WPF base controls to DEVExpress controls.\r<br />\ni notice that everytime the &quot;region manager&quot; instance is passed to each Module constructor, it comes empty..\r<br />\nI asked few people that told me build an adapter to every 3rd pary control, i did so, and still the region manager comes empty.\r<br />\n<br />\nBut what is more strange, that despite it seems that the region manager don't register nothing to the regions, All the views are injected correctly to the views in the shell..??!!<br />\n(the _regionManager remains empty even after i register view to it:  _instance = _container.Resolve&lt;InstanceBody&gt;();  _regionManager.RegisterViewWithRegion(&quot;Body&quot;, () =&gt; _instance); )<br />\n",
    "PostedDate": "2013-02-26T01:19:24.127-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1007130",
    "ThreadId": "434505",
    "Html": "Hi,\r<br />\n<br />\nSeveral users in the past had reported incompatibility issues between <strong>Prism</strong> regions and <strong>DevExpress</strong> controls. In this case, I believe the problem could be related to the fact that some <strong>DevExpress</strong> controls do not inherit from <a href=\"http://msdn.microsoft.com/en-us/library/system.windows.frameworkelement.aspx\" rel=\"nofollow\">WPF's FrameworkElement</a> class:\r<br />\n<br />\nBased on my understanding, after <strong>Prism</strong> creates a region it tries to register it in the corresponding <strong>RegionManager</strong> . To find it, <strong>Prism</strong> will try to &quot;climb up&quot; the <strong>visual tree</strong> until it finds an attached <strong>RegionManager</strong> object in a control (for example, the <strong>RegionManager</strong> attached to the shell window.) However, in order to do so, <strong>Prism</strong> requires that all the components in the visual tree inherit from <strong>FrameworkElement</strong> . If a non <strong>FrameworkElement</strong> is found in the visual tree, <strong>Prism</strong> is not able to keep &quot;climbing up;&quot; hence, it won't be able to find a <strong>RegionManager</strong> to register the region. As a result, the <strong>RegionManager</strong> does not contain the regions. As an example, this behavior is also happens when using <a href=\"http://msdn.microsoft.com/en-us/library/system.windows.datatemplate.aspx\" rel=\"nofollow\">DataTemplates</a> as they do not inherit from <strong>FrameworkElement</strong> either.\r<br />\n<br />\nAs far as I know, the reason why the views are still being shown is that <strong>Prism</strong> is able to create the regions (which could mean that your <strong>RegionsAdapters</strong> are working correctly) and that any view registered in a region is added when the region is created, without requiring to use the <strong>RegionManager</strong> , so their are not affected by this issue.\r<br />\n<br />\nAs a possible workaround, I believe you could try using an approach described in the following blog post to work around this same behavior when using <strong>DataTemplates</strong> :<br />\n<ul>\n<li>\n<a href=\"http://blogs.southworks.net/dcherubini/2011/11/10/regions-inside-datatemplates-in-prism-v4-using-a-region-behavior/\" rel=\"nofollow\">Regions inside DataTemplates in Prism v4 using a region behavior</a><br />\n</li>\n</ul>\nI hope you find this useful,\r<br />\n<br />\nDamian Cherubini\r<br />\n<a href=\"http://blogs.southworks.net/dcherubini\" rel=\"nofollow\">http://blogs.southworks.net/dcherubini</a><br />\n",
    "PostedDate": "2013-02-26T10:57:35.577-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]