[
  {
    "Id": "1024838",
    "ThreadId": "438948",
    "Html": "Hi,\r<br />\n<br />\nI was working in windows application where we were using PRISM framework to maintain modular architecture. Planning was that modules will be developed separately and will injected in Main application to Unity IoC container.\r<br />\n<br />\nBut recently I got a planning, that we need to develop the application for web platform, having same feature. i.e. the Base application will be hosted only once. Later as time goes modules will be separately developed and will be uploaded and injected to Base application, and Base application would have such capabilities to execute those modules.\r<br />\n<br />\nAfter googling I found many IoC containers are available, which can be work in Web platform.\r<br />\n<br />\nActually PRISM provide whole infrastructure to work in Modular approach using WPF windows app. Is there any framework like PRISM for Web applications?, i.e. for ASP.net MVC3 or MVC4.\r<br />\n<br />\nI cannot use Silverlight.\r<br />\n<br />\nWith Regards\r<br />\nKishore K<br />\n",
    "PostedDate": "2013-04-03T06:42:45.823-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1025478",
    "ThreadId": "438948",
    "Html": "Hi,\r<br />\n<br />\nI'm not a aware of any framework like Prism which could be oriented to Web applications scenarios, since Prism is only oriented to Client-Side applications. Nevertheless, I think you would be interested in Project Silk. It may not be a framework, but it has helpful guidelines with good practices on how to develop a Web application using some Prism features, like Modularity and Navigation:<br />\n<ul>\n<li>\n<a href=\"http://silk.codeplex.com/\" rel=\"nofollow\">Project Silk</a><br />\n</li>\n</ul>\nRegards,\r<br />\n<br />\nFederico Martinez \r<br />\n<a href=\"http://blogs.southworks.net/fmartinez\" rel=\"nofollow\">http://blogs.southworks.net/fmartinez</a><br />\n",
    "PostedDate": "2013-04-04T09:17:46.857-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]