[
  {
    "Id": "1028592",
    "ThreadId": "439822",
    "Html": "Hi Prism Experts,<br />\nI tried several times, again and again to customize the code in this application <a href=\"http://jibgridwpf.codeplex.com/\" rel=\"nofollow\">http://jibgridwpf.codeplex.com/</a><br />\nto use it with my MVVM-Prism-MEF LOB application where my DataGrid reside in the view and its columns generated manually and its ItemsSource is observableCollection in ViewModel, ...<br />\n<br />\nI added all classes into a folder called Filter in my Infrastructure layer to be available to all DataGrids in all Modules<br />\nThe modifications i did are:<br />\n<pre><code>1-i added the code to the common / Infrastructure layer\n2-i added ColumnFilterControl in my DataGridStyle.xaml file in DataGridColumnHeader and i use this\n  style for all my grids so ColumnFilterControl  will appear automatically in column headers\n3-i merged JibGrid.xaml code into my DataGridStyle.xaml so no DataGridStyle.xaml file any more\n                 (note: i can't use JibGrid as it is in my application because i need to build my DataGrid manually\n                  in the View and add CRUD processes in view model, ....)\n4-i used JibGrid.xaml.cs as stand alone class which will be referenced in my View Model and the \n   View Model will delegate the requests to it then it will handle them as it did in the original\n       application\n</code></pre>\n\ni'm trying for days, but i couldn't get it running so please i need your help to customize this code as you did in many other<br />\nsituations before.<br />\nThanks in advance.<br />\n",
    "PostedDate": "2013-04-10T11:10:45.503-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1028648",
    "ThreadId": "439822",
    "Html": "Hi,\r<br />\n<br />\nIt would be useful if you could provide us with more information about what you are trying to achieve, so that we can have a better understanding of your scenario in order to help you with your concerns. Also, it would be useful to know with kind of problem you are experiencing (the application is not compiling, a style is not being applied, a module fails loading, etc.)\r<br />\n<br />\nRegards,\r<br />\n<br />\nDamian Cherubini\r<br />\n<a href=\"http://blogs.southworks.net/dcherubini\" rel=\"nofollow\">http://blogs.southworks.net/dcherubini</a><br />\n",
    "PostedDate": "2013-04-10T13:04:41.293-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1028684",
    "ThreadId": "439822",
    "Html": "Hi Damian,\r<br />\nAfter the above modifications the ColumnFilterControl   appear in each column Header of my Grid but:\r<br />\n1-the images for filter operations doesn't show up in cbOperation combo box and distinct properties don't show up in cbDistinctProperties and Filter text \r<br />\n   box not working.\r<br />\n2-i modified JibGrid to be stand alone class (no xaml code) but still inheriting from DataGrid class which will be referenced in the View Model which will delegate <br />\n   requests to it. i need to now the new class structure\r<br />\n3-the interaction between the new JibGrid.cs class and ColumnFilterControl   i can't figure out.\r<br />\n<br />\nSo if you allow me, what i need is to modify this application like this:<br />\n<pre><code>1-transform Jib.WPF.Controls project into Infrastucture module contains same items with the previous modifications\n2-the project Jib.WPF.Testbed to be the MEFBootstrapper module with replacing MainWindow.xaml by MainView.xaml which will contain the data grid with\n   its columns generated manually and no code behind and MainViewModel.cs which is the view model for the  MainView.xaml  and which will interact with the \n   view and Filtering classes\n3-using MEF </code></pre>\n\nNote: the ItemsSource for DataGrid is ObservableCollection in the view model which is populated of data from database via services.\r<br />\n<br />\nthis way i can use this filter utility within MVVM, Prism rules and i can reuse it for any datagrid easily.\r<br />\nSorry, if i'm asking too much but i tired really hard to apply the above modifications but i couldn't make it work, so i count very much on you.\r<br />\nThanks.<br />\n",
    "PostedDate": "2013-04-10T13:56:51.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1029122",
    "ThreadId": "439822",
    "Html": "Hi Prism Experts,\r<br />\nCould you help me about this issue please?<br />\n",
    "PostedDate": "2013-04-11T10:38:55.427-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1029181",
    "ThreadId": "439822",
    "Html": "Hi Prism Experts, \r<br />\nCould you help me about this issue please?<br />\n",
    "PostedDate": "2013-04-11T12:42:03.103-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1029191",
    "ThreadId": "439822",
    "Html": "Hi,\r<br />\n<br />\nWhat you are describing seems to be a really complex customization of the <strong>JibGrid</strong> control logic and for an specific scenario.  Could you provide us with a sample solution of what you are trying to do that we can use as a starting point? This would allow us to analyze the customized code and help us give you feedback about it.\r<br />\n<br />\nThanks,\r<br />\n<br />\nDamian Cherubini\r<br />\n<a href=\"http://blogs.southworks.net/dcherubini\" rel=\"nofollow\">http://blogs.southworks.net/dcherubini</a><br />\n",
    "PostedDate": "2013-04-11T13:01:49.67-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]