[
  {
    "Id": "147961",
    "ThreadId": "44458",
    "Html": "We have been using Prism v2 in our project since last two months. We found that having two diffenent User Controls &quot;Views&quot; for WPF and Silverlight is really bad since we already need to remember to update in two files for the same thing when we are doing the bug-fixing or mataince. I know that style, controls can be shared but I really think that sharing those files should be really great.. ",
    "PostedDate": "2009-01-17T10:53:39.88-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "147992",
    "ThreadId": "44458",
    "Html": "Michael,<br>\r\n<br>\r\nThere is a way to enable this linking, but it won't happen by default.&nbsp; In the project file that is linked (the one that has the link entries), if you edit the file in a text editor you will find the exclude filter at the end of the file.&nbsp; We don't currently have a nice properties page or dialog on top of this, but you should be able to enable xaml files to be synced if you wish.<br>\r\n<br>\r\n-b \r\n",
    "PostedDate": "2009-01-17T13:58:36.437-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148191",
    "ThreadId": "44458",
    "Html": "<p>Hello,</p>\r\n<p>Thanks.</p>\r\n<p>We are not able to install the Project Linker in our machines but we are happy with linking the classes manually for the time being. so, linking file manually or by Project linker is not a problem. But we do need to have #Silverlght tag that we can use for checking whether we are running Silverlight or WPF. For example: We are using third-party datagrid in WPF and the build-in Datagrid in Silverlight. So, we are looking for something like </p>\r\n<p>&lt;!-- #Silverlight </p>\r\n<p>&lt;data:DataGrid ......... /&gt;</p>\r\n<p>&lt;!-- #WPF</p>\r\n<p>&lt;xceed:XceedDatagrid .... ./&gt; </p>\r\n<p>Is it possible to do that?</p>\r\n<p></p>\r\n<p></p>\r\n<p></p>\r\n<p></p>\r\n<p></p>\r\n",
    "PostedDate": "2009-01-18T19:23:13.807-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "148799",
    "ThreadId": "44458",
    "Html": "Michael,<br>\r\n<br>\r\nI'm not aware of anything like this.  The teams are working to close some of the differences with things like the WPF and Silverlight toolkits, so you might check these out to see if it will help.   Some of the things in here are previews, so may not be far enough along to support your current needs.<br>\r\n<br>\r\n-b<br>\r\n",
    "PostedDate": "2009-01-20T10:06:12.133-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]