[
  {
    "Id": "1050852",
    "ThreadId": "445506",
    "Html": "Hi,\r<br />\n<br />\nI have read the chapter 2 of online Prism documentation &quot;Initializing Prism Applications&quot; and got more confused.  From what I understood so far is that I need to take all the steps of initialization in order to start developing WPF applications or to run them.<br />\n\r<br />\nThe application that I am developing is going to be with only one Module - in other words it's not very large.  But I though I would like to follow Prism's guidances as I will be developing with MVVM pattern and using concepts such as Commands, behaviours, Navigation with Prism libraries would make my development easier and better.\r<br />\n<br />\nBut my question is do I need to go though all the Prism Initialization steps (including creating Module Catalogs, Containers etc) as I will not be using things such as Modules ?\r<br />\n<br />\nThank you<br />\n",
    "PostedDate": "2013-05-30T13:40:39.27-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1051182",
    "ThreadId": "445506",
    "Html": "Hello Alex,\r<br />\n<br />\nIn your post you say that your application will use &quot;one Module&quot;.\r<br />\nAnd later that you do not need ModuleCatalog or Container because you &quot;will not be using things such as Modules&quot;.\r<br />\n<br />\nThe initialization steps can be simplified by using a personnal class inheriting from Bootstrapper.\r<br />\nYou'll just have to override 3 methods and your application will be ready to go.\r<br />\n<br />\nSincerely,\r<br />\nLinvi<br />\n",
    "PostedDate": "2013-05-31T05:34:46.927-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1051252",
    "ThreadId": "445506",
    "Html": "Thanks for your reply Linvi,\r<br />\n<br />\nCan I confirm few points please:\r<br />\n<br />\nI do Not need to create Modules in order to use other Prism library classes (This is so that as I mentioned my app is not going to be very large and hence don't need Modules, Or would you rather suggest to have just a one Module) ?\r<br />\n<br />\nI was also suggested to use MVVM Light toolkit.  Then I have found there is at least another called ReactiveUI.  From what I understood by doing little online research It seems that Prism library is more robust and thouroughly tested.\r<br />\n<br />\nCould you please provide your thoughts on the above points ?<br />\n",
    "PostedDate": "2013-05-31T08:38:52.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1051344",
    "ThreadId": "445506",
    "Html": "Hi Alex,\r<br />\n<br />\nAs Linvi mentioned, to start a simple <strong>Prism</strong> application you only need to override a couple of methods in your <strong>Bootstrapper</strong> class and configure the application accordingly. You can find a sample of this in the <strong>Hello World Quickstart</strong>, which you might find useful as a starting point.\r<br />\n<br />\nAlso, you can create a <strong>Prism</strong> application without requiring using modules. In such case all the components will be contained in your main application project or in class libraries directly referenced by it.\r<br />\n<br />\nRegards,\r<br />\n<br />\nDamian Cherubini\r<br />\n<a href=\"http://blogs.southworks.net/dcherubini\" rel=\"nofollow\">http://blogs.southworks.net/dcherubini</a><br />\n",
    "PostedDate": "2013-05-31T12:34:46.233-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1052271",
    "ThreadId": "445506",
    "Html": "Thank Damian,\r<br />\n<br />\nI think I need to go through the quick starts and see how it works first.  One thing I've noticed that perhaps not many people using Prism as the traffic here is not very busy.<br />\n",
    "PostedDate": "2013-06-03T11:02:07.663-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]