[
  {
    "Id": "1063462",
    "ThreadId": "448787",
    "Html": "Hi,\r<br />\nwe are struck in an issue while Binding the Textblock with a value and progressbar Value .\r<br />\n<br />\nwe have a wpf shell app , wherein we need to show a dialog which has Textblock showing the %percentage,Progressbar ,Ok,Cancel etc .\r<br />\nClicking on Button (ok} will start a DB call and once DB helper publishes this event , This dialog viewmodel subscribes it and assign the value returned from DBHelper to ViewModel.ProgressVale property , as well as ViewModel.PercentComplet property. The issue is The property has value and it is INotified as well. \r<br />\nI am feeling the issue is with DataContext , We are using InteractionRequest to open the dialog and passing the Viewmodel. I guess the viewmodel is not updated or the DataContext is not refreshed.\r<br />\nplease need urgent help to sort this issue out. let me know if my understanding is correct or I am missing anything .Thanks again\r<br />\n<br />\nKrishna<br />\n",
    "PostedDate": "2013-07-02T00:24:57.433-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1063692",
    "ThreadId": "448787",
    "Html": "Hi,\r<br />\n<br />\nBased on my understanding, <strong>Prism</strong> does not provide a popup action for <strong>WPF</strong> as out-of-the-box. Therefore, it would be useful if you can provide us with more information on how you implemented this functionality and how you are passing the <strong>ViewModel</strong> to the dialog. \r<br />\n<br />\nRegarding the issue with the progress bar, I recommend you to check if your <strong>ViewModel</strong> is implementing <strong>INotifyPropertyChanged</strong> and you are refreshing the view each time one of the properties is modified.\r<br />\n<br />\nRegards,\r<br />\n<br />\nFederico Martinez \r<br />\n<a href=\"http://blogs.southworks.net/fmartinez\" rel=\"nofollow\">http://blogs.southworks.net/fmartinez</a> <br />\n",
    "PostedDate": "2013-07-02T09:57:43.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]