[
  {
    "Id": "1103914",
    "ThreadId": "461230",
    "Html": "Hey Guys,<br />\nI'm trying to compose a windows phone 8 app with Prism and Ninject or even better Unity. I'd like to make it fully MVVMble to do two things. A StepByStep Guide for absolute beginners, because I think learning it the wright way from the start is a very good thing.<br />\nAnd I'd like to do a sample for our Barcode scanner Project <a href=\"http://zxingnet.codeplex.com\" rel=\"nofollow\">http://zxingnet.codeplex.com</a> with Prism for Windows Phone 8.<br />\n<br />\nmy Enterprise App for WP8 <a href=\"http://www.windowsphone.com/en-us/store/app/asset-manager/dbebad1a-327a-479e-a88b-728df5b12126\" rel=\"nofollow\">http://www.windowsphone.com/en-us/store/app/asset-manager/dbebad1a-327a-479e-a88b-728df5b12126</a> also needs some more stability, maintainability and extendability. And I think I can only achieve that with composition and the wright framework :)<br />\n<br />\nI think because of the small amount if space on a tablet and even more on the phone, you deal with so many screens in comparison to e.g. WPF, that the usage of composition and reusanlility is even more important on the mobile devices than on the desktop.<br />\n<br />\nI'm also thinking about cross platform Dev with Prism for WP8 and WinRT. Could Prism help? How to structure XAML to able to reuse it?<br />\n<br />\nThank you so much for your awesome work and brainmelt in all your projects. We love you for that :) <br />\nIf you need any help with anything - don't hesitate to ask :)<br />\n",
    "PostedDate": "2013-10-05T00:39:35.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1104714",
    "ThreadId": "461230",
    "Html": "Hi Fabian\r<br />\n<br />\nI'm glad you are interested in using Prism in your project. However, based on the description of what you want to achieve I not sure how much of the current Prism library will be of help to you.\r<br />\n<br />\nFirst of all, as far as I know the latest version of the library for <strong>Windows Phone</strong> was designed to target <strong>Silverlight on Windows Phone 7.1</strong>. Therefore, some capabilities of the library might not work as out of the box. However, I believe there are parts of the library that could be taken out and used in a <strong>Windows Phone 8</strong> that you might find useful to apply in your application.\r<br />\n<br />\nSecond, the <strong>Windows Phone</strong> version is limited providing only the following functionalities:<br />\n<ul>\n<li>Support for MVVM: A base class for view models, command implementations, etc.</li>\n<li>Event aggregation to publish / subscribe events in a loosely coupled fashion.</li>\n<li>\nInteractions between view models and views.<br />\n</li>\n</ul>\nAs far as I know, it doesn't provide any functionality to compose views or manage navigation in <strong>Windows Phone</strong>, which if I understood correctly is the main functionality you are interested in.\r<br />\n<br />\nRegarding your approach of making the application cross-platform between <strong>Windows Phone 8</strong> and <strong>Windows Runtime</strong>, I don't think Prism will be of help in this case either as each version it's dependent of its corresponding platform. As far as I know, views are rarely reused between different platforms. What can be often reused between them is the logic part of the application, including view models, models, services, etc.\r<br />\n<br />\nEven so, there is a version of <strong>Prism for Windows Runtime</strong> that you might find useful for the <strong>Windows Runtime</strong> version of your application, which provides navigation functionalities, state management, etc:<br />\n<ul>\n<li>\n<a href=\"https://prismwindowsruntime.codeplex.com/\" rel=\"nofollow\">Prism for Windows Runtime</a><br />\n</li>\n</ul>\nThanks,\r<br />\n<br />\nDamian Cherubini\r<br />\n<a href=\"http://blogs.southworks.net/dcherubini\" rel=\"nofollow\">http://blogs.southworks.net/dcherubini</a><br />\n",
    "PostedDate": "2013-10-07T12:18:35.23-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]