[
  {
    "Id": "154173",
    "ThreadId": "46181",
    "Html": "Hi,<div><br></div><div>I'm completely new to all this so I find myself asking if I'm barking up the wrong tree or not.</div><div>My questions are mostly theoretical right now but I'll try and give you a real world example to see if I'm on the right page with this stuff.<br></div><div><br></div><div>Imagine you were going to create a word processor to rival Word.<br></div><div>My suggestion would be to create a shell with 2 regions (for now) the document region and a toolbar region.</div><div>You could then create module (called editor) with a view which was basically a rich textbox which got loaded into the document region.</div><div>Would you then also have modules which contained services like:</div><div><ul id=false>    <li>Spell Checking</li>    <li>Grammar Checking</li>    <li>Auto-text</li></ul></div><div>I realise that the rich textbox comes with a spell checker, but imagine you wanted to use a different (more specialised) spell checker, or even write your own.</div><div>I think the approach described above is correct as it allows you to develop the spell checker module or auto-text module in a way that is loosely coupled from the editor module.<br></div><div>If you wanted to change the way the spell checker worked you could - as long as you didn't break the contract with the editor module (presumably there is an interface in the mix somewhere).</div><div><br></div><div>Am I on the right track with this? Is this what CAL is for? or am I in danger of over-engineering the solution.</div><div>Some of the quickstarts seem to me to be more useful if you're creating a dashboard view of different legacy systems, like trying to create a thick client mashup.</div><div>What I'm looking to do is write a brand new application from scratch in a way that is designed for change, easy to maintain, etc. etc.</div><div><br></div><div>Thanks in advance for any help or advice.</div><div><br></div><div><br></div><div>MQCA.</div><div><br></div><div><br></div>",
    "PostedDate": "2009-02-04T03:30:32.127-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]