[
  {
    "Id": "1148075",
    "ThreadId": "482199",
    "Html": "Hi there:<br />\n<br />\nI want to develop my applications using Prism, and if I have to decide for a DI Container I'd choose Unity.<br />\n<br />\nI plan to study Prism using the &quot;Developer's guide to Microsoft Prism&quot;.<br />\n<br />\n<strong>Should I study Unity first using &quot;Dependency Injection with Unity&quot; book?</strong><br />\n<br />\nI don't know much about DI, but I guess that by studying Unity I'll get the DI knowledge I need.<br />\n<br />\nI'm interested in adopting the MVVM pattern, but I also think that by studying Prism I'll get the guidance I need to develop applications with the MVVM approach.<br />\n<br />\nI have studied <strong>Wpf</strong>, Binding, Resources, DataContext, styles, etc, I know what the MVVM pattern is, and <strong>I've been trying to develop a good application template for the MVVM arquitecture</strong>, but I don't feel comfortable with it, the Josh Smith model is a little complicated, and the others are too simplistic.<br />\n<br />\nAm I right with my guesses, or I'm wrong with one of them?<br />\n<br />\n<strong>What do you suggest me to study from here?</strong>, I think that I've explained what my intensions are for you to give me some advice, but feel free to ask if you need to know something else<br />\n<br />\nRafael<br />\n",
    "PostedDate": "2014-01-04T15:03:18.033-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1150052",
    "ThreadId": "482199",
    "Html": "Hi Rafael,\r<br />\n<br />\nI believe that you might find useful to study about <strong>Unity</strong> to understand how dependency injection works and what is happening when resolving an instance using a dependency injection container. This will help you know how to register and resolve types using the container, use different methods to configure it and tackle most issues you might find when managing components.\r<br />\n<br />\nHowever, this is not strictly required to start using Prism. The documentation (which you can find only <a href=\"http://msdn.microsoft.com/en-us/library/gg406140.aspx\" rel=\"nofollow\">here</a>) includes some basic examples of how to register and resolves types to be used in Prism. It also includes guidance regarding MVVM, specially in chapters 5 and 6, that you might find interesting to read before starting with a Prism application (this again, is not required.)\r<br />\n<br />\nBased on my experience, I would not recommend to read the entire documentation in one sit, but to go through it while trying to practice anything you wish to learn using small spikes to settle the topics. Also, the <strong>QuickStarts</strong> included with the library can be very helpful for this.\r<br />\n<br />\nI hope this helps.\r<br />\n<br />\nDamian Cherubini\r<br />\n<a href=\"http://blogs.southworks.net/dcherubini\" rel=\"nofollow\">http://blogs.southworks.net/dcherubini</a><br />\n",
    "PostedDate": "2014-01-06T10:39:12.373-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1150097",
    "ThreadId": "482199",
    "Html": "Hi Damian:\r<br />\n<br />\nThank you for answering.<br />\n",
    "PostedDate": "2014-01-06T11:49:21.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]