[
  {
    "Id": "162618",
    "ThreadId": "48699",
    "Html": "Hi,<br>\r\n<br>\r\nIs it possible to create multi-page application with Prism? Each page should have its own region configuration and sometimes its own template (aka shell).<br>\r\n<br>\r\nBest regards,<br>\r\nAlexey Zakharov.<br>\r\n",
    "PostedDate": "2009-02-26T23:29:42.183-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "163735",
    "ThreadId": "48699",
    "Html": "hello,<br>\r\nim also quite new to prism but from what i understand you could create a custom window manager and then create a RegionAdapter/RegionBehavior that places views in new windows when they are added to the reagion.<br>\r\n<br>\r\nim currently working on a RegionAdapter for the ribbon control that allows views to just provide one a bunch of ribbon tabs and then have the shell compose the ribbon from that.. the api for regionadapters is pretty cool i gotta say :)<br>\r\n<br>\r\nif you mean completly separare region managers in diffrent windows, there appears to be something called region scope that might be worth checking out.. im not sure how it works yet but it seems useful for multi layer composition, like if a view is a in it self a shell that has sub views (please correct me on this if im wrong :) )<br>\r\nyou can read about scoped regions here: <a href=\"http://msdn.microsoft.com/en-us/library/dd458944.aspx\">http://msdn.microsoft.com/en-us/library/dd458944.aspx</a> (pretty far down, searching for it is easiest)\r\n",
    "PostedDate": "2009-03-03T01:13:15.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "188357",
    "ThreadId": "48699",
    "Html": "<p>Hi aL3891,</p>\r\n<p>i'm currently looking at a regionAdapter for ribbon control and I would like to know how your evolve ?</p>\r\n<p>with prism 2 should I look more on region behavior than the regionAdaptor ?</p>\r\n<p>&nbsp;</p>\r\n<p>S-P</p>",
    "PostedDate": "2009-05-08T19:10:31.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]