[
  {
    "Id": "164377",
    "ThreadId": "49197",
    "Html": "I've been searching the forums and google for a while now and I've seen some people ask the same type of question, but only get partial responses for the most.  I am looking for a very simple sample application that does the following:<br>\r\n<br>\r\n1. Dynamically generates a list of modules (directory based) and adds each one to the shell as a &lt;MenuItem&gt;<br>\r\n2. When the menu item is clicked displays the primary view of that module in the main region of the application.<br>\r\n<br>\r\nFrom what I have gathered I should implement the IEventAggregator interface to publish/subscribe to the MenuItems click event, but I am really not sure where to start.  I've looked through the quickstarts provided with the Prism v2 drop and I can't seem to figure out what I need to be doing. <br>\r\n<br>\r\nMy proof of concept project consists of the shell, and infrastructure, and 2 modules.  The shell has a &lt;Menu&gt; with a region on the 'View' MenuItem (this is where i want to load my list of Modules) and it has a main region (This is where I want to load my modules primary view when the MenuItem is clicked).<br>\r\n<br>\r\nTo help visualize what I am trying to do imagine Outlook being written as a WPF Prism application.  The Navigation Pane has an entry for each Module (Mail, Calendar, Contacts, Tasks).  Each Module has a list of available Views (Mail &gt; Deleted items, Drafts, Inbox, Junk Mail, etc).  When you click on one of the Views it gets injected into the Main viewing pane and the views available commands are injected into the &lt;ToolBarTray&gt; area at the top.<br>\r\n<br>\r\nI know this is possible, and I can't image it would be to hard to do once I saw someone else implement it... but the logic of writing this from scratch is eluding me.<br>\r\n<br>\r\nDoes anyone know of any such projects that are available for download that I could use as a baseline to get my head around the concept?<br>\r\n<br>\r\nThanks a ton, I appreciate anything from a nudge in the right direction to a full blown example.\r\n",
    "PostedDate": "2009-03-04T08:51:06.3-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "164385",
    "ThreadId": "49197",
    "Html": "Nick,<br>\r\n<br>\r\nCheck out <a href=\"http://blogs.msdn.com/erwinvandervalk/archive/2009/03/02/how-to-build-an-outlook-style-application.aspx\">Erwin's post on Outlook styl</a>e applications.&nbsp; There's a bit in there that has a navigation piece that is similar to what you're trying to do with menus, although it's not with menus directly.&nbsp; It may get you pointed in the right direction.&nbsp; <br>\r\n<br>\r\n-b<br>\r\n",
    "PostedDate": "2009-03-04T09:06:01.043-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]