[
  {
    "Id": "183385",
    "ThreadId": "54406",
    "Html": "Our team has recently started a medium/large sized application using Composite WPF and it's very hard to give constructive feedback when we like all of it so much!  Nothing short of beautiful witchcraft!<br>\r\n<br>\r\nOne suggestion I have though, is with the &quot;Getting Started&quot; tutorials, documentation and reference implementation samples. As simple as they all seemed after just a few hours of working with the libraries, they were all a huge instant turn off to anyone I showed it to that was not a level 61 BSG lovin' geek.  It surely wasn't there that anyone had an &quot;ah, ha!&quot; moment where understanding of Prism just &quot;clicked&quot;.   But after watching the video tutorials (<a href=\"http://compositewpf.codeplex.com/Wiki/View.aspx?title=Learn Prism\">http://compositewpf.codeplex.com/Wiki/View.aspx?title=Learn%20Prism</a>), everything came together.  Fantastic eye opener!  It is analogous to those 80's movies, where there is a nerdy and unpopular girl in high school, but when she takes off her glasses, she's a prom queen.  So please, any new tutorials that you guys do, an accompanying video to go with it does wonders for lots of people.<br>\r\n<br>\r\nAnother suggestion, is we, and after searching the internet, and many others' biggest problem is generally handling Regions/Views and I don't think your samples get far enough in depth.  It can be difficult to figure out cases where an application needs pretty dynamic UI.  Take this for instance:  A shell with a a &quot;MainView&quot; IRegion that takes up the entire screen.  MainView may want to show a small splash animation exisiting in one module, then do a visual transition to a LoginView in another module.  When authenticated, LoginView transitions away and shows a Dashboard split up into many IRegions, which may show many views, like graphs and other boring business data.  We accomplished this with a custom ContentControl and a region adaptor to do the regions with transitions, but all this was, again, not very obvious.  So it would be great if there were a more advanced sample on advanced handling of Regions/Views.<br>\r\n<br>\r\nAnyways, thanks again for the wonderful PnP library.  I don't think I'll ever WPF w/o it ;)<br>\r\n<br>\r\n-Jeremiah Morrill \r\n",
    "PostedDate": "2009-04-24T13:19:28.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]