[
  {
    "Id": "184210",
    "ThreadId": "54636",
    "Html": "<p><span style=\"font-size:11pt;font-family:'calibri','sans-serif'\">Hi, not sure if this is the right place, but here\r\ngoes...&nbsp;&nbsp; We are about to rewrite the UI layer of our flagship LOB\r\napplication. It all ASP.Net, screens of moderate complexity, composed\r\nof half a dozen modules which encapsulate some fairly complex business\r\nlogic.&nbsp; I ‘believe’ i want to go the Composite UI route. I’ve been\r\nlooking at the P&amp;P guidance and discovered a reference to the\r\n‘Composite Web Application Block’.&nbsp; However, there is of course, the\r\nnewly released ‘Composite App Guidance for Silverlight (PRISM)’.&nbsp;&nbsp; Now\r\ngiven we don’t need necessarily need all the ‘flash’ of a Silverlight\r\napp, is there any reason *<strong>not</strong>* to go with Silverlight anyway?&nbsp;\r\nFrom what i can tell, the PRISM stuff is a cleaned up (and easier to\r\nuse) implementation of the composite patterns that are contained in\r\nCWAB.&nbsp; I guess stated another way, does it make sense in our case to\r\nuse Silverlight for its P&amp;P value even if we don’t have a very RIA\r\nrequirement? &nbsp;</span></p>\r\n<p><span style=\"font-size:11pt;font-family:'calibri','sans-serif'\">Another\r\nquestion with respect to availability of resources. Given the relative\r\nnewness of Silverlight, is it reasonable to assume that a proficient C#\r\ndeveloper learn Silverlight without too much trouble? <br>\r\n</span></p>\r\n<p><span style=\"font-size:11pt;font-family:'calibri','sans-serif'\">Thanks, </span></p>\r\n<p><span style=\"font-size:11pt;font-family:'calibri','sans-serif'\">Steph.</span></p>\r\n",
    "PostedDate": "2009-04-27T13:05:42.517-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "184298",
    "ThreadId": "54636",
    "Html": "Steph,<br>\r\n<br>\r\nI think this is more of a business question rather than a technical one - especially because this is your company's flagship product. Some things you'll want to consider:<br>\r\n<br>\r\n<ol>\r\n    <li>What requirements is your company willing to require your clients to adhere to? If you use Silverlight/Prism, then Silverlight is an additional requirement.</li>\r\n    <li>What browsers are you currently targeting - check out this page for supported environments: <a href=\"http://www.microsoft.com/silverlight/resources/install.aspx#sysreq\">http://www.microsoft.com/silverlight/resources/install.aspx#sysreq</a></li>\r\n    <li>How much time have you set aside for rewriting the UI, business logic, regression testing, etc?</li>\r\n</ol>\r\n<p>Regarding #1 &amp; #2, companies (and especially marketing departments inside companies) like to keep the requirements to a bare minimum and support as many as environment permutations as possible - so they can sell to as many people as possible. Depending on how you look at it, Silverlight could increase or decrease the reach of your application. For instance, the company I work for only certifies applications for IE; however, if we write an application in Silverlight/Prism, we know it'll work in Safari on OS X - so we can certify the app for that environment. But we also know it won't work on any browser running on a linux machine (because Moonlight is only at v1.0 in linux). Conversely, we know that if we spend enough time working with CSS &amp; JavaScript we can get an ASP.NET web app working equally well across, IE, FF, Safari, Konquerer, etc on any OS - so we could certify it on those environments only if we don't use Silverlight. So like I said, it depends on how you look at it.<br>\r\n<br>\r\nRegarding #3, Silverlight's only mechanism for for CRUD operations is via web services. Having said that, you'll probably have to make a pretty significant investment to develop and test web services that handle your application's business logic if it doesn't already use web services.<br>\r\n<br>\r\nNow that I've scared you away, I would absolutely recommend using Silverlight/Prism and the MVVM or MVP pattern. There will be probably a 2-4 week ramp up period to get used to Silverlight and Prism if you have no experience with those technologies. However, it's well worth the investment because the code you write is more modular, maintainable, testable, and overall in general higher quality. Silverlight is great too because you're able to work with the actual business objects in a stateful manner as opposed to the traditional stateless, disconnected method of ASP.NET web apps. Ever since I began working with Silverlight/Prism at the end of February, I go out of my way to avoid ASP.NET!<br>\r\n<br>\r\nHopefully this helps you out with some things to discuss with stakeholders/business advocates. If you ask the questions I posed earlier and the answers don't prohibit the use of Silverlight, then don't even think twice about it - just go for it. The developers will be happier, the QA folks will be happier, and the business will be happier in the long run when it realizes how modular the application you built is and how easily you can enhance it with new functionality.<br>\r\n<br>\r\nLet me know if you have any other specific questions. Also, the Microsoft guys are really great answering questions here, so don't be afraid to ask if you want guidance on how to do something or run into a roadblock.<br>\r\n<br>\r\nRyan</p>\r\n",
    "PostedDate": "2009-04-27T18:07:43.723-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185045",
    "ThreadId": "54636",
    "Html": "\r\n\r\n<div class=Section1>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">Hello, </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\"> </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">First of all, thank you very much for this excellent feedback. In\r\nour particular case we really have only one internal client (we’re a government\r\ncrown corp), so I’m happily insulated from most of the strategic revenue model\r\nconsiderations you’ve outlined in the first part. On the technology side, we’re\r\nheavily invested in the whole Microsoft line.  Everybody runs XP with IE as the\r\nonly officially supported browser and we do all our development with .net.  This\r\nmay change of course, as the business has been indicating they’d like to have\r\nsome occasionally connected support for mobile devices. </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\"> </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">Now, since we don’t make our living selling product, we are accustomed\r\nto certain luxuries when it comes to software development, time to do things ‘correctly’\r\nto the best of our ability being one of them. We’ve spent a great deal of time cultivating\r\na very solid object model of our domain, which is where I consider my area of\r\nexpertise to be.  Lately I’ve been pulled into re-architecting discussions on\r\nthe UI side, which is a bit of a foreign land to me. My starting point is best\r\npractices, which led me to PRISM and Silverlight. I’m really stoked by what you\r\nsaid about the support for modularity, testability etc. as I can directly\r\nrelate these concepts and their benefits to the success we’ve experienced in\r\nour domain model work. </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\"> </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">I’m inspired by what you had to say about the satisfaction you’ve\r\nbeen deriving since starting to use Silverlight. That said, I’m still concerned\r\nabout one thing. Our users enjoy relatively unfettered control over their experience.\r\nThat is to say, when interacting with the app they can save to locally to disk,\r\nprint what they need to etc. My understanding of Silverlight is that it’s\r\npretty much restricted to a sandbox where doing these things is not easily achieved.\r\nAm I correct? I suppose if I thought about it long enough I could architect a\r\nway around this limitation but I’m wondering if this constitutes an abuse of this\r\nparticular technology. I understand silverlight can be used on LOB apps, but\r\nfrom a practitioners perspective could you tell me if I’m still on the right\r\ntrack here? </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\"> </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">Thanks again, </span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\">Steph.</span></p>\r\n\r\n<p class=MsoNormal><span style=\"font-size:11.0pt;font-family:'Calibri','sans-serif';color:#1F497D\"> </span></p>\r\n\r\n<div>\r\n\r\n<div style=\"border:none;border-top:solid #B5C4DF 1.0pt;padding:3.0pt 0cm 0cm 0cm\">\r\n\r\n<p class=MsoNormal><b><span lang=EN-US style=\"font-size:10.0pt;font-family:'Tahoma','sans-serif'\">From:</span></b><span lang=EN-US style=\"font-size:10.0pt;font-family:'Tahoma','sans-serif'\"> rgraham [mailto:notifications@codeplex.com]\r\n<br>\r\n<b>Sent:</b> Monday, April 27, 2009 9:08 PM<br>\r\n<b>To:</b> Steph Swierenga<br>\r\n<b>Subject:</b> Re: technology decision [CompositeWPF:54636]</span></p>\r\n\r\n</div>\r\n\r\n</div>\r\n\r\n<p class=MsoNormal> </p>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\">From:\r\nrgraham</span></p>\r\n\r\n<div style=\"margin-bottom:24.0pt\" id=ThreadNotificationPostBody>\r\n\r\n<p class=MsoNormal style=\"margin-bottom:12.0pt\"><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\">Steph,<br>\r\n<br>\r\nI think this is more of a business question rather than a technical one -\r\nespecially because this is your company's flagship product. Some things you'll\r\nwant to consider:</span></p>\r\n\r\n<p class=MsoNormal style=\"margin-left:36.0pt;text-indent:-18.0pt\"><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\"><span style=\"\">1.<span style=\"font:7.0pt\">   \r\n</span></span></span><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\">What\r\nrequirements is your company willing to require your clients to adhere to? If\r\nyou use Silverlight/Prism, then Silverlight is an additional requirement.</span></p>\r\n\r\n<p class=MsoNormal style=\"margin-left:36.0pt;text-indent:-18.0pt\"><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\"><span style=\"\">2.<span style=\"font:7.0pt\">   \r\n</span></span></span><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\">What\r\nbrowsers are you currently targeting - check out this page for supported\r\nenvironments: <a href=\"http://www.microsoft.com/silverlight/resources/install.aspx#sysreq\">http://www.microsoft.com/silverlight/resources/install.aspx#sysreq</a></span></p>\r\n\r\n<p class=MsoNormal style=\"margin-left:36.0pt;text-indent:-18.0pt\"><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\"><span style=\"\">3.<span style=\"font:7.0pt\">   \r\n</span></span></span><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\">How\r\nmuch time have you set aside for rewriting the UI, business logic, regression\r\ntesting, etc?</span></p>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif'\">Regarding\r\n#1 & #2, companies (and especially marketing departments inside companies)\r\nlike to keep the requirements to a bare minimum and support as many as\r\nenvironment permutations as possible - so they can sell to as many people as\r\npossible. Depending on how you look at it, Silverlight could increase or\r\ndecrease the reach of your application. For instance, the company I work for\r\nonly certifies applications for IE; however, if we write an application in\r\nSilverlight/Prism, we know it'll work in Safari on OS X - so we can certify the\r\napp for that environment. But we also know it won't work on any browser running\r\non a linux machine (because Moonlight is only at v1.0 in linux).\r\nConversely, we know that if we spend enough time working with CSS &\r\nJavaScript we can get an ASP.NET web app working equally well across, IE, FF,\r\nSafari, Konquerer, etc on any OS - so we could certify it on those environments\r\nonly if we don't use Silverlight. So like I said, it depends on how you look at\r\nit.<br>\r\n<br>\r\nRegarding #3, Silverlight's only mechanism for for CRUD operations is via web\r\nservices. Having said that, you'll probably have to make a pretty significant\r\ninvestment to develop and test web services that handle your application's\r\nbusiness logic if it doesn't already use web services.<br>\r\n<br>\r\nNow that I've scared you away, I would absolutely recommend using\r\nSilverlight/Prism and the MVVM or MVP pattern. There will be probably a 2-4\r\nweek ramp up period to get used to Silverlight and Prism if you have no\r\nexperience with those technologies. However, it's well worth the investment\r\nbecause the code you write is more modular, maintainable, testable, and overall\r\nin general higher quality. Silverlight is great too because you're able to work\r\nwith the actual business objects in a stateful manner as opposed to the\r\ntraditional stateless, disconnected method of ASP.NET web apps. Ever since I\r\nbegan working with Silverlight/Prism at the end of February, I go out of my way\r\nto avoid ASP.NET!<br>\r\n<br>\r\nHopefully this helps you out with some things to discuss with\r\nstakeholders/business advocates. If you ask the questions I posed earlier and\r\nthe answers don't prohibit the use of Silverlight, then don't even think twice\r\nabout it - just go for it. The developers will be happier, the QA folks will be\r\nhappier, and the business will be happier in the long run when it realizes how\r\nmodular the application you built is and how easily you can enhance it with new\r\nfunctionality.<br>\r\n<br>\r\nLet me know if you have any other specific questions. Also, the Microsoft\r\nguys are really great answering questions here, so don't be afraid to ask if\r\nyou want guidance on how to do something or run into a roadblock.<br>\r\n<br>\r\nRyan</span></p>\r\n\r\n</div>\r\n\r\n<div style=\"border:none;border-top:solid #CCCCCC 1.0pt;padding:0cm 0cm 0cm 0cm\" id=ThreadNotificationFooter>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif';color:gray\">Read\r\nthe <a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=54636&ANCHOR#Post184298\">full\r\ndiscussion online</a>.</span></p>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif';color:gray\">To\r\nadd a post to this discussion, reply to this email (<a href=\"mailto:CompositeWPF@discussions.codeplex.com?subject=[CompositeWPF:54636]\">CompositeWPF@discussions.codeplex.com</a>)</span></p>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif';color:gray\">To\r\nstart a new discussion for this project, email <a href=\"mailto:CompositeWPF@discussions.codeplex.com\">CompositeWPF@discussions.codeplex.com</a></span></p>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif';color:gray\">You\r\nare receiving this email because you subscribed to this discussion on CodePlex.\r\nYou can <a href=\"http://www.codeplex.com/site/discussions/project/unsubscribe/CompositeWPF\">unsubscribe\r\nor change your settings</a> on codePlex.com.</span></p>\r\n\r\n<p><span style=\"font-size:9.0pt;font-family:'Verdana','sans-serif';color:gray\">Please\r\nnote: Images and attachments will be removed from emails. Any posts to this\r\ndiscussion will also be available online at codeplex.com</span></p>\r\n\r\n</div>\r\n\r\n</div>\r\n\r\n",
    "PostedDate": "2009-04-29T09:03:48.773-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "185263",
    "ThreadId": "54636",
    "Html": "Steph,<br>\r\n<br>\r\nYou're absolutely correct about Silverlight running in a sandboxed environment. Essentially it can't access anything above and beyond what a normal IE or FF browser can (i.e. files on disk, background processes, etc). Having said that, Silverlight does have something called Isolated Storage which is essentially a sandboxed file system for your Silverlight application to read/write to and from. This would enable your users to start a session of your LOB app, do some work, save progress (you'd have to serialize their state somehow), shut down their laptop and go home, fire the laptop back up, VPN into the network, log back into your LOB app, and pick up where they left off. If you want to enable users to work on data outside of your LOB app in a program such as Excel or Word, you can absolutely serve up an xls, csv, doc file to them and then allow them to upload the modified file.<br>\r\n<br>\r\nPrinting support in Silverlight 2 isn't that great, you'd probably be best off serving up an HTML or ASP.NET page for anything you want your users to print which can be easily accomplished by adding a hyperlink inside your LOB application. Supposedly printing support will be better in SL3 and beyond. We shall see.<br>\r\n<br>\r\nDepending on how rich you want to make your application, you might want to consider Silverlight 3 since it allows for disconnected and out of browser capabilities - something Silverlight 2 can't do. Another option to consider since you have absolutely control over the environrment is a full fledged WPF application. I haven't worked with WPF or SL3 at all, but I know Prism will work very well with WPF and from what I can tell works fine with SL3 except for the page navigation framework.<br>\r\n<br>\r\nLet me know if this addresses your concerns. I'd also be interested in other's feedback as well.<br>\r\n<br>\r\nRyan\r\n",
    "PostedDate": "2009-04-29T17:20:32.98-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]