[
  {
    "Id": "1319345",
    "ThreadId": "571367",
    "Html": "Hello Community,\r<br />\n<br />\nI have extensive experience with Prism 4.0, and I see that there's 5.0 out now with PCLs.  I am interested in building a Xamarin.Forms application with Prism5, but it appears that the Composition library is not compatible.  Is this a known issue and/or is this possible to fix?\r<br />\n<br />\nAlso, Prism v5 is not a topic when creating a thread on this forum.  That should be fixed. :P\r<br />\n<br />\nThank you,\r<br />\nMichael<br />\n",
    "PostedDate": "2014-11-05T05:36:30.2-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1396621",
    "ThreadId": "571367",
    "Html": "For those that stumble upon this post be sure to check out the new Prism for Xamarin.Forms Preview:\r<br />\n<br />\n<a href=\"http://brianlagunas.com/first-look-at-the-prism-for-xamarin-forms-preview/\" rel=\"nofollow\">http://brianlagunas.com/first-look-at-the-prism-for-xamarin-forms-preview/</a><br />\n",
    "PostedDate": "2015-03-25T14:35:50.803-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": "2015-03-25T18:25:53.56-07:00"
  },
  {
    "Id": "1397963",
    "ThreadId": "571367",
    "Html": "Man... If anything, I have to say I am very pleased with how much work Team Brian has put into getting XF support into Prism.  I honestly didn't think it would ever happen... or be the typical EntLib cadence of a few years before we heard anything.  Even though we might disagree 100% where Xaml is best utilized (<em>smile</em>), the fact that we're using is what is important.  It is THE superior mechanism of defining applications and nothing in the technology landscape comes close to it (imo).  I'm glad we are talking/debating Xaml and not HTML5, which is what we (or a majority of us) would be using if Xamarin.Forms was not around as a cross-platform solution.  I spent about a year and a half in HTML5 and it was not pretty.  There were some pretty dark years these past few years, but that is no longer the case.  The light is here once again, and it might be even brighter than silver this time around (see what I did there?).<br />\n<br />\nAnyways, coding is fun again.  It's exciting and promising, too.  The fact that a staple technology like Prism is already on-board with XF only adds to the awesomness.<br />\n<br />\nNow, if Team Brian can get the rest of EntLib onto the hotness, everything will be right with the world. :)<br />\n",
    "PostedDate": "2015-03-25T18:25:26.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]