[
  {
    "Id": "1332000",
    "ThreadId": "574977",
    "Html": "Hi,\r<br />\n<br />\nI am using PRISM 5.0.\r<br />\n<br />\nI am new to PRISM and just started to dig into it for my complex project.\r<br />\n<br />\nCurrently I try to load TabItems dynamically at runtime using TabControl as a Region.\r<br />\n<br />\nFor that I have registered interface and its' class in Module's initialize method.\r<br />\n<br />\nthis.container.RegisterType&lt;IABC, ABCViewModel&gt;(); and resolved it in controller class\r<br />\n<br />\nthis.container.Resolve&lt;ABC&gt;();\r<br />\n<br />\nAt above statement, it raised error &quot;InvalidOperationException - The current type, myinterface.IXYZ, is an interface and cannot be constructed. Are you missing a type mapping?&quot; for another interface/class. Then I register this interface in Module's initialize method.\r<br />\n<br />\nI run the app again and it again raised error same as above for another interface/class. Then I have register that class in Module's initialize method.\r<br />\n<br />\nTo resolved such errors, I have registered 6 interface/class in Module's initialize method. Now it raised &quot;InvalidOperationException - The type Dispatcher does not have an accessible constructor.&quot;.  This Dispatcher doesn't have any constructor and it is class of System.Windows.Threading, so can't make any changes in Dispatcher.\r<br />\n<br />\nPlease let me know how to resolve this Dispatcher issue?\r<br />\n<br />\nAm I on a right track to load TabItem dynamically using region? Or I am doing something wrong?\r<br />\n<br />\nI need to register around 6 interface/class for just to load one TabItem dynamically. There are other 5 TabItem, I need to load dynamically using PRISM Region.\r<br />\n<br />\nKindly guide me on this issue and if I am wrong, suggest me the right way to load TabItem dynamically.\r<br />\n<br />\nThanks,\r<br />\nAyaz Shaikh<br />\n",
    "PostedDate": "2014-12-15T05:10:22.653-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]