[
  {
    "Id": "1354567",
    "ThreadId": "581525",
    "Html": "Good day everyone, I just downloaded Prism V5 and try to installazione it on my windows 7 with vs 2012 on it. I just see the licence dialog and message dialog appear later which display 'Finished unpacking source files' and I click OK button. But nothing happen after that. Pls what is the problem.<br />\n",
    "PostedDate": "2015-02-21T04:15:14.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1354700",
    "ThreadId": "581525",
    "Html": "If the package is unpacking correctly (just did it myself on a new machine), right after the license dialog you should get a Browse for Folder dialog where you pick what folder to put it in. Any chance you accidentally hit enter too quick and it went to its default location, which would be in your user profile folder (C:\\Users\\&lt;yourusername&gt;)?<br />\n",
    "PostedDate": "2015-02-22T06:23:07.633-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1354711",
    "ThreadId": "581525",
    "Html": "Thanks BrianNoyes I'm not mistakenly press enter key. Immediately I right click on setup icon and select &quot;Rum as Adminstrator&quot; the licenze dialog appear next to accept after that it was so fast to the extend that I cannot even see that process or even ask me to select anything, so next thing that appear on screen is Finished unpacked sources dialog.<br />\n",
    "PostedDate": "2015-02-22T07:07:33.243-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1354712",
    "ThreadId": "581525",
    "Html": "Did you check under your user profile folder to see if it ended up there, I think that is the default location.<br />\n",
    "PostedDate": "2015-02-22T07:09:11.103-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1354714",
    "ThreadId": "581525",
    "Html": "Shoot me an email at brian.noyes on gmail and I can hand you off a zip file of what is extractexd.<br />\n",
    "PostedDate": "2015-02-22T07:12:04.963-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1354723",
    "ThreadId": "581525",
    "Html": "Thanks I will send it from <a href=\"mailto:waleolatunji@Live.com\" rel=\"nofollow\">waleolatunji@Live.com</a><br />\n",
    "PostedDate": "2015-02-22T08:16:04.5-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]