[
  {
    "Id": "1363916",
    "ThreadId": "586695",
    "Html": "Dear All, Please Someone Show me how to Consume a WCF Service that allows only authenticated Users. My Client application is WPF using Prism Platform. thanks in Advance. I also need to know how to supply UserName And Password to the Service from Prism<br />\n",
    "PostedDate": "2015-03-16T00:15:24.587-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1364073",
    "ThreadId": "586695",
    "Html": "I'm afraid this really has absolutely nothing to do with Prism itself. Prism is a framework for structuring your UI and makes no presumptions about what kinds of things you might be doing in your view models or client side services. I would normally encapsulate all my WCF calls in a client side service that is injected into my view models, but the use of WCF from there has nothing to do with Prism, and as a result, guidance or samples around how to use WCF are outside the scope of the Prism team.\r<br />\n<br />\nHowever, I do address exactly what you are asking in my Pluralsight course &quot;WCF Jumpstart&quot; which you can find here: <a href=\"http://www.pluralsight.com/courses/wcf-jumpstart\" rel=\"nofollow\">http://www.pluralsight.com/courses/wcf-jumpstart</a>. If you do not have Pluralsight access, contact me by email brian.noyes at gmail and I can get you a one month pass to watch it (and other WCF course there such as Miguel Castro's WCF End-to-End course, which picks up where mine leaves off and digs deeper into most aspects of WCF.<br />\n",
    "PostedDate": "2015-03-16T03:51:18.247-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1365984",
    "ThreadId": "586695",
    "Html": "BrianNoyes<br />\n<br />\nam grateful for the information. i thought there was a straight forward way like in plain WPF in Visual studio 2010 where we use the Client application Service to achieve centralized server authentication of users, determine each user's assigned role or roles. My greatest need is how to pass username and password when accessing the wcf service. <br />\n<br />\nDear BrianNoyes, if Pluralsight can help me achieve that, then please kindly get me that pass. i will get to you by mail as advised<br />\n thanks in advanced<br />\n",
    "PostedDate": "2015-03-16T21:43:29.66-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]