[
  {
    "Id": "1398583",
    "ThreadId": "616154",
    "Html": "How can I achieve the following appearance for modal dialogs in a Prism 5.0 based WPF desktop application? Here is the screenshot from the Prism 5 webpage:\r<br />\n<a href=\"https://i-msdn.sec.s-msft.com/dynimg/IC448590.png\" rel=\"nofollow\">https://i-msdn.sec.s-msft.com/dynimg/IC448590.png</a>\r<br />\n<br />\nHowever, the WPF based State-Based Navigation quickstart app looks like:\r<br />\n<img src=\"http://i.imgur.com/uRBCmrp.png\" alt=\"Image\" />\r<br />\n<br />\nIs it possible to do this with using InteractionRequestTrigger?<br />\n",
    "PostedDate": "2015-04-01T05:56:24.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1398601",
    "ThreadId": "616154",
    "Html": "It is possible to do with InteractionRequests, but with the current code base you would need to write your own custom behavior to do the presentation part as a windowless border and handle the background overlay as well. The built in one in WPF just uses a Window to create the dialog, thus the standard frame. I will put an issue in for this under our new code base at <a href=\"http://github.com/prismlibrary\" rel=\"nofollow\">http://github.com/prismlibrary</a> because it is a common request and hopefully we can fit it into a future release.<br />\n",
    "PostedDate": "2015-04-01T07:25:21.4-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1418759",
    "ThreadId": "616154",
    "Html": "Thanks for adding this as an issue!\r<br />\n<br />\nUntil the official solution, could you provide me some guidance about a possible implementation? The current PopupWindowAction class creates a wrapper window with a basic content and centers it over the parent view. What I would like to implement is a view with arbitrary content centered over the parent view. We have some basic implementation which uses regions with view-based navigation, but maintaining those regions for each view which needs this overlayed modal interactivity is a kind of overhead and not so elegant.\r<br />\n<br />\nThanks!<br />\n",
    "PostedDate": "2015-04-27T03:34:06.967-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1418936",
    "ThreadId": "616154",
    "Html": "The approach I have used in the past is to create a popup Window with no border to it and semi-transparent background, position that window over the content area (and handle window resize and move events to keep it there), and then have a content area in the middle of it (just a grid cell with a min height, width) that the dialog content gets placed in. So it is really just a small evolution of the current implementation to alter the appearance/size/positioning of the popup window.<br />\n",
    "PostedDate": "2015-04-27T06:09:45.907-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]