[
  {
    "Id": "211396",
    "ThreadId": "62287",
    "Html": "<p>Hello,</p>\r\n<p>I am struggling to get my mind around adding a double click behavior that fires off a command. I am using SL3 and Prism of course.</p>\r\n<p>In my PresentationModel class, I am adding panels to a canvas in my region that contains BitmapImage objects. This is not done from XAML but from code that adds the panels and bitmaps as child objects. The reason for this is another topic all together.</p>\r\n<p>How can I attach a behavior which handles clicks and double clicks that generates a command? All the sample code I can find does this from XAML and not from code.</p>\r\n<p>Thank you in advance.</p>\r\n<p>Rick</p>",
    "PostedDate": "2009-07-13T10:34:18.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212094",
    "ThreadId": "62287",
    "Html": "<p>Hi Rick,</p>\r\n<p>If I understand correctly, you want to be able to fire a command based on a double click/click from the user. This command should be fired from code behind.</p>\r\n<p>In this scenario, you should take into account that a behavior&rsquo;s goal is to be able to hook the command to a particular control from XAML. (You can read more about it <a href=\"http://blogs.southworks.net/jdominguez/2008/08/icommand-for-silverlight-with-attached-behaviors/\">here</a>). Therefore, if you want to execute a particular piece of code every time the click/double click happens, you can simply subscribe to the click event in the code behind and implement the logic. If you want to execute a command, you can simply call the command&rsquo;s execute method.</p>\r\n<p>In case you want to use a behavior for click or double click (from XAML), <a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=55576\">this thread</a> provides some information on how to do it.</p>\r\n<p>Please let me know if this helps.</p>\r\n<p>Damian Schenkelman</p>\r\n<p><span style=\"font-size:11pt\" lang=EN-US><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></span></p>",
    "PostedDate": "2009-07-15T05:29:30.763-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "212180",
    "ThreadId": "62287",
    "Html": "<p>Hi Damian,</p>\r\n<p>I was heading down that route but thought I might be missing something.</p>\r\n<p>Are you avalable to write any custom controls? I have an interesting project for you if you are available.</p>\r\n<p>Thank you,</p>\r\n<p>Rick</p>",
    "PostedDate": "2009-07-15T09:42:39.263-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]