[
  {
    "Id": "212796",
    "ThreadId": "62687",
    "Html": "<p>Hi there,</p>\r\n<p>Starting to understand at least the big picture of this framework and the patterns used as MVVM i still feel that i <br>miss &quot;the second half&quot; of a complete application,&nbsp;I can create views &quot;statically&quot; but what about when we are adding requirements a; <br><br><em>&quot;responsive&nbsp;applications&quot;&nbsp;(threading / long operations / asynch) <br>&quot;Notify the user what the application are doing&quot; (state / icons or progress bars / task dialogs).</em><br><br>Most of the tutorials and articles i find&nbsp;never reach this far, they&nbsp;handle often much more&nbsp;specific&nbsp;UI problems and again&nbsp;never reach this far down the pipe.&nbsp;</p>\r\n<p>Is it only me&nbsp;who are wondering about things like:<br><br>How do i open a new window from my Commmand / Viewmodel?<br>How would i do this window&nbsp;or dialog modal to the opening window (I dont have any ref to the view in the viewmodel, correct??)<br>What is the best&nbsp;mechanism to report progress from a&nbsp;operation in &quot;the service layer&quot;, e.g.&nbsp;imagine an operation that:<br><br>1. Uploads a file via webdav a file to a server.<br>(I want to report back the upload progress to the user)</p>\r\n<p><br>2. Writes some metadata&nbsp;about the&nbsp;the file to a database via a WCF service.&nbsp;</p>\r\n<p>In the short example above, would it be best&nbsp;to execute the two sub operations from an ICommand, or should&nbsp;the complete operation be &quot;encapsulated&quot; in <br>a&nbsp;method in the service layer?</p>\r\n<p>Is it only me who cant access the apps database directly but instead need to access data via a web service layer / remote (which gives problems compared to direct db access (client / server))? <br>Again, most examples on the web i find just take for granted that everyone in the world have direct access to the database as far as i can see.</p>\r\n<p>Perhaps the reference implemenation are showing solutions to problems above and i just can find it. If so please<span style=\"color:#000000\"> tell me!!!<br><em><span style=\"color:#ff0000\">UPDATE:</span> I just found out that the ref app are having something called&nbsp;</em></span><span style=\"color:#ff0000;font-size:x-small\"><span style=\"color:#ff0000;font-size:x-small\"><span style=\"color:#000000\"><em>RegionPopupBehaviors which seems to be able to open a window. Fanatstic!!!! But....shouldnt the documentation be extended to include information about such a common need, how to open a window in Prism, or do i really need to surf the web for such a problem?<br><br></em></span></span></span>You could argument that my wonderings here are not WPF specific at all, and thats&nbsp;why&nbsp;it isnt dealt with to much. To me..... i stil think i can&nbsp;find arguments why<br>an article about:</p>\r\n<p><strong>WPF + MVVM + Open modal Windows + &nbsp;ICommand + Threading +&nbsp;&quot;Reporting&nbsp;progress state back to the end user&quot;</strong> etc....</p>\r\n<p>would be VALUABLE and of course .... WPF realated!<br><br>My worry is that a framework that is so nice as Prism want get get the audience / usage as it deserves, not all people are working in the R&amp;D&nbsp;department and have <br>limited time to solve the problems (which frameworks should be the solution to). I dont understand when the people behind frameworks have spent so much time being creative and producing<br>great things,&nbsp;to then not put as much energy and effort to tell the people what you can do with it, to promote it 100%. That way I think are risking the overall success of the framework to a great extent. <br><br>So....&nbsp;is it only me who's having hard time to find these &quot;end to end&quot; examples on the web or do they exists? Are there any&nbsp;WPF gurus like&nbsp;the &quot;WPF Disciples&quot; dealing with these issues?</p>\r\n<p>Finally, i do understand if this thread can be interpreted as a bit negative to Prism and perhaps to the people behind it. But please, try to read between the lines and think of what im trying to write here. <br>Basicly im justin calling for an extension to articles&nbsp;and frameworks, to handle and show the real&nbsp;potential of a good framework / technology for less inteligent people as me, how about a Prism for dummies perhaps :-)</p>\r\n<p>Take care!</p>\r\n<p>Best Regards<br>Niclas</p>",
    "PostedDate": "2009-07-16T15:25:47.407-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "213147",
    "ThreadId": "62687",
    "Html": "<p>Hi Niclas,</p>\r\n<p>First, thanks for your feedback about the guidance, both good and bad since it one of the biggest ways for p&amp;p to improve it. If you believe this suggestion could be useful for the community, please feel free to add an item in the <a href=\"http://compositewpf.codeplex.com/WorkItem/List.aspx\">Issue Tracker</a> so people can vote for it, and it might taken into account for future versions of the guidance.</p>\r\n<p>Related to your &ldquo;reported progress problem&rdquo;, and this is with no real knowledge about your application, a possible approach could be creating a module that exclusively handles progress reporting and similar tasks, which can get updates from the service (or a service of your own that interacts with the <strong>WebService</strong>) when it begins/is/finishes performing tasks. This module can then show the progress reports through views in the way that is required (showing them in regions in a <strong>StatusBar</strong>, in a Popup through the <strong>RegionPopupBehavior</strong> or any other option). Of course this is all simply explained, but I hope the idea is understandable.</p>\r\n<p>It has to be taken into account that Prism is not a framework but a library (and guidance). It has a much lighter weight and a lot of extensibility points depending on your specific needs (lots of interfaces). One great thing about this is that is does not chain you to a specific approach of doing things, such as handling Web Service operations. Of course, this does not mean that guidance about web service communication would not be good (it is a topic of interest), but that there is no &ldquo;the proper way&rdquo; to do it, but the one that feels best for your application.</p>\r\n<p>I hope my answer has been useful for you.<span style=\"color:#1f497d\"> </span>There is also a good<span style=\"color:#1f497d\"> <a href=\"http://johnpapa.net/silverlight/building-a-presentation-framework-with-prism-for-silverlight/\">post</a> </span>from<span style=\"color:#1f497d\"> <a href=\"http://johnpapa.net/\">John Pappa</a> </span>where he discusses some similar problems and he talks about a future presentation framework (he is developing) that might address them<span style=\"color:#1f497d\">.</span></p>\r\n<p>Damian Schenkelman<br><span style=\"font-size:11pt\" lang=EN-US><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></span></p>",
    "PostedDate": "2009-07-17T11:13:25.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]