[
  {
    "Id": "215425",
    "ThreadId": "63350",
    "Html": "<p>I'm working with the patterns in PRISM for the UI portions of my application(s)...and other than the Region facets, most of these patterns are really good, generally applicable patterns that are good practice to apply in many areas of the stack. &nbsp;</p>\r\n<p>What's would be the downside, if any, to using PRISM as modules for my other class libraries?</p>\r\n<p>In particular I'm thinking about 'Modularity' and 'EventAggregator' (Dependency Injection too of course, but that's available seperately with UNITY, so not so applicable to this question of broader PRISM re-use).</p>\r\n<p>Is this a good idea, or be there dragons lurking when PRISM gets used in a wider context that composing UI?</p>\r\n<p>Thanks!</p>",
    "PostedDate": "2009-07-23T11:17:10.78-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215801",
    "ThreadId": "63350",
    "Html": "<p>Hi Phil,&nbsp;</p>\r\n<p>It a perfectly good idea. Although Prism was developed to solve composite UI problems, one of its <a href=\"http://msdn.microsoft.com/en-us/library/cc707907.aspx\">design goals</a> was to &quot;g<em>ive developers the ability to use pieces of the Composite Application Library without having to use the entire library&quot;</em> (this was not the case with CAB).&nbsp;</p>\r\n<p>As you said, dynamically loading modules could be perfectly used in non-UI applications and <strong>EventAggregator</strong> as a mean for decouple communication between them. You could also check <a href=\"http://code.msdn.microsoft.com/mef\">MEF</a> for the modularity approach and <a href=\"http://blogs.msdn.com/gblock/\">Glenn Block</a>'s &nbsp;post on&nbsp;<a href=\"http://blogs.msdn.com/gblock/archive/2009/02/23/event-aggregation-with-mef-with-and-without-eventaggregator.aspx\">Event Aggregation with MEF (with and without EventAggregator)</a>.</p>\r\n<p>You might surely find useful <a href=\"http://blogs.southworks.net/dschenkelman/\">Damian Schenkelman</a>'s post useful where shows how to extract only the <strong>EventAggregator</strong> from CAL assemblies (something similar could be done for modularity):</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/Putting Prism-v2 extensibility to test. The standalone Silverlight Event Aggregator\">Putting Prism-v2 extensibility to test. The standalone Silverlight Event Aggregator</a></li>\r\n</ul>\r\n<p><span style=\"font-size:10pt\" lang=EN-US>&nbsp;</span>Hope it helps!&nbsp;</p>\r\n<p>Matias Bonaventura<br><a href=\"http://blogs.southworks.net/matiasb\">http://blogs.southworks.net/matiasb</a></p>",
    "PostedDate": "2009-07-24T10:57:02.873-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "215834",
    "ThreadId": "63350",
    "Html": "<p>Fantastic. &nbsp;Thanks for the confirmation, and additional reading references. &nbsp;Cheers Matias!</p>",
    "PostedDate": "2009-07-24T12:33:32.06-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]