[
  {
    "Id": "1421764",
    "ThreadId": "636103",
    "Html": "Hello everyone, <br />\n<br />\nMy question is somewhat really basic about prism. Hence, kind request to don't underrate it. Rather, it would be great to know the answers which helps me to take a great step in my very important project of my student career.<br />\n<ol>\n<li>\nWhat is prism? <br />\nSeparate Framework? or it is added to the existing .NET Framework or is it just a libraries which I can use by just referencing them while coding my WPF MVVM project?<br />\n</li>\n<li>\nIs prism selection good in my business case? ( just want to know i am right ? and looking for suggestions)<br />\n</li>\n</ol>\nBusiness case:<br />\nI have to develop a WPF MVVM application to visualize the machine data of the machine manufacturing company. Hence, my project is a data visualization project. So, I may have to use graphs, charts histograms etc. in order to display my analysed data. <br />\n<br />\n<strong>Note: The target device to run application would be tablets, Windows pro books.</strong> <br />\n<br />\nNow, while I was reading about prism. I somewhere encountered saying that, you have to use prism if its a case of data visualization project. Now, what is this &quot;Use Prism&quot; mean?<br />\n<br />\nI hope those who read this is able to understand confusions and doubts that I am presently undergoing. Hence, It would be great, if, anyone can please answer based on the questions posed above.<br />\n<br />\nThank you very much<br />\n",
    "PostedDate": "2015-04-30T03:24:12.48-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1421873",
    "ThreadId": "636103",
    "Html": "Hi,\r<br />\nWhile some would call Prism a framework, at the end of the day it is just a set of class libraries that help you implement a number of design patterns in WPF, Windows Store, and Phone apps. \r<br />\n<br />\nFor your use case, yes, Prism is a great start for implementing an app using the MVVM pattern. It also addresses a number of other patterns that you can optionally use including modularity and UI composition with Regions. There are features for Navigating between views, communicating between views and other things. \r<br />\n<br />\nBest place to start if you have Pluralsight access is with Brian Lagunas' course: <a href=\"http://www.pluralsight.com/courses/prism-introduction\" rel=\"nofollow\">http://www.pluralsight.com/courses/prism-introduction</a>, followed by his course on Prism 5: <a href=\"http://www.pluralsight.com/courses/prism-50-whats-new\" rel=\"nofollow\">http://www.pluralsight.com/courses/prism-50-whats-new</a>. If you don't have access, shoot me a note brian.noyes on gmail and I can get you a one month trial.\r<br />\n<br />\nYou can also check out the book that I am co-author on that is available in MSDN: <a href=\"https://msdn.microsoft.com/en-us/library/gg406140.aspx\" rel=\"nofollow\">https://msdn.microsoft.com/en-us/library/gg406140.aspx</a>\r<br />\n<br />\nAlso, start following us at <a href=\"http://github.com/PrismLibrary\" rel=\"nofollow\">http://github.com/PrismLibrary</a>, because the project is being carried forward as an open source project there.\r<br />\nThanks\r<br />\nBrian<br />\n",
    "PostedDate": "2015-04-30T11:37:58.417-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]