[
  {
    "Id": "218017",
    "ThreadId": "64116",
    "Html": "<p>We had this problem a while back with XAP files getting picked up by TFS (2008), even though they are not in the list of files which it is supposed to recognize. Removing the link on our web project and re-adding it worked at the time, and they wouldn't get picked up again after that. Since upgrading to the SL 3 tools for VS 2008 and Blend 3 we're having this problem again, and the old fix no longer works. Does anyone have a solution for this?</p>\r\n<p>I've tried adding XAP to the recognized file types for TFS so that I can exclude the files manually, but I've also run into problems as well where I cannot exclude my Shell XAP - presumably because it's referenced in another file (the test page generated when it was added to the web project) which is also under source control.</p>",
    "PostedDate": "2009-07-31T07:28:01.557-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "218026",
    "ThreadId": "64116",
    "Html": "<p>I found that if you delete the .xap file from ClientBin that when you recompile the application it will regenerate it and, as you suggested, add it to source control.&nbsp; What I have to after deleting an .xap is go into the TFS Source Control Explorer and delete the ClientBin folder from project (it will show up as an Add).&nbsp;&nbsp; After deleting it from the Source Control Explorer it will stay deleted for any successive compiles as long as I don't delete&nbsp;the .xap again&nbsp;- once deleted I have to manually comply with the steps again.</p>",
    "PostedDate": "2009-07-31T08:00:50.243-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "219824",
    "ThreadId": "64116",
    "Html": "<p>Thanks Bill!</p>\r\n<p>I've posted it as a bug on the Silverlight.net forums, and added your workaround as well:</p>\r\n<p><a href=\"http://silverlight.net/forums/t/117415.aspx\">http://silverlight.net/forums/t/117415.aspx</a></p>\r\n<p>So hopefully it can get fixed in the future.</p>",
    "PostedDate": "2009-08-05T09:16:55.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]