[
  {
    "Id": "1446322",
    "ThreadId": "645591",
    "Html": "Is there a way of formatting the standard Notification, icons etc? I appreciate you can use a custom view but wondered whether I was missing some basic functionality?<br />\n",
    "PostedDate": "2015-09-29T06:11:36.86-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1446333",
    "ThreadId": "645591",
    "Html": "No, we never added properties for doing that because it is hard to identify what all we should expose there. So the custom view approach is the only way currently. I don't think we would be opposed to adding something like that if you submit a pull request with what you want to see at our new home at <a href=\"http://github.com/PrismLibrary/Prism\" rel=\"nofollow\">http://github.com/PrismLibrary/Prism</a><br />\n",
    "PostedDate": "2015-09-29T07:04:28.137-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1446339",
    "ThreadId": "645591",
    "Html": "Hi Brian, I am a big fan, I guess ultimately as the confirmation and interaction can both take a view as content then everything can be achieved, that is right isn't it?<br />\n",
    "PostedDate": "2015-09-29T07:22:33.327-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1446361",
    "ThreadId": "645591",
    "Html": "Correct. The only thing we don't support &quot;out of the box&quot; for WPF yet is having control over the window (and frame) that is used for the pop up. In Prism 6 that we just released, we did add hooks to make it easier for you to set the styling properties of the containing window. If you want to do something truly custom though (i.e. a flyout window of some sort) then you would have to write your own behavior based on the PopupWindowAction.<br />\n",
    "PostedDate": "2015-09-29T08:49:57.177-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1446363",
    "ThreadId": "645591",
    "Html": "Thanks Brian, so does that mean you would still see the default application icon? Is there going to be an issue upgrading from 5 to 6?<br />\n",
    "PostedDate": "2015-09-29T08:54:02.22-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1446367",
    "ThreadId": "645591",
    "Html": "I believe so, haven't played with that part, but that is something we could easily add as well. The advantage of it being full open source now is we can get releases out (especially non breaking additions) much more regularly.\r<br />\n<br />\nThere are a number of breaking changes in Prism 6, mostly because we had to change all the namespaces and we refactored where things live a little to align with our roadmap for developing versions of Prism for WPF, UWP, and Xamarin Forms.<br />\n",
    "PostedDate": "2015-09-29T09:23:10.117-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "1446483",
    "ThreadId": "645591",
    "Html": "Thanks for all your help Brian <br />\n",
    "PostedDate": "2015-09-30T01:15:04.527-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]