[
  {
    "Id": "227052",
    "ThreadId": "66801",
    "Html": "<p>I posted this same question on the Silverlight forum as I think this might be a combined Silverlight/Prism question.</p>\r\n<p>Is it possible to create a template/style that will show the content of a tabitem in a scrollviewer?&nbsp; I searched the forums and found lots of questions about having the actual tabs show in a scrollviewer but I want the&nbsp;content of each individual tab to display in a scrollviewer.</p>\r\n<p>My scenario is having multiple tabs open with each tab holding an edit&nbsp;view and each&nbsp;view could be a different size so I want each tab to show the edit&nbsp;view within a scrollable area when needed.</p>\r\n<p>I am using&nbsp;the TabRegionAdapter.</p>\r\n<p>Heather</p>",
    "PostedDate": "2009-08-24T07:29:54.757-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "227625",
    "ThreadId": "66801",
    "Html": "<p>Hi Heather,</p>\r\n<p>There should be no problems using templates and styles with the <strong>TabRegionAdapter</strong>. The <a href=\"http://msdn.microsoft.com/en-us/library/dd458919.aspx\"><span style=\"color:#1f497d\">Prism reference implementation application</span></a> uses styles and defines a new template for the <strong>AnimatedTabControl </strong>and the <strong>ShellTabItemStyle</strong> for the TabItems<strong>. </strong>Though it's not exactly your scenario, you can use it as starting point to redefine the templates to include a scrollviewer.&nbsp;</p>\r\n<p>You might also take into account the following issue that was found with SL3 and prism <strong>TabRegionAdapter</strong> when using bindings:</p>\r\n<ul>\r\n<li><span style=\"font-size:11pt\" lang=EN-US><a href=\"http://compositewpf.codeplex.com/WorkItem/View.aspx?WorkItemId=4599\">TabControlRegionAdapter bindings in the tab header are broken under silverlight 3.0 Title is required</a></span></li>\r\n</ul>\r\n<p>Hope it helps!</p>\r\n<p>Matias Bonaventura<br><a href=\"http://blogs.southworks.net/matiasb\">http://blogs.southworks.net/matiasb</a></p>",
    "PostedDate": "2009-08-25T13:11:07.937-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]