[
  {
    "Id": "233081",
    "ThreadId": "68522",
    "Html": "<p>Hi,</p>\r\n<p>I have a User Control that, on a button click, open, through a delegate command attached to the button click, a ChildWindow, that is managed by its view model.</p>\r\n<p>When the user click on the Ok or Cancel button in the ChildWindow, I want close the ChildWindow.</p>\r\n<p>I know that this is simple using childWindow.DialogResult = true in the codeBehind; but I'm using ViewModels and I'd like to do this through its view model.</p>\r\n<p>How could I perform this?</p>\r\n<p>Thank you</p>",
    "PostedDate": "2009-09-10T06:15:24.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233764",
    "ThreadId": "68522",
    "Html": "<p>Hi</p>\r\n<p>If you are set with having no code behind in the view, once possible way to achieve this could be passing the <strong>ChildWindow</strong> as a Command Parameter, and setting the DialogResult property in the command. You can read more about that in <a href=\"View.aspx?ThreadId=68155\">this thread</a>.</p>\r\n<p>However, in my personal opinion, it might not be necessary to avoid having code behind in a ChildWindow. Perhaps having a method in its interface which is in charge of setting the <strong>DialogResult</strong> based on a model parameter, and handling it in the code behind could be a better approach (of course the model would be keeping a reference to the view). You can read more about some criterion for adding/not adding code-behind to views when using MVVM in this post by <a href=\"http://blogs.msdn.com/gblock/\">Glenn Block</a>:</p>\r\n<ul>\r\n<li><a href=\"http://blogs.msdn.com/gblock/archive/2009/08/03/the-spirit-of-mvvm-viewmodel-it-s-not-a-code-counting-exercise.aspx\">The spirit of MVVM (ViewModel), it&rsquo;s not a code counting exercise.</a></li>\r\n</ul>\r\n<p>Please let me know if this helps.</p>\r\n<p>Damian Schenkelman   <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-09-11T14:48:06.18-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]