[
  {
    "Id": "234489",
    "ThreadId": "68909",
    "Html": "<p>Hi!</p>\r\n<p>I try to implement visual interaction on switching the views in region manager</p>\r\n<p>So when user changes the active view,&nbsp; the old active view will fade and slide away and new view would slide and fade in. <br><br>Is there any simple way with region manager. Or I should wire up all this &quot;manually&quot;</p>\r\n<p>As far as I understood I would need in shell window 2 instances of the same container control, one for old view sliding off and another for new view for sliding in effect. <br><br>Or is there any simpler way for doing this?</p>",
    "PostedDate": "2009-09-14T14:27:10.05-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234616",
    "ThreadId": "68909",
    "Html": "<p>Ok I figured this out. <br><br>Basically what I did was, take a &quot;screenshot&quot; from panel to be fade-d out and put this &quot;screenshot&quot; into rectangle. And move in new View in</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-14T23:45:51.513-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "234933",
    "ThreadId": "68909",
    "Html": "<p>Hi,</p>\r\n<p>There might be some publicly available WPF controls which enable this kind of behavior (similar to the <strong>TransitioningContentControl</strong> for Silverlight). If you require this functionality for a <strong>TabControl</strong> you could check the animation performed in the <a href=\"http://msdn.microsoft.com/en-us/library/dd458919.aspx\">RI application</a> that comes with Prism-v2.</p>\r\n<p>Another possible approach could be creating a region behavior that is in charge of performing the required animation when the <strong>ActiveView</strong> changes by animating the previous and current active view, and add it to the desired region adapter.</p>\r\n<p>Please let me know if this helps.</p>\r\n<p>Damian Schenkelman   <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-09-15T15:48:57.953-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243658",
    "ThreadId": "68909",
    "Html": "<p><a id=\"ctl00_ctl00_MasterContent_Content_PostRepeater_ctl02_UserNameLink\" href=\"http://www.codeplex.com/site/users/view/pyhavaim\">pyhavaim</a></p>\r\n<p>Could you show you example as i would love to see what you have done.</p>\r\n<p>Thanks</p>\r\n<p>&nbsp;</p>\r\n<p>Marcus</p>",
    "PostedDate": "2009-10-08T17:08:47.397-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]