[
  {
    "Id": "237195",
    "ThreadId": "69676",
    "Html": "<p>Hi guys,</p>\r\n<p>Looking through the Prism documentation and samples, the first thing that comes to mind are nested regions. For example, if a view was loaded into &quot;MainRegion&quot;, can that view contain other regions that other views can be registered into. I seems like it would be possible, based on the implementation of dependency properties (assuming your region names are unique).</p>\r\n<p>Are there any issues/gotchas with this approach, particularly relating to when the child-view (containing the sub-regions) is unloaded? Or am I simply describing exactly how Prism is intended to be used?</p>\r\n<p>Richard</p>",
    "PostedDate": "2009-09-22T01:15:00.267-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "237376",
    "ThreadId": "69676",
    "Html": "<p>That is how it works (Scoped Regions)&nbsp;but a gotcha that I am working with right now is when you want to load the same control (different instances) into the same region. I have found that doing this with Unity and Prism in the mix is quite a challenge to get right without some workarounds. Using constructor injection and getting the region manager correct in the child windows is a chicken / egg problem!</p>",
    "PostedDate": "2009-09-22T08:41:42.687-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272130",
    "ThreadId": "69676",
    "Html": "<p>hi fred , did u happen to solve the problem , i want my presentationModels to be injected with the scoped region manager and my popup region adapter should also find the scoped region manager to add the region to. &nbsp;any help will be highly appreciated.</p>",
    "PostedDate": "2010-01-01T00:13:43.217-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272194",
    "ThreadId": "69676",
    "Html": "<p>I did get something working but not really to my satisfaction and so I gave up on finding one at that time (just a demo prototype that was &quot;good enough&quot;). Basically I was using the Microsoft.Practices.Composite.Presentation.Regions.RegionManager.SetRegionManager(...) method to set the region manager that the scoped method returned BUT of course as the message above indicated, I was always running into something not quite right such as something NULL or the XAML binding not finding what it needed.</p>",
    "PostedDate": "2010-01-01T09:24:48.247-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]