[
  {
    "Id": "237799",
    "ThreadId": "69838",
    "Html": "<div>\r\n<p>Hi,</p>\r\n<p>I have created a project using the PRISM framework. I have a few modules that I can register and display in the shell and this works fine. What I need to do is dynamically display and hide the modules when a particular event is received from the event aggregator.</p>\r\n<p>I fire off a DisplayModule event that should be received and hide an existing module and show a new one, but my question is where is the place I should receive this event and display the module? the shell? if so, how would I do this as the shell is the top level and doesn't seem to inherit the required Unity methods.</p>\r\n<p>I also thought I could have a seperate module that listened for the DisplayModule event and used the region manager to hide the previous module and show the new one. This would need to reference all other modules to be able to resolve their type though, is this bad practice?</p>\r\n<p>Hope that makes sense.</p>\r\n<p>Thankyou for your time</p>\r\n</div>",
    "PostedDate": "2009-09-23T05:44:55.227-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "238400",
    "ThreadId": "69838",
    "Html": "<p id=acbd1fd0-8b57-012c-7c27-12313b00b831>Hi</p>\r\n<p id=acbd3020-8b57-012c-7c28-12313b00b831>The following threads deal with similar situations and explain possible ways of achieving your goals:</p>\r\n<ul>\r\n<li><a href=\"View.aspx?ThreadId=62400&ANCHOR%23Post213840\">Manually load module</a></li>\r\n<li><a href=\"View.aspx?ThreadId=59827\">Confirmation of understanding</a></li>\r\n<li><a href=\"View.aspx?ThreadId=59934\">Load module inside module and general design discussion</a>&nbsp;&nbsp; </li>\r\n</ul>\r\n<p id=acbd4280-8b57-012c-7c29-12313b00b831>Please let me know if this helps.</p>\r\n<p id=acbd5e70-8b57-012c-7c2a-12313b00b831>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-09-24T10:10:13.193-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]