[
  {
    "Id": "239886",
    "ThreadId": "70424",
    "Html": "<p>Hi,</p>\r\n<p>I wondering if anybody has some advice on implemeting error dialogs in prism ? are there any best practices ?</p>\r\n<p>Thanks</p>\r\n<p>&nbsp;</p>\r\n<p>Marcus</p>",
    "PostedDate": "2009-09-29T01:15:03.09-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "240158",
    "ThreadId": "70424",
    "Html": "<p>Hi Marcus,</p>\r\n<p>Please have a closer look at the PopupWindow object and its implementation in the code you have from the VIPitechEPS project.</p>\r\n<p>Although it has not been fully implemented yet, this can give you an idea how you can implement error dialogs in your system.</p>\r\n<p>I would suggest creating a factory in the Infrastrcture project which will create a window based on your current need (context of the error and its severity). Having a reference to the window in the viewmodel, you can easily inject another view into it or just show an error text. The new view can be obtained from the Unity container (please check the current implementation for it). The window should have other public properties like Title or Icon to make it more flexible. You can also pass delegates to the window which will be invoked when a user closes a window or clicks the OK button, thus every viewmodel will be able to execute its own code.&nbsp;Also, &nbsp;please remember that you have to implement additional functionality into the Activity control to disable it immediately when an error window is shown.</p>\r\n<p>Let me know if you need more help.</p>\r\n<p>Regards</p>\r\n<p>Artur</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-09-29T13:51:47.893-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "241739",
    "ThreadId": "70424",
    "Html": "<p>Thanks for the reply Arthur great pointers.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-03T15:38:10.983-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]