[
  {
    "Id": "240662",
    "ThreadId": "70649",
    "Html": "<p>*** Damian approved me posting this job on the forums (thank you)&nbsp;***</p>\r\n<p>We are looking for 2 WPF/Silverlight developers to work on a stealth mode start-up from home either part time or full time depending on your availability. This is your chance to get in at the beginning and work on an exciting project. <br><br>Your role will be to develop a MMOG front-end using the latest Microsoft technologies including Silverlight 3.0, Composite WPF (Prism), VS 2008 and SQL Server. <br><br>Responsibilities: <br>&bull; Use Silverlight and Prism to create a front-end for a new persistent MMOG. <br>&bull; Design and implement an advanced UI architecture and framework <br>&bull; Plan and implement complex UI for a large game <br>&bull; Interact with backend and product teams on usability, features and performance <br>&bull; Focus on usability, game play and fun! <br><br>Requirements: <br>&bull; Solid WPF and/or Silverlight experience <br>&bull; Prism or other MVVM frameworks a strong bonus <br>&bull; Deep experience with creating modern UIs and responsive products <br>&bull; 5+ years of professional related experience <br>&bull; Experience building web 2.0 user interfaces <br>&bull; Experience in the game industry a plus but not required <br><br>This is a stealth mode start-up and as such compensation is initially in the form of equity with the expectation to start earning a salary when the company receives funding. Most of our current team is working ten to fifteen hours a week with a few working full time. <br><br>Unique opportunities like this only come along every now and then. This is your chance to get in early, work on cool technology and have fun! <br><br>Send your resume to m6gamingjobs@gmail.com. Agencies, IT firms and recruiters need not apply.</p>",
    "PostedDate": "2009-09-30T15:19:34.493-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "243006",
    "ThreadId": "70649",
    "Html": "<p>These two positions are still open... :)</p>\r\n<p>Rick</p>",
    "PostedDate": "2009-10-07T09:07:17.32-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]