[
  {
    "Id": "246205",
    "ThreadId": "72141",
    "Html": "<p>In a simple app I did in the past, to show a wait animation, I have a Border that I toggle its Collapsed property.&nbsp; When open, the border fills the entire window, and shows the contained animation.&nbsp; I was thinking about using a similar implementation to show a &quot;popup&quot; modal dialog over all other views in the my app's main window.&nbsp; Is there an example of this somewhere?&nbsp; The idea is that the app window would go dim, and I could push a View that would appear above everything else.&nbsp; Does this make sense?</p>",
    "PostedDate": "2009-10-15T13:05:09.987-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246501",
    "ThreadId": "72141",
    "Html": "<p id=d8205c50-9bfc-012c-d6eb-12313b0068d1>Hi</p>\r\n<p>This topic was treated in other threads. So, in order to perform this, you can visit this <a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=65394\">forum thread</a>&nbsp;(which also has links to other threads).</p>\r\n<p>The Prism-v2 Desktop Reference Implementation shows an example on how to show a view in a different window by using a behavior (RegionPopupBehaviors) defined over the shell window, which is creating a NewsReaderWindow in a Popup Region. To see how this works you can debug the ArticleView.xaml code behind, starting with the OpenButton_Click handler method. The ArticleView is located News module inside the Article folder.</p>\r\n<p id=d8207bd0-9bfc-012c-d6ed-12313b0068d1>I hope you can find this link helpful.</p>\r\n<p id=d8208cf0-9bfc-012c-d6ee-12313b0068d1>Fernando Antivero <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2009-10-16T05:31:26.133-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "246567",
    "ThreadId": "72141",
    "Html": "<p>After I posted my question, I found that code in the RI and copied it over to my app.&nbsp; It works well however I don't want my View in another Window.&nbsp; What MS's does do is point me in the direction I need to go if I want to write my own behavior.&nbsp; Thanks!</p>\r\n<p>&nbsp;</p>\r\n<p>P.S. What does Southworks have to do w/ Prism?&nbsp; It seems like all the Prism guru's have Southworks blogs.</p>",
    "PostedDate": "2009-10-16T08:02:22.08-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]