[
  {
    "Id": "247111",
    "ThreadId": "72377",
    "Html": "<p>Hi all,</p>\r\n<p>This is not a technical question, so my apologies if this is the wrong place to place it, but I need to know the difference between <a href=\"http://compositewpf.codeplex.com\">http://compositewpf.codeplex.com</a> and <a href=\"http://www.codeplex.com/Silverlight\">http://www.codeplex.com/Silverlight</a></p>\r\n<p>Bar the obvious reason that this site is for composite WPF, is it also for Silverlight? Also has anyone used the codeplex.com/silverlight? There doesn't seem to be a discussion tab so that I can discuss my issues in silverlight? Is this the case for everyone or is just me and do I need to do something to enable the discussion tab or contact someone? I couldn't find any options, so here I am.</p>\r\n<p>I hope someone can clarify this for me.</p>\r\n<p>Thanks.</p>\r\n<p>Thierry</p>",
    "PostedDate": "2009-10-18T17:27:38.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247257",
    "ThreadId": "72377",
    "Html": "<p id=e1190080-9edd-012c-3698-12313b0085f1>Hi Thierry,</p>\r\n<p>The <a href=\"../\">http://compositewpf.codeplex.com</a> is the codeplex site for the <a href=\"http://msdn.microsoft.com/en-us/library/dd458809.aspx\">Composite Application Guidance for WPF &amp; Silvelight</a>, which is a guidance from p&amp;p that helps develop Composite applications in WPF &amp; SL. The latest release of the guidance is Prism-v2 which you can download from <a href=\"http://www.microsoft.com/downloads/details.aspx?FamilyID=fa07e1ce-ca3f-4b9b-a21b-e3fa10d013dd&DisplayLang=en\">here</a>. This forum is meant for questions related to this guidance.</p>\r\n<p id=e11932f0-9edd-012c-369a-12313b0085f1>On the other hand, the <a href=\"http://www.codeplex.com/Silverlight\">http://www.codeplex.com/Silverlight</a> site is the codeplex site for the Silverlight Toolkit. You can read about what it is in the home page. Although that site does not have a discussion forum, you can ask any question you might have about it in the following forum: <a href=\"http://forums.silverlight.net/forums/35.aspx\">Silverlight Controls and Silverlight Toolkit</a>.</p>\r\n<p id=e1195760-9edd-012c-369b-12313b0085f1>Please let me know if this helps.</p>\r\n<p id=e1197b90-9edd-012c-369c-12313b0085f1>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-10-19T06:07:18.42-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "247882",
    "ThreadId": "72377",
    "Html": "<p>Hi Damian,</p>\r\n<p>Thanks for the reply and the clarification. I never spotted the Forums tab in Silverlight!!!! I was recently at a silverlight jumpstart provided by MS and I'd swear that&nbsp;the&nbsp;lecturer there&nbsp;was on codeplex.com/silverlight and that she had a discussion tab. Maybe it is because she's working from Microsoft.</p>\r\n<p>I'll get in touch with her and find out if this was the case but I know that when we were in class, I logged on to codeplex and and told her that I did not have the tab and&nbsp;she could not understand why, so maybe as I said, it is only an option offered to MS employees?? Maybe she was on compositewpf.codeplex.com but I'm nearly 100% sure this was not the case.</p>\r\n<p>No worries, I have the forums for now and I'll revert back once I hear from her.</p>\r\n<p>Thanks.</p>\r\n<p>T.</p>",
    "PostedDate": "2009-10-20T14:29:23.387-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]