[
  {
    "Id": "247450",
    "ThreadId": "72465",
    "Html": "<p>Hey guys, I have a reasonably simple Silverlight layout that basically consists of a 2 row grid for the shell, the top row being 100 pixels high and basically containing the header row and the second filling the remaining space and containing the mainRegion in which to load my views. &nbsp;I wrap everything in a ScrollViewer.</p>\r\n<p>I would like to enable my shell to scroll (like you would scroll on a webpage, up and down the ENTIRE app) when the content of the view filling the main region is larger than the whole screen can cope with. &nbsp;When I set up a test app in which I place a UserControl into the second, content row then scrolling works as expected. &nbsp;However, when I reproduce this layout in my PRISM app, when I resize the browser window it basically crushes up the bottom row/main content region and no scrolling occurs at all. &nbsp;I have tried various different methods of laying this out, DockPanels, StackPanels, Grids and the effect is always the same, it's like the shell doesn't care about whatever is in the main region and is happy for it to disappear when the browser is sized down. &nbsp;I basically have the following layout in the shell:</p>\r\n<p>&lt;UserControl&gt;<br>&nbsp;&nbsp;&lt;Grid&gt;<br>&nbsp;&nbsp; &nbsp; &lt;ScrollViewer&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp;&lt;DockPanel LastChildFIll=&quot;True&quot;&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &lt;Grid (Header Grid) /&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &lt;Grid (ContentGrid)&gt;&nbsp;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&lt;Border&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &lt;ItemsControl (MainRegion - Views Loaded In Here) /&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&lt;/Border&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &nbsp; &nbsp;&lt;/Grid&gt;<br>&nbsp;&nbsp; &nbsp; &nbsp; &lt;/DockPanel&gt;<br>&nbsp;&nbsp; &nbsp;&lt;/ScrollViewer&gt;<br>&nbsp;&lt;/Grid&gt;<br>&lt;/UserControl&gt;</p>\r\n<p>As I've said, the above works fine if I replace the ItemsControl with a straight UserControl that emulates the view that will be loaded in, full page scrolling works fine. &nbsp;I've tried all combinations of lengths heights no lengths no heights stretches and I've tried templating the ItemsSource as a DockPanel as suggested in another thread but cannot for the life of me get scrolling working how I want it!</p>\r\n<p>Am I missing a trick here? &nbsp;Is there a bug with the way Silverlight handles the content of a region once it has been loaded in?</p>\r\n<p>Any help would be VERY greatfully received as this is currently driving me nuts!</p>\r\n<p>Thanks in advance, &nbsp;James.&nbsp;</p>",
    "PostedDate": "2009-10-19T13:42:13.61-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]