[
  {
    "Id": "249460",
    "ThreadId": "73022",
    "Html": "<p>Hi all,</p>\r\n<p>Can someone help understand why when I try to compile the project opened by Desktop &amp; Silverlight - Open Composite Application Library.bat I get a lot of different errors.</p>\r\n<p>Before I go on can you please tell me the difference between the 2? What is Desktop &amp; Silverlight for? I thought maybe Desktop was for WPF but a lot of the examples out there are telling you to use the libaries from the Desktop folder in silverlight applications. Which one do you recommend I use?</p>\r\n<p>Back to my issues,</p>\r\n<p>When I compile the Desktop project, all is ok but when I try to compile the Silverlight project, I get hundreds of errors (697 errors and 11 warnings to be exact!).</p>\r\n<p>I spotted that in Composite.Silverlight.Tests project, a couple of references are missing from all the test projects that are part of the solution which are probably at the cause of my problems. I've search for them but they are no where to be found in my prism folder. The assemblies are:</p>\r\n<p>Microsoft.Silverlight.Testing.dll</p>\r\n<p>Microsoft.VisualStudio.QualityTools.UnitTesting.Silverlight</p>\r\n<p>Anyone's got any ideas why this is happening and how can I fix this error?</p>\r\n<p>One last thing here, in one of the blogs I'm reading about Prism (<a href=\"http://www.tanguay.info/web/index.php?pg=howtos&id=16\">http://www.tanguay.info/web/index.php?pg=howtos&amp;id=16</a>), the gent here mentions you should include .xml file for the intellisense which is fair enough but not all of them are present in the folder, again why is that? Should I change the property in the project to generate the xml or should get them from somewhere else? The folder he recommends to take the files from is &quot;<span>C:\\prismv2\\CAL\\Silverlight\\Composite.UnityExtensions\\bin\\Debug&quot; - Is this the right place?</span></p>\r\n<p>Any help would be appreciated.</p>\r\n<p>Thanks.</p>\r\n<p>Thierry</p>",
    "PostedDate": "2009-10-25T06:31:04.34-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "249474",
    "ThreadId": "73022",
    "Html": "<p>Hello,</p>\r\n<p>The Desktop libraries are for developing WPF based on Prism.</p>\r\n<p>The Silverlight libraries are for developing Silverlight based on Prism.</p>\r\n<p>&nbsp;</p>\r\n<p>How did you get the source code? Through normal download for the package or through source code? I had once the same problems you are facing, and then I used the source code downloaded through &quot;TortoiseSVN&quot; and used &quot;V2&quot;. All worked fine.</p>\r\n<p>As for the &quot;.xml&quot;, once you compile successfully the above library, depends on what you are developing, in case of Silverlight, you get the &quot;dlls&quot; and &quot;xml&quot; from:</p>\r\n<p>&quot;CAL\\Silverlight\\Composite.UnityExtensions\\Bin\\Debug&quot;</p>\r\n<p>&nbsp;</p>\r\n<p>Hope this helps,<br>Regards</p>",
    "PostedDate": "2009-10-25T09:01:17.497-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]