[
  {
    "Id": "259702",
    "ThreadId": "75906",
    "Html": "<p>Hello,</p>\r\n<p>Could you please support Event to Command in Prism? There are a few numbers of MVVM frameworks that support EventToCommand. Even we can copy the code or repeat the same thing in our own way, It would be the best if we have official support from Prism Framework.&nbsp;</p>\r\n<p>One suggestion that I like to suggest for implementing Event to Command is that VM should have the reference to control. For example: If I'm using third-party control in View, but my view model shouldn't aware of that third-party control. The max scope of this third-party control should be only in View and attached property (not in ViewModel).&nbsp;</p>\r\n<p>We will need a lot of tricks when it comes to&nbsp;usability. WPF strong binding is great and what Prism supports so far is also very good for developing WPF/Silverlight business application. But there are some&nbsp;scenarios&nbsp;that we need events (this is where Event to Command comes into picture.), setting focus or handling mouse or etc.&nbsp;</p>\r\n<p>Thanks,<br>Michael Sync&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-11-22T21:44:29.69-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "259899",
    "ThreadId": "75906",
    "Html": "<p id=7310e730-ba65-012c-8f45-12313b03045a>Hi Michael,</p>\r\n<p id=7310f490-ba65-012c-8f46-12313b03045a>To facilitate execution of commands, (other than click in buttons) you can use commands with attached behaviors. <a href=\"http://blogs.southworks.net/jdominguez/\">Julian Dominguez</a> has a <a href=\"http://blogs.southworks.net/jdominguez/2008/08/icommand-for-silverlight-with-attached-behaviors/\">great post</a> that explains how this works in depth. I have created a <a href=\"http://blogs.southworks.net/dschenkelman/2009/08/13/c-code-snippet-to-create-commands-with-attached-behaviors-using-prism/\">code snippet</a> that should make the creation of these much faster.</p>\r\n<p>You might also want to add this topic as a suggestion for <a href=\"View.aspx?ThreadId=75604\">Prism&rsquo;s next version</a> in the <a href=\"../WorkItem/List.aspx\">Issue Tracker</a>. That way the team can keep track of this, and might evaluate providing more support for this out of the box.</p>\r\n<p id=73112600-ba65-012c-8f48-12313b03045a>Please let me know if this helps.</p>\r\n<p id=73114020-ba65-012c-8f49-12313b03045a>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-11-23T10:45:57.313-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "260068",
    "ThreadId": "75906",
    "Html": "<p>Thanks. &nbsp;Yeah. As I mentioned, it would be great if we have the official support from Prism Framework even we can roll our own.&nbsp;</p>\r\n<p>Yah. I will post it in Issue Tracker.</p>",
    "PostedDate": "2009-11-23T18:49:14.523-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]