[
  {
    "Id": "259968",
    "ThreadId": "76009",
    "Html": "<p>Hi,</p>\r\n<p>First of all I want to mention I'm very new to Composite WPF. Currentely I'm developing some buisness app and I want to use Composite WPF. My concept is to have several modules each with different business function (e.g. calendar, invoices, clients etc.). My main window (shell) will have two regions: toolbar region and main region. Each module will have two special views - one with button for toolbar, and second with main module view. Button will be loaded to toolbar region, and main module view should show up in main region when the mentioned before button will be pressed. Only one main module view should be visible at time in main region.</p>\r\n<p>Is it possible to achieve this in Composite WPF, if so give me please some hints how, becouse I've read the documentation several times, but still don't know even if it is possible to use regions and views like this. The only thing I've done is that every module registers button views in menu region so, all buttons shows in toolbar.</p>\r\n<p>mazu</p>",
    "PostedDate": "2009-11-23T13:21:30.877-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "260305",
    "ThreadId": "76009",
    "Html": "<p>This kind of requirement is solved by the <a href=\"http://msdn.microsoft.com/en-us/library/dd458868.aspx\">UIComposition</a> implementation in Prism, which allows you to inject views (you can achieve this through <a href=\"http://msdn.microsoft.com/en-us/library/dd458868.aspx\">View Injection</a> ). In fact, to show this capability Prism provides a <a href=\"http://msdn.microsoft.com/en-us/library/dd458920.aspx\">Quicktstart</a>, which would probably help you in order to perform this task.</p>\r\n<p>In the <a href=\"http://blogs.msdn.com/erwinvandervalk/\">Erwin Vandervalk&rsquo;s</a> blog you can find a <a href=\"http://blogs.msdn.com/erwinvandervalk/archive/2009/03/02/how-to-build-an-outlook-style-application.aspxhttp:/blogs.msdn.com/erwinvandervalk/archive/2009/03/02/how-to-build-an-outlook-style-application.aspx\">post</a> that might be helpful. In this case, the showcased application in the post has a toolbar with buttons and a main region where this application shows different views based on the button clicked.</p>\r\n<p id=e213ab90-bb35-012c-2c7e-12313b030c61>I hope you can find this answer helpful.</p>\r\n<p>Fernando Antivero    <br><a href=\"http://blogs.southworks.net/fantivero\">http://blogs.southworks.net/fantivero</a></p>",
    "PostedDate": "2009-11-24T10:58:12.283-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "260499",
    "ThreadId": "76009",
    "Html": "<p>Yeah. if you are very new to Prism, I should suggest you to go through Quick Start samples first. Once you have done, you would suggest you to create the application and test it while reading the documentation.&nbsp;</p>",
    "PostedDate": "2009-11-25T00:37:00.897-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]