[
  {
    "Id": "260527",
    "ThreadId": "76178",
    "Html": "<p>Is there a recommended pattern in prism context for data access or is there a refference implementation sample for data access.</p>\r\n<p>For example:</p>\r\n<p>I am using odp.net which is not directly compateble with linq.</p>\r\n<p>I will implement my Data Access Objects and business object (models)</p>\r\n<p>I am using view, presentationModel, Controller, Service sequence</p>\r\n<p>Where should be my Data access objects in another module or in infrastructure project or else where?</p>\r\n<p>Is there convention, standard, guidance in prism or Composite application wpf framework?</p>\r\n<p>Regards.</p>",
    "PostedDate": "2009-11-25T01:47:17.317-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "260617",
    "ThreadId": "76178",
    "Html": "<p id=0a6b9120-bbec-012c-f794-12313b030c55>Hi</p>\r\n<p id=0a6b9fb0-bbec-012c-f795-12313b030c55>Prism does not provide any guidance on how to implement data access functionality for your application. Where to place your data access objects really depends on whether they are shared across modules or their functionality is specific to a particular one. For example, if you have a single service that will be used by all modules, registering it in the container as a singleton could be a good approach. In this case it wouldn&rsquo;t matter if the service is in an Infrastructure project or in a module that loads all data access services.</p>\r\n<p id=0a6bb910-bbec-012c-f796-12313b030c55>You might find some useful information in the following links:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/dd673617.aspx\">Microsoft Application Architecture Guide, 2nd Edition</a></li>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/dd203144.aspx\">The Data Access Application Block</a></li>\r\n</ul>\r\n<p id=0a6bd880-bbec-012c-f797-12313b030c55>Please let me know if this helps.</p>\r\n<p id=0a6bfb80-bbec-012c-f798-12313b030c55>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-11-25T06:31:48.203-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]