[
  {
    "Id": "262320",
    "ThreadId": "76712",
    "Html": "<p>Hi,</p>\r\n<p>I&nbsp;am currently working on an Application using CAG with Silverlight on MVVM Pattern, In this we created Shell with Multiple Regions say &quot;Top&quot;, &quot;Left&quot;, &quot;Right&quot;, after loading regions with View</p>\r\n<p>we are opening a Popup which in turn contains 2 more Region as &quot;Top&quot; and &quot;Right&quot;, Here i am getting a debugger error might be because i need to properly handle my Region Manager for</p>\r\n<p>Multiple Region with same name.</p>\r\n<p>Can anybody help me out to handle my Region Manager. Let me know if further clarification needed.</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-01T08:09:12.45-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "262396",
    "ThreadId": "76712",
    "Html": "<p id=045add00-c0d6-012c-75f9-12313b030631>Hi</p>\r\n<p id=045aeb40-c0d6-012c-75fa-12313b030631>Based on your description and without knowing the specific error you are getting, it appears that your issue could be related, as you said, to having multiple regions with the same name registered in the <strong>RegionManager</strong>. The exception that is thrown in this kind of situations is: &ldquo;<em>An exception occurred while creating a region with name '%RegionName%'. The exception was: System.ArgumentException: Region with the given name is already registered: %RegionName%.&rdquo;</em></p>\r\n<p id=045b00c0-c0d6-012c-75fb-12313b030631>The simple workaround would be changing the name of one of the regions that share the same name. Another workaround involves using a scoped <strong>RegionManager</strong>. This will allow you to have the same name for regions in different <strong>RegionManagers</strong>.</p>\r\n<p id=045b1ff0-c0d6-012c-75fc-12313b030631>You can read about scoped RegionManagers in this article from the Prism documentation:</p>\r\n<ul>\r\n<li><a href=\"http://msdn.microsoft.com/en-us/library/dd458914.aspx\">How to: Show a View in a Scoped Region</a>&nbsp;</li>\r\n</ul>\r\n<p id=045b3a90-c0d6-012c-75fd-12313b030631>Please let me know if this helps.</p>\r\n<p id=045b5830-c0d6-012c-75fe-12313b030631>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-12-01T10:52:50.27-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]