[
  {
    "Id": "267711",
    "ThreadId": "78259",
    "Html": "<p>Currently the Prism documentation does mention MVVM and &quot;Model-View-ViewModel&quot; in several places, but my suggestion is that be made more prominent in the next version.&nbsp; The &quot;Stock Trader&quot; (&quot;RI&quot; = reference implementation) does make use of the &quot;Presentation Model&quot; pattern, which is basically equivalent to MVVM, but I'd be happier if that was made clearer.&nbsp; The SL and WPF blogs are full of discussion of MVVM and &quot;Model-View-ViewModel&quot;, and that's the naming that new learners (like me) are probably going to be looking for.</p>\r\n<p>One of the things I like about David Hill's excellent Prism VS project templates, which I have used for a while, is that the class and directory names are all explicitly MVVM-oriented.&nbsp; There are directories named Models, Views and ViewModels.&nbsp; See:<br>&nbsp; <a href=\"http://blogs.msdn.com/dphill/archive/2009/05/29/prism-quick-start-kit.aspx\">http://blogs.msdn.com/dphill/archive/2009/05/29/prism-quick-start-kit.aspx</a><br>&nbsp; <a href=\"http://blogs.msdn.com/dphill/archive/2009/06/15/prism-quick-start-kit-update.aspx\">http://blogs.msdn.com/dphill/archive/2009/06/15/prism-quick-start-kit-update.aspx</a></p>\r\n<p>Thanks,<br>Alan Cobb<br><a href=\"http://www.alancobb.com/blog\">www.alancobb.com/blog</a></p>",
    "PostedDate": "2009-12-15T13:26:07.823-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "268014",
    "ThreadId": "78259",
    "Html": "<p id=7ad0cc60-cbf1-012c-b48e-12313b030009>Hi Alan,</p>\r\n<p id=7ad0ead0-cbf1-012c-b48f-12313b030009>The Prism-v2 RI is using the Presentation Model pattern, which is the same pattern as MVVM, the only difference is it's name. It is not using the classic MVP pattern. Prism-v1 was released before the &quot;MVVM&quot; was widely used, but the pattern is the same.</p>\r\n<p id=7ad0ead0-cbf1-012c-b48f-12313b030009>The Prism team is currently taking feedback for the next version of Prism, as David Hill says in <a href=\"http://blogs.msdn.com/dphill/archive/2009/12/09/prism-and-mef.aspx\">this post</a>, and one of the topics they&rsquo;re looking at is providing more guidance on the <strong>ViewModel</strong> pattern (at the end of the post). You can provide this as feedback in the <a href=\"../WorkItem/List.aspx\">Issue Tracker</a>, so other people can vote for it.</p>\r\n<p id=7ad10fc0-cbf1-012c-b490-12313b030009>I would like to clarify that in my blog post, by saying <em>&ldquo;the ViewModel is a bindable Presenter&rdquo;</em>, I am not trying to express that MVP and MVVM are the same. I meant that, as you said, in the high level (testability, separations of concerns) are very similar in what they are trying to achieve.</p>\r\n<p id=448f09d0-cbf2-012c-b4c0-12313b030009>In <a href=\"http://microsoftpdc.com/Sessions/CL22\">this PDC talk</a>, <a href=\"http://johnpapa.net/\">John Papa</a> talks about building MVVM applications with Prism so you might find it useful.</p>\r\n<p id=7ad139c0-cbf1-012c-b491-12313b030009>Please let me know if this helps.</p>\r\n<p id=7ad166c0-cbf1-012c-b492-12313b030009>Damian Schenkelman <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2009-12-16T06:05:36.38-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "269196",
    "ThreadId": "78259",
    "Html": "<p>Hi Damian,</p>\r\n<p>Thanks for your explanation.</p>\r\n<p>Based on your response I editing my original post and&nbsp;title to remove the inaccuracies (editing is nice to have :), and to focus it more.&nbsp;</p>\r\n<p>My main point is that SL-devs like me who are learning MVVM, may be frustrated to find how little there is in the current Prism docs and code that uses that explicit MVVM naming.&nbsp; External Prism+MVVM resources like John Papa's PDC talk, and David Hill's MVVM-oriented templates are great, but I think that should get baked more directly into the Prism docs and demos.</p>\r\n<p>As you suggest in your post, I have added this suggestion to the <a href=\"http://compositewpf.codeplex.com/WorkItem/View.aspx?WorkItemId=5622\">&quot;votable&quot; Issue Tracker list</a>.</p>\r\n<p>Thanks again for your help,<br>Alan Cobb<br><a href=\"http://www.alancobb.com/blog\">www.alancobb.com/blog</a></p>",
    "PostedDate": "2009-12-18T21:52:59.52-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]