[
  {
    "Id": "268467",
    "ThreadId": "78436",
    "Html": "<p>Hi,</p>\r\n<p>Im having problems with regions/view, i have a shell which sets up a number of regions (including a MenuButtonregion, MainRegion), then the menu button gets populated by modules that inject there MenuButtonViews, alls good with this, which makes me happy :-). Then when one of the buttons is clicked a DelegateCommand in the particular MenuButtonViewModel is used to notify the my ModuleController to diplay the view for the MainRegion. This again works nicely, up until the point that one of the Views injected into MainRegion has set itself up some subregions, at this point any attempts to click the mainmenu button will result in an exception becuase I cannot add a view into the MainRegion that now has subregions attached.</p>\r\n<p>What I really want to do (I guess), is prior to injecting a view into the mainRegion I should do some checking on that region and do any necessary unloading of existing views/subregions in it.</p>\r\n<p>What is the best way to achieve this?</p>\r\n<p>Many Thanks, Mark</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-17T05:46:14.53-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "270033",
    "ThreadId": "78436",
    "Html": "<p id=f523d7d0-d158-012c-c024-12313b03013e>Hi Mark,</p>\r\n<p id=f523e530-d158-012c-c025-12313b03013e>I have tried to reproduce your issue with no success. I have created a sample application which addresses your scenario so you can compare the differences. You can download it from <a href=\"http://cid-09f63fc7ac065e5e.skydrive.live.com/self.aspx/p^0p Samples/AddingViewsSample.zip\">here</a>.</p>\r\n<p id=f523f730-d158-012c-c026-12313b03013e>Please let me know if this helps.</p>\r\n<p id=f5240e20-d158-012c-c027-12313b03013e>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>\r\n<p>&nbsp;</p>",
    "PostedDate": "2009-12-22T12:46:29.93-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]