[
  {
    "Id": "269732",
    "ThreadId": "78791",
    "Html": "<p>I've read all the doc (multiple times) and I believe I understand the difference between View-Discovery and View-Injection. &nbsp;With View-Injection I can add many views to a particular region and I'm able to activate them by view-name. &nbsp;With View-Discovery I'm telling Prism up front what view (or delegate that returns a view) maps to a particular region up front. &nbsp;This seems to only support registering a single view to a region (note IRegionManager.RegisterViewWithRegion does NOT allow a ViewName as an argument). &nbsp;I would like to have a way to tell Prism up front about many views that might be activated, and have a means for doing so by ViewName. &nbsp;If this is by design, then I think a better name would be View-Defaulting.</p>\r\n<p>Am I missing something? &nbsp;If I'm forced to do this with View-Injection then from what I can tell, I'm going to have to rewrite/wrap a large portion of the IRegion/IRegionManager infrastructure to do this (keeping a list of Func&lt;object&gt;'s and manually adding/activating views within a region). &nbsp;</p>\r\n<p>Any advice would be appreciated.</p>",
    "PostedDate": "2009-12-21T15:39:21.603-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "272996",
    "ThreadId": "78791",
    "Html": "<p id=51f44720-db90-012c-d641-12313d003531>Hi</p>\r\n<p id=51f45540-db90-012c-d642-12313d003531>With Prism&rsquo;s out of the box functionality, using View Discovery, you can register more than one view with the same region. On the other hand, I have created a blog post that provides a way to register views in regions providing the view name. You can find it in the link below:</p>\r\n<ul>\r\n<li>\r\n<p id=51f46850-db90-012c-d643-12313d003531><a href=\"http://blogs.southworks.net/dschenkelman/2010/01/04/prism-v2-register-views-with-names-using-view-discovery/\">Prism-v2: Register views with names using View Discovery</a></p>\r\n</li>\r\n</ul>\r\n<p id=51f48580-db90-012c-d644-12313d003531>Please let me know if this helps.</p>\r\n<p id=51f49c30-db90-012c-d645-12313d003531>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2010-01-04T10:55:24.853-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]