[
  {
    "Id": "273061",
    "ThreadId": "79731",
    "Html": "<p>The Silverlight Toolkit is now shipping with the extmap.xml files necessary to support assembly cacheing - is this something that can be done for Prism as well? Including Prism in the main shell XAP adds about 120kb, which isn't much, but it is a lot when your total XAP size is only 300kb. I wouldn't worry about it too much if they could at least be cached across multiple Silverlight apps, but currently I'm turning a 180kb XAP into a 300kb XAP to include Prism (it seems Unity is the biggest size culprit). This becomes a bigger issue when you are pushing out daily builds of the main XAP so that the browser's cacheing of the main XAP can never occur - having the Prism XAPs external to the main XAP could help out a good bit in that instance.</p>\r\n<p>Thanks for the consideration!</p>",
    "PostedDate": "2010-01-04T13:27:08.177-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273866",
    "ThreadId": "79731",
    "Html": "<p id=e5046960-dcfa-012c-a17c-12313d018871>Hi</p>\r\n<p id=e5047570-dcfa-012c-a17d-12313d018871>If you believe this would be a good addition in Prism&rsquo;s next version you can create a new item in the <a href=\"../WorkItem/List.aspx\">Issue Tracker</a>. This way people can vote for it an it might be taken into account by the team. In the meantime you can check this article from the Silverlight 3 documentation which explains <a href=\"http://msdn.microsoft.com/en-us/library/dd833069(VS.95).aspx\">How to: Use Application Library Caching</a> with your own assemblies.</p>\r\n<p id=e5048810-dcfa-012c-a17e-12313d018871>Please let me know if this helps.</p>\r\n<p id=e5049b90-dcfa-012c-a17f-12313d018871>Damian Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2010-01-06T09:16:06.713-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "273885",
    "ThreadId": "79731",
    "Html": "<p>thanks for the suggestion, just did it.</p>",
    "PostedDate": "2010-01-06T09:47:51.36-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]