[
  {
    "Id": "288162",
    "ThreadId": "83910",
    "Html": "<p>Hello Guys,</p>\r\n<p>I am working with Composite application guidance and I need your help on the same. I need to create a login page for our application which is in Composite Application Guidance. The shell with the application should not be loaded before the login page. I mean depending upon the result of the login page the shell should be loaded and the application should be accessible. Can any of you guys help me out on this problem.</p>\r\n<p>Thanks and Regards,</p>\r\n<p>Danish</p>",
    "PostedDate": "2010-02-10T04:15:18.41-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "288502",
    "ThreadId": "83910",
    "Html": "<p id=53124ee0-f8b7-012c-999f-1231390c3851 style=\"margin-top:1em;margin-right:0px;margin-bottom:1em;margin-left:0px;text-align:justify;padding:0px\">Hi Danish,</p>\r\n<p>One possible approach could be adding the LoginView to the MainRegion of your application so the user can log-in. Once he enters his credentials and the required validation is performed, you can <a href=\"http://msdn.microsoft.com/en-us/library/dd458932.aspx\">load the necessary modules on demand</a> (which will save you the trouble of loading modules without needing to) and add the required views to their respective region(s).</p>\r\n<p>The following thread deals with similar approaches (although it is for WPF some of the ideas might be useful):</p>\r\n<ul>\r\n<li><a href=\"http://compositewpf.codeplex.com/Thread/View.aspx?ThreadId=58292\"><span>Show login modal form before</span></a></li>\r\n</ul>\r\n<p id=53126720-f8b7-012c-99a1-1231390c3851 style=\"margin-top:1em;margin-right:0px;margin-bottom:1em;margin-left:0px;text-align:justify;padding:0px\">Please let me know if this helps.</p>\r\n<p id=531276f0-f8b7-012c-99a2-1231390c3851 style=\"margin-top:1em;margin-right:0px;margin-bottom:1em;margin-left:0px;text-align:justify;padding:0px\">Damian Schenkelman&nbsp;<br style=\"padding:0px;margin:0px\"><a style=\"padding:0px;margin:0px\" href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2010-02-10T15:27:50.63-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "316955",
    "ThreadId": "83910",
    "Html": "<p>Hi</p>\r\n<p>I'm completly new to Prism and Silverlight in general, but I'm trying to learn it and thought this videos was a very good starting point <a href=\"http://channel9.msdn.com/posts/akMSFT/Creating-a-modular-application-using-Prism-V2-Part-1-of-4--Creating-a-shell-and-modules/\">http://channel9.msdn.com/posts/akMSFT/Creating-a-modular-application-using-Prism-V2-Part-1-of-4--Creating-a-shell-and-modules/</a></p>\r\n<p>After building the application from the walkthrough in the link above I now want to authenticate a user before he can use the application. I like the idea of loading the necessary modules on demand based on the authentication and authorization of the user. But as a complete newbie I really struggle to get a clear understanding how this could be done. Could anyone give me something more concrete on this?</p>\r\n<p>Where do I add the LoginView? In a sub folder in the main silverlight-project where I have the bootstrapper? I cant understand that if you want to show a login-prompt before you access the application features, how could you create a business application? Usually you have to login to an business application. You cant use Windows either without logging on with your credentials. This should be one of the basic and most common walkthroughs when introduced to Silverlight when LOB applications is the goal.</p>\r\n<p>I would really like to get some good advice on this. Can I suggest this to be an post in your blog, Damian?</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks in advance!</p>",
    "PostedDate": "2010-02-21T03:18:31.047-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "681474",
    "ThreadId": "83910",
    "Html": "<p>Hi,</p>\r\n<p>You might find the following blog post useful, which deals with  authentication and role based authorization in Prism (using shared  services):</p>\r\n<p><a href=\"http://blogs.southworks.net/gmaliandi/2011/10/authentication-and-role-based-authorization-in-prism-v4/\">Authentication and role based authorization in Prism v4</a></p>\r\n<p>Thanks,<br /> <br /> Guido Leandro Maliandi<br /> <a href=\"http://blogs.southworks.net/gmaliandi\">http://blogs.southworks.net/gmaliandi</a></p>",
    "PostedDate": "2011-10-07T13:04:41.597-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]