[
  {
    "Id": "291641",
    "ThreadId": "85630",
    "Html": "<p>Hi,</p>\r\n<p>I know that Silverlight and WPF is both supported in CAL. With the project I am working on there should be some intergration with Legacy application. When we use WPF this will work, but Silverlight will not work with this. The goal is to create 1 blackbox module that will hold the legacy and over time this module will decrease when rebuilding parts as CAL Modules. For now we can't use Silverlight, but in the future we want to be able to use silverlight. Depending how fast the development will go this can be 1 year from now, but it can also be 3 years from now.</p>\r\n<p>We are now struggling if we should take the effort to build both in Silverlight as in WPF. I personnaly thing we have to take care that the Architecture is ok that it can use services in the future. The Userinterface should be replacable with Silverlight i gues.</p>\r\n<p>Can you help me to descide if we should use WPF only for now or that we should develope also in Silverlight allready.</p>\r\n<p>Regards,</p>\r\n<p>Johan</p>",
    "PostedDate": "2010-02-17T03:39:16.7-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "292648",
    "ThreadId": "85630",
    "Html": "<p id=00107590-ff87-012c-909d-1231390c8041>Hi Johan,</p>\r\n<p id=001083e0-ff87-012c-909e-1231390c8041>Without having the same  context as you have it is difficult to provide an informed answer (which  I&rsquo;m sure you understand), but I&rsquo;ll do my best to express my point of  view.</p>\r\n<p id=00109530-ff87-012c-909f-1231390c8041>One of the  challenges that Prism was built to address is <a href=\"http://msdn.microsoft.com/en-us/library/dd458864.aspx\">Multi-Targeting</a>.  That is facilitate the creation of applications that share the most of  their code base, between WPF and Silverlight. The guidelines provided in  the Prism documentation about this, the <a href=\"http://msdn.microsoft.com/en-us/library/dd458870.aspx\">project  linker</a>, and <a href=\"http://wpfslguidance.codeplex.com/\">this  guidance</a> you should be able to create a WPF application that can be  &ldquo;replicated&rdquo; for Silverlight without many issues.</p>\r\n<p id=0010b4d0-ff87-012c-90a0-1231390c8041>Something else that you might  want to consider is the <a href=\"http://en.wikipedia.org/wiki/YAGNI\">YAGNI</a> principle. Unless you are completely certain that the Silverlight  application is going to be used, you could avoid developing for  Silverlight as well. Of course, you would need to contrast the possible  risk of having created the Silverlight application with no need, with  the time/money differences between the development team tackling only  WPF or WPF &amp; SL at once.</p>\r\n<p id=0010dc60-ff87-012c-90a1-1231390c8041>Please let me know if this  helps.</p>\r\n<p id=0010fff0-ff87-012c-90a2-1231390c8041>Damian  Schenkelman    <br><a href=\"http://blogs.southworks.net/dschenkelman\">http://blogs.southworks.net/dschenkelman</a></p>",
    "PostedDate": "2010-02-19T07:08:56.993-08:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]