{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "",
    "ClosedDate": null,
    "CommentCount": 1,
    "Custom": null,
    "Description": "Hi all, \r\n\r\nPerhaps someone has a bright idea to help me. The error message as mentioned in the subject of this email suddenly appears in my solution, where it did not before.\r\n\r\nWhat has changed is this: I have changed the project containing BusinessLogic (analog to the AdventureWorks.UILogic in the AW Reference application) to be a portable library and added a 8.1 Phone project to the solution. \r\n\r\nIn the Windows 8.1 Views project (analog to the AdventureWorks.Shopper project) AS WELL AS in the Windows 8.1 Phone project I cannot get rid of the error.\r\n\r\nI don't understand where exactly it is caused, and so I have no clue where to solve it.\r\n\r\n\r\nP.S. It is not easy to provide a small demo-project, the size of my project is a couple of times bigger than the AdventureWorks reference application. If I would be able to isolate the problem to mimic it in a small project, i probably would be able to solve it completely. Sorry, but I cannot make it any mote attractive.\r\n\r\nIs this enough information, or what would I need to provide more?\r\n\r\nAnyone a good suggestion what I did wrong?",
    "LastUpdatedDate": "2015-02-20T00:19:57.247-08:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Unassigned",
      "Severity": 0,
      "Id": 0
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2015-02-17T13:50:04.347-08:00",
    "Status": {
      "Name": "Proposed",
      "Id": 1
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Why do I get this errormessage: 'Sub Main'was not found in 'AppName'",
    "Type": {
      "Name": "Unassigned",
      "Id": 5
    },
    "VoteCount": 1,
    "Id": 10725
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "Laeve this! \nI reconstructed the solution, re-imported teh projects and made new references to the NuGet libs. \nThat makes me face whole new challenges, but that is the subject of other discussions. See:\n[this link](https://prismwindowsruntime.codeplex.com/discussions/581374) and [this one](https://prismwindowsruntime.codeplex.com/discussions/581039)",
      "PostedDate": "2015-02-20T00:19:57.247-08:00",
      "Id": 174943
    }
  ]
}