{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Hi,\r\n\r\nWe are closing this work item, as this is probably not an issue in Prism. For additional support regarding this subject, you could create a thread in the discussions section, where we will help you with your concerns.\r\n\r\nOn the other hand, if you can't use the self extractable download, you might also find the download in the Source Code section useful (http://compositewpf.codeplex.com/SourceControl/list/changesets).\r\n\r\nThanks,\r\n\r\nAgustin Adami\r\nhttp://blogs.southworks.net/aadami",
    "ClosedDate": "2011-09-06T06:52:04.207-07:00",
    "CommentCount": 5,
    "Custom": "",
    "Description": "Hello,\n \nI'm currently trying to extract the sources and nothing happens. I can choose the destination folder and than nothing happens. Any ideas?",
    "LastUpdatedDate": "2013-05-16T05:28:52.833-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2010-06-14T11:39:50.047-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Extracting does not work",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 2,
    "Id": 6864
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I have the same issue.  Windows Vista 32 bit tried downloading with ie and firefox",
      "PostedDate": "2010-08-03T12:45:39.767-07:00",
      "Id": 156243
    },
    {
      "Message": "Are .VBS files allowed to run on your system?  If not, you will have issues as the self extractor launches a .vbs file to do the heavy lifting.\r\nHave you saved the file locally?  \r\nHave you unblocked the file? (in Windows Explorer: right click, properties, \"Unblock\".  This is because your OS is probably trying to protect you from yourself)\r\n",
      "PostedDate": "2010-08-03T16:58:41.323-07:00",
      "Id": 156244
    },
    {
      "Message": "This also occurs if you have PKZip as the default for your .zip files. \r\n\r\nWe have to run the exe till it gets to the point where it asks where to place the files, go to the temp dir where the Source.zip file has been extracted from the .exe, copy that to another dir, cancel out of the exe. Then unzip the source dir on our own. \r\n\r\nYou can also detach PKZip as your default for the .zip, run the .exe and then put it back. But I actually find the hack to be much faster. ",
      "PostedDate": "2010-08-04T07:09:01.3-07:00",
      "Id": 156245
    },
    {
      "Message": "unblock didnt work for me and I am not using pkzip as default for .zip files what is the temp dir where source.zip would go to?",
      "PostedDate": "2010-08-09T12:28:27.44-07:00",
      "Id": 156246
    },
    {
      "Message": "nm I got it  the dir for me was  C:\\Users\\\\AppData\\Local\\Temp\\IXP000.TMP",
      "PostedDate": "2010-08-09T12:30:20.027-07:00",
      "Id": 156247
    }
  ]
}