{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Assembly Caching can now be used to reduce the module's XAP file size. From the documentation (http://msdn.microsoft.com/en-us/library/gg430856%28PandP.40%29.aspx), \"the signed Silverlight Prism Library binaries have the required metadata files to use this feature as well as the libraries from the Silverlight SDK and the Silverlight Toolkit\".\r\n\r\nThank you for your feedback.\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
    "ClosedDate": "2010-12-30T11:35:18.88-08:00",
    "CommentCount": 2,
    "Custom": "",
    "Description": "The Silverlight Toolkit is now shipping with the extmap.xml files necessary to support assembly cacheing - is this something that can be done for Prism as well? Including Prism in the main shell XAP adds about 120kb, which isn't much, but it is a lot when your total XAP size is only 300kb. I wouldn't worry about it too much if they could at least be cached across multiple Silverlight apps, but currently I'm turning a 180kb XAP into a 300kb XAP to include Prism (it seems Unity is the biggest size culprit). This becomes a bigger issue when you are pushing out daily builds of the main XAP so that the browser's cacheing of the main XAP can never occur - having the Prism XAPs external to the main XAP could help out a good bit in that instance.\n \nThanks for the consideration!",
    "LastUpdatedDate": "2013-05-16T05:28:55.03-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2010-01-06T09:47:06.653-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Assembly cacheing for next release of Prism?",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 9,
    "Id": 5704
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "This really is a must have for the Silverlight library, +1 from me!",
      "PostedDate": "2010-01-12T05:45:08.867-08:00",
      "Id": 156204
    },
    {
      "Message": "Hi,\r\n\r\nFor those who need to reduce the download size of their module XAP files, you could check the following chapter from the Prism MSDN documentation, in which the use of Application Library Caching with Prism is explained (among other things):\r\n\r\nhttp://msdn.microsoft.com/en-us/library/gg430856%28PandP.40%29.aspx (Specifically in the \"Reducing the Download Size of Your Module XAP Files\" section of the chapter).\r\n\r\nI hope you find this helpful.\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
      "PostedDate": "2010-12-28T07:23:22.95-08:00",
      "Id": 156205
    }
  ]
}