{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Hi Shawn,\r\n\r\nAs explained on this thread on Microsoft Connect (http://connect.microsoft.com/VisualStudio/feedback/details/530074/unhandled-error-in-silverlight-application-2105-when-building-as-an-x86-configuration), this is a limitation of Silverlight, which \"(...) only supports assemblies that are built AnyCpu (MSIL).\"\r\n\r\nYou might find the workarounds proposed in the aforementioned link useful. Since this is not a Prism Issue, I'm closing it. You might continue your inquires in the Silverlight forums (http://forums.silverlight.net/forums/).\r\n\r\nThank you for your feedback.\r\n\r\nGuido Leandro Maliandi\r\nhttp://blogs.southworks.net/gmaliandi",
    "ClosedDate": "2011-03-22T11:56:51.333-07:00",
    "CommentCount": 0,
    "Custom": "",
    "Description": "I just downloaded Prism 2.2, and built the Prism Assemblies in a Release Build for x86 (as opposed to a Debug build for AnyCPU)\nThen started a new Silverlight Application using VS 2010.\nWithout making any changes I just run the app, to make sure all is well.\nThen I add references to the Silverlight Prism assemblies.\nThen I F5 run the app again.  This time I get a Webpage Error dialog from Internet Explorer saying:\nLine: 56\nError: Unhandled Error in Silverlight Application \nCode: 2105    \nCategory: InitializeError       \nMessage: Failed to load pre-requisites for the application     \n \nWhat gives?  Any idea what I need to do to resolve this?\nThanks,\nShawn.\nPS, When I build the assemblies using the default Debug Build for AnyCPU, and reference these assemblies in my Silverlight app all is well.",
    "LastUpdatedDate": "2013-05-16T05:28:49.717-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2010-09-01T07:43:28.063-07:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Failed to load pre-requisites for the application",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 1,
    "Id": 7201
  },
  "FileAttachments": [],
  "Comments": []
}