{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "A PDF version of the Prism 4 documentation has been released. It can be found in this site:\r\n\r\nhttp://compositewpf.codeplex.com/releases/view/55580",
    "ClosedDate": "2010-12-22T10:01:52.21-08:00",
    "CommentCount": 3,
    "Custom": "",
    "Description": "Prism is great, like a light in the dark... But to be able to use it it must be a flashlight I can bring everywhere (even in my bed to read a bit before sleepin !), not a reading lamp needing me to be glued to my desktop and my 2 monitors PC :-)\nSo supplying PDF will help a lot because most of ebook readers know how to display PDFs but not CHM files (at least my Sony PRS700 can't read CHM but sure all ebook readers are the same on this point).\n \nThanks in advance !",
    "LastUpdatedDate": "2013-05-16T05:28:55.187-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2009-12-22T10:54:13.567-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Request : Supplying PDF instead of CHM (for ebook readers for example)",
    "Type": {
      "Name": "Issue",
      "Id": 3
    },
    "VoteCount": 21,
    "Id": 5637
  },
  "FileAttachments": [],
  "Comments": [
    {
      "Message": "I agree, pdfs are better than chms because of ebook readers. If you can throw in multiple formats (ePub, pdf etc) so much the better!",
      "PostedDate": "2010-08-27T02:56:04.553-07:00",
      "Id": 156199
    },
    {
      "Message": "I support the request! I have most programming books/documentations in either PDF or kindle format now. I want to have everything on my Kindle, so I can just have only VS 2010 consume the whole screen all the time :-)",
      "PostedDate": "2010-08-27T07:31:35.777-07:00",
      "Id": 156200
    },
    {
      "Message": "We are planning do this as part of Prism v4, but it will likely come after the main release to MSDN.",
      "PostedDate": "2010-10-14T15:35:58.29-07:00",
      "Id": 156201
    }
  ]
}