{
  "WorkItem": {
    "AffectedComponent": {
      "Name": "",
      "DisplayName": ""
    },
    "ClosedComment": "Hi,\r\n\r\nAs far as I know, when creating a new Silverlight Application or Silverlight Class Library, its output path is configured to \"Bin\\Debug\\\" by default, as it can be seen in the project's properties, inside the \"Build\" tab (This does not happen with \"Web\" project, only with the \"Application\" or \"Class Library\" projects.)\r\n\r\nTherefore, based on my understanding, this is the reason of why the Prism's Silverlight projects have their output folder set as \"Bin\": to maintain Silverlight's default configuration.\r\n\r\nHence, we are closing this work item, as this is not an issue in Prism.\r\n\r\nTake into account that you can manually change the output folder of the projects by changing the \"Output file:\" string, inside the the \"Build\" tab of the project's properties like mentioned before.\r\n\r\nRegards,\r\n\r\nDamian Cherubini\r\nhttp://blogs.southworks.net/dcherubini",
    "ClosedDate": "2012-06-05T11:11:29.173-07:00",
    "CommentCount": 0,
    "Custom": "",
    "Description": "I use TortoiseSVN's \"Global Ignore Pattern\" feature with \"/bin\" and \"/obj\" to prevent inadvertently adding generated files to the repository.  This appears to be case-sensitive.\n \nI'd appreciate if the Silverlight projects were changed to match the VS2008 default (\"bin\"), which is used for the Desktop projects.  Thanks...",
    "LastUpdatedDate": "2013-05-16T05:29:00.647-07:00",
    "PlannedForRelease": "",
    "ReleaseVisibleToPublic": false,
    "Priority": {
      "Name": "Low",
      "Severity": 50,
      "Id": 1
    },
    "ProjectName": "CompositeWPF",
    "ReportedDate": "2009-01-30T08:15:39.587-08:00",
    "Status": {
      "Name": "Closed",
      "Id": 4
    },
    "ReasonClosed": {
      "Name": "Unassigned"
    },
    "Summary": "Change Silverlight project output folder names from \"Bin\" to \"bin\"",
    "Type": {
      "Name": "Feature",
      "Id": 1
    },
    "VoteCount": 2,
    "Id": 3729
  },
  "FileAttachments": [],
  "Comments": []
}